{"notes":{"event":"I had sex before marriage with Boyfriend who then left me and is with another girl, and calls to say hurtful things","thought":"He was supposed to marry me\n\nI never realized he would be this kind of person\n\nMy mother knows everything and it hurts her\n\nWhy did this happen?\n\nI am unimportant, ugly, worthless, not good enough\n\nI feel like I can't do anything because that's what he said for 6 years and I listened\n","feelings":"hurt\nvery small\nsad\nhelpless\nshocked\nheartbroken\n","behaviors":"difficulty focusing\n\ndon't want to talk to anyone","labels":{"control-fallacy":true,"blaming":true},"new_thought":"'He may have only said those things because he's hurt or insecure, but whatever the reason, his words are not my truth. My truth is that I am the heroine of my own story, strong, important, worthy and good. Life is hard and I'm doing the best I can, the people around me see that, they experience this with me because they love me and we move forward together.\""},"messages":[{"user":"thinker","text":"I am not feeling well… I got emotionally abused by my former boyfriend.. right now my exams are going on.. I cannot concentrate on studies.. it’s getting really hard.. he calls me sometimes and had told me that he’s seeing someone else or in relationship with the new girl.. it affects me so much.. my heart breaks into millions of pieces… I had loved him.. we were together for 6 years.. but being in relationship he started seeing someone else… he made her his friend and now he said that they started dating.. that girl was totally a stranger to him… he had lied to her about his family and background and everything.. I came to know about these things from one of my common friends.. but he had treated me so badly from past 3 months.. I wasn’t knowing anything.. what was happening.. he started ghosting me… I was calling him for days, I didn’t sleep I used to call him all night long.. he used to call me back another day saying that he was busy.: but one of our common friends told me the truth.. what was he doing and why was he doing.. I’m really hurt.. he didn't even said that he want to breakup with me.. he just went away.. not telling me anything.. I deserved to know the truth.. I had given so much time to him.. and on the last call he said very harsh things to me.. about my face, my career, he made me feel really small and even abused me verbally… I’m so sad.. and I couldn’t bear with this thing right now.. I don’t know what to do.. my studies are affecting.. my life and everything got affected…","time":1671946308000},{"user":"helper","text":"Hi there, welcome back. I believe we had a session which didn't working out timing wise, a week or so ago. I'm glad you tried again. Allow me a moment to read your story and refresh my memory. ","time":1672246938000},{"user":"helper","text":"I'm sorry :( This sounds so so challenging. You were with someone for 6 years, and they left in a way that took the ground out from underneath you. There is another girl now, he calls and says harsh things to you, and you can feel it affecting your studies. I can sense that you want to feel right again, to move on emotionally so that you can focus on your studies and career and the rest of your life, but something is holding you back. Maybe we can focus on that that today in order to get you through the next step to clarity and wellness","time":1672247155000},{"user":"helper","text":"Hm, it seems perhaps we've missed each other again. Come back again if you like","time":1672247770000},{"user":"thinker","text":"Heyy","time":1672249224000},{"user":"thinker","text":"Hello","time":1672249258000},{"user":"helper","text":"Oh hi ","time":1672249321000},{"user":"thinker","text":"Can we talk ? ","time":1672256080000},{"user":"thinker","text":"If you’re there.. ","time":1672256098000},{"user":"thinker","text":"I’m not feeling well.. ","time":1672256106000},{"user":"helper","text":"Hello. Yes, I can make myself available. You would like to do the session now? Just give me 5 minutes please ","time":1672256229000},{"user":"helper","text":"okay, I am ready now. Thanks for your patience. I'm sorry you're not feeling well, what's on your mind?","time":1672256530000},{"user":"thinker","text":"Okay.. I’m here only ","time":1672257006000},{"user":"thinker","text":"Those things which had happened.. he promised me a future till now.. he even told me talk about our marriage to my parents… and then he did all those things .. ","time":1672257061000},{"user":"helper","text":":( ","time":1672257143000},{"user":"helper","text":"that is horrible ","time":1672257148000},{"user":"helper","text":"I'm sorry this happened to you, it sounds like you had a lot of your life put into this person","time":1672257162000},{"user":"helper","text":"Are you able to talk now? ","time":1672257289000},{"user":"thinker","text":"Yess ","time":1672257294000},{"user":"helper","text":"okay","time":1672257302000},{"user":"helper","text":"Sessions with my typically last about an hour, and we have a payment of 25$ suggested at the end","time":1672257320000},{"user":"helper","text":"plus a review that will add a few minutes","time":1672257331000},{"user":"thinker","text":"Okay sure:)","time":1672257334000},{"user":"helper","text":"this is okay for you?","time":1672257340000},{"user":"thinker","text":"Yaa!!","time":1672257343000},{"user":"helper","text":"okay, great. Thank you","time":1672257403000},{"user":"helper","text":"So then, it seems this terrible thing happened and it has been difficult to move on, especially frustrating because you have other things in your life like studying and your career that are being affected. We can't change the past here, but hopefully we can help you tackle the future in the best way with healthy thoughts and feelings","time":1672257463000},{"user":"thinker","text":"Yaa.. thankyou..","time":1672257481000},{"user":"thinker","text":"I am feeling really low.. I came to know he was using me physically and financially for all those years… now he discarded me.. and got another girl as his new supply ","time":1672257549000},{"user":"helper","text":"what a terrible realization ","time":1672257592000},{"user":"helper","text":"and it seems he is also rubbing this in your face a little, calling you and saying cruel things?","time":1672257609000},{"user":"thinker","text":"Yes.. he saying really bad things which I couldn’t bare.. so I’ve blocked him.. he was constantly abusing me emotionally ","time":1672257653000},{"user":"helper","text":"oh, that's a big and important step to take","time":1672257661000},{"user":"helper","text":"how has it been since you blocked him?","time":1672257666000},{"user":"thinker","text":"And saying really hurtful things.. my heart ache all the time.. whenever these things come to my mind ","time":1672257689000},{"user":"thinker","text":"I’ve blocked him on 17th of December.. he called me last on 16th but I cried a lot after all those things which he had said .. so the next day I’ve blocked him ","time":1672257739000},{"user":"helper","text":"That takes a lot of strength","time":1672257753000},{"user":"helper","text":"I know the hurtful things he said may continue to hurt, but now there is some space to heal","time":1672257771000},{"user":"helper","text":"So when he said hurtful things to you, like how he was with another girl and things about you, what thoughts came up for you?","time":1672257790000},{"user":"thinker","text":"I felt really low in myself.. he had commented on my face that my face looked like this.. he called for the sake of humanity… ","time":1672257834000},{"user":"thinker","text":"I don’t know what thought came.. but I was really hurt… ","time":1672257848000},{"user":"thinker","text":"I felt like reverting back those words to him which he said ","time":1672257859000},{"user":"thinker","text":"but I couldn’t ","time":1672257863000},{"user":"thinker","text":"I want to say lots of things to him.. but that’s just not me ","time":1672257879000},{"user":"helper","text":"I know it can be hard to dig into it, but if we find the thoughts you are having specifically that are causing this pain, perhaps we can change them and change the pain","time":1672257914000},{"user":"thinker","text":"I was most affected by thing that for his sexual pleasure he said that he’d marry me.. and according to my ethics.. I never wanted to do.. but he had forced me… but I never realised that he would be this kind of person ","time":1672257971000},{"user":"helper","text":"I'm sorry I\"m not sure I understand. Are you saying that you wanted to wait until marriage for sex, and so he said he would marry you? ","time":1672258006000},{"user":"thinker","text":"Yes I wanted to wait until marriage ","time":1672258006000},{"user":"helper","text":"Did he pressure you into doing it before you were ready?","time":1672258024000},{"user":"thinker","text":"Yes","time":1672258033000},{"user":"helper","text":":(","time":1672258036000},{"user":"helper","text":"I see","time":1672258037000},{"user":"thinker","text":"that thing affects me most","time":1672258044000},{"user":"helper","text":"of course, it is a very vulnerable thing to be intimate with someone that way","time":1672258057000},{"user":"helper","text":"and I can see how you feel hurt and used now that he is no longer marrying you","time":1672258068000},{"user":"thinker","text":"But mostly that was the only thing which affects me.. which is holding me.. which hurts me most ","time":1672258096000},{"user":"helper","text":"This piece about having sex before marriage is the part that hurts the most?","time":1672258116000},{"user":"thinker","text":"my family is really strict.. I’m from India.. and we have some rules which I disobeyed.. and my mother knows everything now.. which hurts her too.. and I feel sad after seeing her like this","time":1672258164000},{"user":"thinker","text":"Yes this is the part which hurts me most ","time":1672258181000},{"user":"helper","text":"I see, I have some close understanding of how it can be in a strict/religious household around intimate matetrs","time":1672258186000},{"user":"helper","text":"when you saw that your mother knows everything, and you think she is hurt and feel sad, what other thoughts come up for you?","time":1672258223000},{"user":"thinker","text":"I felt helpless.. when all these things were happening.. I felt shocked.. why it had happened? I felt heartbroken.. I felt unimportant, ugly, worthless, not good enough, ","time":1672258295000},{"user":"thinker","text":"all these things I felt in myself ","time":1672258305000},{"user":"helper","text":":( ","time":1672258312000},{"user":"thinker","text":"I felt like I can’t do anything in life ","time":1672258325000},{"user":"thinker","text":"because he had said all those things to me","time":1672258333000},{"user":"thinker","text":"and I was listening to him from past 6 years","time":1672258343000},{"user":"helper","text":"It sounds like he told you a lot things about you that weren't really about you at all, but coming from something poisonous in him. But because you were very close, and you opened yourself to him and trusted him, you began to believe these hurtful things about you ","time":1672258405000},{"user":"helper","text":"Let me see if I can quickly summarize where we are so far.. ","time":1672258426000},{"user":"helper","text":"You were with a man for 6 years, during which he pressured you and you had sex before marriage which goes against your familial rules. Recently, he left with no warning. He is with another girl and he sometimes calls to say hurtful things. You blocked him, but you still have difficulty moving forward because you have thoughts like \"My mother knows everything and it hurts her\" and \"he said these things so they're true\" \" I am unimportant, ugly, worthless.. etc\" ","time":1672258541000},{"user":"helper","text":"When you think these things, you feel hurt, small, helpless, and deeply sad","time":1672258554000},{"user":"helper","text":"When you feel this way, what actions do you do or not do? ","time":1672258564000},{"user":"thinker","text":"Yes.. all these things","time":1672258569000},{"user":"thinker","text":"i don’t do anything when I feel all these things.. I cannot concentrate on anything.. I used to zone out from my present self.. I try to snap out of it but it’s really difficult.. sometimes I won’t even hear peoooe calling my name ","time":1672258623000},{"user":"helper","text":"I see, so difficulty focusing and being present","time":1672258635000},{"user":"helper","text":"that is understandable","time":1672258638000},{"user":"thinker","text":"but these days I’m trying.. to do something good so that I couldn’t focus on him ","time":1672258695000},{"user":"helper","text":"yes I can sense you really trying to move onward and upward without him :) ","time":1672258715000},{"user":"helper","text":"I can see how strong and capable you are of this, even in all the pain","time":1672258729000},{"user":"thinker","text":"Thankyou :)","time":1672258736000},{"user":"helper","text":"Of course","time":1672258743000},{"user":"thinker","text":"But I don’t feel good in myself at all.. I don’t feel like talking to anyone ","time":1672258764000},{"user":"helper","text":"Now the next step is to look at some cheese, I think this will help you look at the situation a little differently, and feel differently about yourself","time":1672258766000},{"user":"helper","text":"Would you like me to show you what I mean? ","time":1672258788000},{"user":"thinker","text":"Ya? ","time":1672258794000},{"user":"helper","text":"okay, one of the biggest ones standing out to me here is control fallacy","time":1672258818000},{"user":"helper","text":"Now, you have the troubling thought \"I feel like I can't do anything because that's what he said for 6 years and I listened, I am unimportant, ugly, worthless, not good enough\"","time":1672258862000},{"user":"helper","text":"what a terrible and hurtful thing to hear about yourself, and then to internalize it too! ","time":1672258879000},{"user":"helper","text":"You see yourself as all these things because you gave him the control to say that about you, and then removed yourself from the ability to shun it and instead feel like you can't do anything, like it is true","time":1672258922000},{"user":"helper","text":"But in reality, you have so much power! ","time":1672258942000},{"user":"helper","text":"You were with this person for 6 years, didn't really know him, and now he shows his true colors and you have all the power back in your own hands","time":1672258961000},{"user":"helper","text":"and you choose what you believe ","time":1672258965000},{"user":"helper","text":"and you can choose to see that he may say those things for reasons which we could never see or understand, but not because they are true","time":1672258996000},{"user":"helper","text":"they are his own problems expressing themselves as cruelty","time":1672259006000},{"user":"helper","text":"but you are NOT a helpless victim","time":1672259014000},{"user":"helper","text":"you are the heroine in your own story","time":1672259020000},{"user":"thinker","text":"Yes.. I know that I’m good.. I was always good.. I loved him but some people cannot understand love or see love.. they go for materialistic things.. heart doesn’t matter for some people.. the one who’s he had loved for 6 years , he aaid such cruel things to her ","time":1672259121000},{"user":"helper","text":"to who, sorry?","time":1672259134000},{"user":"helper","text":"you?","time":1672259138000},{"user":"thinker","text":"To me","time":1672259142000},{"user":"helper","text":"yes, okay I understand","time":1672259148000},{"user":"helper","text":"you had a great capacity for love","time":1672259155000},{"user":"helper","text":"and it wasn't returned","time":1672259158000},{"user":"helper","text":"this is hard :(","time":1672259162000},{"user":"thinker","text":"I somehow believed everything.. whatever he had said .. all those bad things ","time":1672259190000},{"user":"helper","text":"but even harder is that he says these things to you and you then take it upon yourself, so we can do that differently now from this point forward.. you can see the truth of it. That you are stronger than you know","time":1672259198000},{"user":"helper","text":"I can see you are a sensitive and trusting being","time":1672259213000},{"user":"helper","text":"but now you see he didn't deserve the love or trust, because he abused it","time":1672259230000},{"user":"helper","text":"and you can save it for someone else","time":1672259238000},{"user":"thinker","text":"I don’t feel like I can ever trust anyone in my life now","time":1672259256000},{"user":"thinker","text":"or I’d be able to love anyone ","time":1672259266000},{"user":"helper","text":"that's okay ;( I know.. it is a hard thing to consider now","time":1672259272000},{"user":"helper","text":"there is no rush to go there yet","time":1672259276000},{"user":"thinker","text":"yes.. ","time":1672259284000},{"user":"helper","text":"I think we can start just by knowing that you aren't all those terrible things he said","time":1672259289000},{"user":"thinker","text":"ya sure ","time":1672259293000},{"user":"helper","text":"you also mentioned that one of the biggest things giving you pain right now is that your mother knows and it hurts her","time":1672259309000},{"user":"thinker","text":"Yes.. she’s sad because of me ","time":1672259316000},{"user":"helper","text":"I'd like to look into that a little bit too, I can see how it's affecting you","time":1672259331000},{"user":"helper","text":"This is a little bit of blaming... she may be sad, but you are too.. it is a terrible thing to be hurt that way, and I think she may be sad with you, because her daughter is in pain","time":1672259385000},{"user":"thinker","text":"She was sad because I was hospitalised.. I was all weak and really sick.. I had withdrawn from my studies too.. but with god’s grace I got admission another time and my year didn’t wasted ","time":1672259435000},{"user":"helper","text":"oh, that's wonderful!","time":1672259443000},{"user":"helper","text":"so I can see that you are blaming yourself for your mother being sad","time":1672259456000},{"user":"thinker","text":"Yes","time":1672259458000},{"user":"helper","text":"but if she is sad because you are hurt, and you hurt yourself more with these thoughts that you're hurting her.. well you see how it becomes a vicious cycle?  ","time":1672259497000},{"user":"helper","text":"She wants the best life for you, and you can start by knowing that a terrible thing happened, but it isn't your fault. Life is really hard sometimes. ","time":1672259530000},{"user":"thinker","text":"I don’t get upset in front of her.. but I feel sad and low in myself all the time","time":1672259538000},{"user":"helper","text":"And you worry she can sense that?","time":1672259546000},{"user":"thinker","text":"I’m having low self esteem issues too ","time":1672259565000},{"user":"thinker","text":"yes","time":1672259571000},{"user":"helper","text":"yes, because of all those words you internalized, which we just discussed.. I know.. hopefully some of that will change now","time":1672259585000},{"user":"helper","text":"so you are hurt, and internalizing bad words about yourself, and then becoming more hurt... then seeing how that affects your mom, and feeling more hurt... and all of these things are digging you deeper into a pain which seems impossible to escape","time":1672259632000},{"user":"helper","text":"so I think if we look at the very root of it when can change some of these hurtful thoughts and create new ones. Hopefully if you have more healing thoughts in yourself you will also be able to focus again on your studies, be present with the people who are good in your life, and begin to rebuild ","time":1672259691000},{"user":"helper","text":"Would you like to write a new thought to combat all the old cruelties? ","time":1672259711000},{"user":"thinker","text":"umm.. I don’t know","time":1672259729000},{"user":"thinker","text":"but ya I’ll try to keep myself busy.. so that I won’t think much about these things","time":1672259758000},{"user":"thinker","text":"may be after sometime I won’t feel hurt ","time":1672259773000},{"user":"helper","text":"Being busy can be good.. but do you also hear the solution I am offering here ? ","time":1672259782000},{"user":"helper","text":"Do you see the flaw in the control fallacy and the blaming? ","time":1672259792000},{"user":"thinker","text":"yes ","time":1672259796000},{"user":"helper","text":"Does that help to take the bite out of some of the old thoughts? Because they aren't really true, and we can see that now","time":1672259816000},{"user":"helper","text":"you are not unimportant, worthless, or ugly. You are none of those things. You only believed that because you thought you didn't have control, and you do!","time":1672259839000},{"user":"thinker","text":"yes those thoughts were not true.. he may have said those things because he’s the one who’s hurt.. because hurt people hurts people ","time":1672259862000},{"user":"helper","text":"yes.. such a sad truth","time":1672259871000},{"user":"helper","text":"That seems like a good beginning to a new thought...","time":1672259884000},{"user":"thinker","text":"he might be having some insecurities for himself.. so he took out on me","time":1672259910000},{"user":"thinker","text":"yes.. I’m the heroine of my story and my life ","time":1672259944000},{"user":"thinker","text":"I tried my 100% to save this relationship ","time":1672259958000},{"user":"thinker","text":"I tried everything.. but some people cannot understand ","time":1672259974000},{"user":"helper","text":"'He may have only said those things because he's hurt or insecure, but whatever the reason, his words are not my truth. My truth is that I am the heroine of my own story, strong, important, worthy and good. Life is hard and I'm doing the best I can, the people around me see that, they experience this with me because they love me and we move forward together.\"","time":1672259975000},{"user":"thinker","text":"Yes exactly ","time":1672259995000},{"user":"helper","text":"I think you took a really important step, blocking him and knowing that you are moving forward now. You have cut off the painful words from without, and now we are cutting them off from within too","time":1672260022000},{"user":"thinker","text":"It was affecting me.. I had no other option left but only to block him ","time":1672260035000},{"user":"helper","text":"I'm going to put that new thought in the new thought box if you're happy with it? Or would you like to edit it at all?","time":1672260040000},{"user":"thinker","text":"yes, I’m happy ","time":1672260057000},{"user":"helper","text":"that's so great! ","time":1672260064000},{"user":"thinker","text":"One thing that eats me from inside.. that he had promised to marry me for his own physical needs.. and used me ","time":1672260130000},{"user":"thinker","text":"I felt used ","time":1672260137000},{"user":"helper","text":":( ","time":1672260143000},{"user":"helper","text":"You did what you did with the information you had at the time","time":1672260155000},{"user":"helper","text":"and I know how icky a feeling that can be","time":1672260161000},{"user":"helper","text":"There is some loss there, having given so much and feeling like it wasn't returned with marriage as promised","time":1672260190000},{"user":"helper","text":"I'm sorry","time":1672260191000},{"user":"thinker","text":"I was always a one woman kind of person.. he knew this.. that’s why he promised but broke it when things got serious ","time":1672260228000},{"user":"helper","text":"You are still strong and learning and you will move forward from this experience with wisdom and patience. ","time":1672260230000},{"user":"helper","text":"It's okay to be angry","time":1672260244000},{"user":"thinker","text":"Promises were very important to me ","time":1672260262000},{"user":"helper","text":"I know this new thought may not address this specific trouble, I can see there are many layers of hurt in the experience","time":1672260289000},{"user":"helper","text":"perhaps you can come back again to explore this layer, of the broken promise, in another session","time":1672260304000},{"user":"thinker","text":"Ya sure ","time":1672260309000},{"user":"thinker","text":"Thankyou so much for helping me ","time":1672260318000},{"user":"helper","text":"in the meantime, what feelings come up for you when you think this new thought: \"'He may have only said those things because he's hurt or insecure, but whatever the reason, his words are not my truth. My truth is that I am the heroine of my own story, strong, important, worthy and good. Life is hard and I'm doing the best I can, the people around me see that, they experience this with me because they love me and we move forward together.\"?","time":1672260331000},{"user":"thinker","text":"After reading this.. I felt somewhat better ","time":1672260376000},{"user":"helper","text":"yay! ","time":1672260410000},{"user":"helper","text":"So here is how the new thought works, practice practice practice","time":1672260421000},{"user":"thinker","text":"I’ll try this from now ","time":1672260453000},{"user":"helper","text":"whenever you are dealing with the aftermath of this breakup, remember to think your new thought: 'He may have only said those things because he's hurt or insecure, but whatever the reason, his words are not my truth. My truth is that I am the heroine of my own story, strong, important, worthy and good. Life is hard and I'm doing the best I can, the people around me see that, they experience this with me because they love me and we move forward together.\" and hopefully it will help you feel empowered and ready to take life on with presence and movement","time":1672260465000},{"user":"helper","text":"Great, I think it will treat you well","time":1672260475000},{"user":"helper","text":"and how are you feeling now compared to when we started? ","time":1672260484000},{"user":"thinker","text":"I’m feeling better now.. except the heart ache is constant.. it won’t go.. but I’m feeling way better than before ","time":1672260516000},{"user":"helper","text":"yes the loss is hard :( loss of love.. loss of promise.. I know","time":1672260529000},{"user":"helper","text":"that will heal with time","time":1672260534000},{"user":"helper","text":"and now you know you are worthy of healing, it isn't your fault, you are good","time":1672260548000},{"user":"helper","text":"<3","time":1672260549000},{"user":"thinker","text":"Thankyou.. ","time":1672260564000},{"user":"helper","text":"Okay with that we are wrapped. Feel free to come again to explore this other part around the broken promise","time":1672260581000},{"user":"helper","text":"Please take a few minutes to fill the review and payment on the right","time":1672260594000},{"user":"thinker","text":"Yes sure:)","time":1672260610000},{"user":"helper","text":"And may I ask, would you be interested in sharing this session publicly? It has the potential to help people with similar trouble","time":1672260619000},{"user":"thinker","text":"ya sure.. I can share ","time":1672260629000},{"user":"helper","text":"okay, thanks so much! it was a pleasure speaking with you today","time":1672260633000},{"user":"helper","text":"until next time","time":1672260635000},{"user":"thinker","text":"Thankyou for helping me :)","time":1672260649000}]}