{"notes":{"thought":"that I'm not enough, never will be, never will accomplish anything, and will never have a prayer answered in any meaningful way\n\nEverything I set out to do just falls apart \n\n\nthese things didn't help you before, why would they help you now? this is a waste of time\n\nshowing that I'm down, showing that I'm hurt, makes me a target","feelings":"Depression\nIsolation\nHeart withered up\n","event":"Friend stated dating (possibly engaged) to my ex","behaviors":"Hard time completing things\nIgnore feelings\nWork harder\n\n","labels":{"black-or-white-thinking":true},"new_thought":"\"I am worthy of love and it begins with the love I have for myself\""},"messages":[{"user":"thinker","text":"Depression stemming from isolation","time":1626193636000},{"user":"helper","text":"Welcome to Cheeseburger Therapy! My name is Nathan and I'll be here to talk with you today. ","time":1626307169000},{"user":"thinker","text":"Hi Nathan.  My name is Ian.","time":1626307182000},{"user":"helper","text":"Hey Ian, thanks for joining. I know it's not always easy to seek help from someone, especially a stranger. But I think we might find that you came to the right place","time":1626307226000},{"user":"thinker","text":"Thank you for your time today.  I appreciate you spending it with me, and I hope ","time":1626307267000},{"user":"thinker","text":"heck I don't know what I was going to say there","time":1626307274000},{"user":"helper","text":"haha its alright. It's the cool part about this time together. There's no big agenda other than talking through something that's troubling you.","time":1626307307000},{"user":"helper","text":"How are you feeling right now?","time":1626307312000},{"user":"thinker","text":"A little better than I was when I scheduled this","time":1626307321000},{"user":"thinker","text":"I spent some time with an old friend, took a long drive.  I'm sick with bronchitis but getting over it","time":1626307337000},{"user":"thinker","text":"mentally I'm worn out.  it's a really long story, so I'm not sure where to begin with it all","time":1626307362000},{"user":"helper","text":"Oof I've had bronchitis before, it's no fun :/ ","time":1626307388000},{"user":"helper","text":"I am happy to hear that you are feeling a bit better though! Even a small amount of progress is still progress. ","time":1626307411000},{"user":"helper","text":"We will focus on your present state today as you noted above when you first mentioned what was troubling you, which was \"depression stemming from isolation.\" Are you okay with that?","time":1626307470000},{"user":"thinker","text":"I am.  I'm not sure I used the right words, but I understand focusing on the present","time":1626307489000},{"user":"helper","text":"And if the past has a part to play than of course we will do our best to address that :)","time":1626307508000},{"user":"thinker","text":"Thank you, Nathan.  I appreciate your... procedure?  professional whatsit?  I don't know the word for what I'm trying to say but I'm genuinely grateful","time":1626307546000},{"user":"helper","text":"Thanks Ian! That means a lot. ","time":1626307562000},{"user":"helper","text":"Well lets focus in now on this troubling thought and see what we might be able to discover.","time":1626307579000},{"user":"helper","text":"Tell me, was there an event that happened recently when you began to notice this depression creeping in? ","time":1626307605000},{"user":"thinker","text":"The most recent is that someone who was once my friend is dating someone I've cared for a long time about, who is an ex, and I saw a picture of them together which looked like maybe they got engaged?","time":1626307644000},{"user":"helper","text":"I can imagine that must have been triggering to see that picture. I'm sorry that happened man. What did it feel like when you saw that picture and had the thought that maybe they got engaged? ","time":1626307692000},{"user":"thinker","text":"that I'm not enough, never will be, never will accomplish anything, and will never have a prayer answered in any meaningful way","time":1626307718000},{"user":"thinker","text":"which is a lot but I mean.  it's been rough","time":1626307725000},{"user":"thinker","text":"me and the woman in question, Amber, dated for about 15 months in 2017-18","time":1626307742000},{"user":"thinker","text":"I moved from Michigan to Florida to be with her.  But after a while, it felt like she was always mad at me, and I can understand why.  Her family didn't like me, I  have a famously short temper (not violent, I just say dumb things), was always short on cash because I have a hard time holding down jobs","time":1626307819000},{"user":"thinker","text":"which ironically is all the hallmarks of a serial killer but thankfully I haven't had that problem","time":1626307839000},{"user":"thinker","text":"so we split.  I dated another girl, Gabby, and then we split again after I moved home 2 hours away from the town where I dated girl 1 (amber).  ","time":1626307872000},{"user":"thinker","text":"I tried to get into a college up north.  Me and amber remained friends, as did Gabby and I, and when I was working on getting into this school, amber was talking to me in ways that made me think she wanted to get back together with me","time":1626307913000},{"user":"thinker","text":"I kind of brushed her off because of course I was mad, I wasn't good enough for her the first time and now she wants me back while I'm trying to move cross country again?","time":1626307941000},{"user":"thinker","text":"eventually, college fell through.  And I felt foolish for brushing Amber off.  So I thought, just to see if there was something left, maybe we ought to spend some time together, maybe we ought to celebrate new years (2019-2020).  But I didn't want to make it weird, so I invited a friend along.","time":1626308007000},{"user":"thinker","text":"My friend is inheritting his father's business, worked the same job for 8 years, makes good money, drives a nice car, and the two hit it off right in front of me.  Two weeks later they were dating","time":1626308041000},{"user":"thinker","text":"I never went off on them.  Just told her how I felt, told him I didn't think I could talk to him for a while.  It's been 15 months","time":1626308060000},{"user":"thinker","text":"Me and Gabby ended up back together, and I threw everything at our relationship.  But I was 29, she was 22, her parents didn't approve, and it fell apart about two weeks before christmas","time":1626308098000},{"user":"thinker","text":"and part of me really wants to believe that I could have made things work with Gabby if I could have afforded to move back to my hometown 2 hours away, but covid made rent crazy across the entire city.  It's still too expensive to move back","time":1626308145000},{"user":"thinker","text":"so now I'm double dumped, in less than a year, still living with mom, making crap money.   ","time":1626308164000},{"user":"thinker","text":"I really feel like everything I set out to do just falls apart","time":1626308174000},{"user":"thinker","text":"I met Amber back in highschool, cared for her the minute I saw her.  And honestly, I kind of waited for my chance to be with her.  And I feel like maybe, she just wanted someone who was so enamored with her that she'd mold herself to be whatever she needed to be for me?  Because she did it for my friend when they got together","time":1626308224000},{"user":"thinker","text":"I understand that's a lot","time":1626308238000},{"user":"helper","text":"I hear you, I'm still here by the way","time":1626308243000},{"user":"helper","text":"You are completely fine!","time":1626308250000},{"user":"thinker","text":"Sorry, my friend","time":1626308253000},{"user":"helper","text":"no need to say sorry. I want you to know that this time, right now, is for you :)","time":1626308274000},{"user":"helper","text":"Take it how you need it. I am just hear to listen and guide ","time":1626308289000},{"user":"thinker","text":"Thank you, Nathan","time":1626308304000},{"user":"helper","text":"I can really empathize with you Ian. I have gone through some similar scenarios in the past. Break ups are never easy. They actually suck quite a bit. I don't know anyone that really cared for someone and broke that felt 'great' aftwerwards lol","time":1626308363000},{"user":"helper","text":"And I can understand why you might be having these thoughts that you are not enough and that you might never will be. You aren't alone Ian. We have been there, as a people. We are prone to wander and to get heart broken and confused and lost. ","time":1626308420000},{"user":"thinker","text":"I know I'm not the only one.  I think maybe I take it harder because I might have aspergers?  had a bad childhood, that thing","time":1626308453000},{"user":"thinker","text":"I really attach to people","time":1626308463000},{"user":"helper","text":"It sounds to me like you value connection and relationships? ","time":1626308479000},{"user":"thinker","text":"I'm like a 6 year old girl watching disney movies, I think","time":1626308493000},{"user":"thinker","text":"I want to believe there's someone out there for me, that we'll have a long and happy life.  But I'm 30 now.  I can't even get into tech school without having to fight for half of what they give anyone else","time":1626308527000},{"user":"thinker","text":"who's going to want me?  after the person I wanted the most turned out to be less interested in me than she let on","time":1626308547000},{"user":"helper","text":"I can see how these thoughts are starting to compile, it's becoming a snowball of sorts. A negative experience that leads to unhelpful thoughts and it begins to roll down hill and picks up pace.","time":1626308609000},{"user":"helper","text":"Ian, I don't 'know' you but to me you sound like a well-spoken, loving individual that really cares about people and values finding a love that will last forever. That's admirable! ","time":1626308663000},{"user":"helper","text":"I know things are rough right now, maybe even really rough but today marks the start of something new if you choose it :)","time":1626308695000},{"user":"helper","text":"Do you want to start taking steps forward man?","time":1626308708000},{"user":"thinker","text":"I have to.  I can't be like this forever","time":1626308718000},{"user":"thinker","text":"when I was deep in a fever the other day, I had that thought that I really wished it wouldn't break and it just ended me.  Like, not suicidal, but you know, \"if it happens it won't bother me\"","time":1626308758000},{"user":"helper","text":"I have thoughts like that at times too, it happens. But we are going to make some change today :)","time":1626308794000},{"user":"thinker","text":"Thank you, Nate.  I want to be better","time":1626308810000},{"user":"helper","text":"Well in order to do that, we are going to focus on you being you and we will take a positive step in the right direction and see if we can create a different type of snowball thought progression that will help take you to the places you want. ","time":1626308876000},{"user":"helper","text":"Ian, when you are feeling depressed and isolated, having these thoughts that if the fever took you than you wouldn't mind. You know, those types of thoughts and feelings, how do you think those impact the way you behave? Have you noticed anything differently in your actions (not including being sick).","time":1626308972000},{"user":"thinker","text":"I feel like everything isn't worth doing","time":1626308987000},{"user":"thinker","text":"I'll start a game, turn it off, listen to a song, stop listening because I'll somehow connect it to my situation, start a show, turn it off because it's a waste of time and not helping me, sometimes I'll clean and fold laundry, and sometimes I'll just lay down and try to sleep it off","time":1626309034000},{"user":"helper","text":"Would you call this a lack of motivation?","time":1626309061000},{"user":"thinker","text":"maybe","time":1626309072000},{"user":"thinker","text":"I just have that thought, \"these things didn't help you before, why would they help you now?  this is a waste of time\"","time":1626309089000},{"user":"thinker","text":"I only have a highschool education.  I feel like all the time up until now was wasted","time":1626309106000},{"user":"helper","text":"I can tell you it wasn't a waste of time but I don't think that will mean anything to 'hear' it from me. You have to believe it and I know it isn't easy to believe.","time":1626309154000},{"user":"helper","text":"So I see that when you are feeling depressed and you have these thought's that these things didn't you help you in the past so why the hell would it help now, then that leads to a lack of motivation to try/complete new tasks. ","time":1626309211000},{"user":"thinker","text":"only when I'm on my own.  When I'm at work, it's easy to ignore these thoughts","time":1626309226000},{"user":"thinker","text":"I change oil in cars.  I can't do it wrong or someone's car will get damaged, so I push through it","time":1626309246000},{"user":"thinker","text":"but when I don't have work, I really just fall apart","time":1626309259000},{"user":"helper","text":"What is it about changing the oil in car that helps you concentrate and not focus on the things that are bothering you? ","time":1626309301000},{"user":"helper","text":"Are you good at changing oil?","time":1626309307000},{"user":"helper","text":"Man, I wish I knew how to to do that haha","time":1626309313000},{"user":"thinker","text":"trust me, it's messy and sometimes painful.  I've scarred my hands pretty bad working","time":1626309330000},{"user":"thinker","text":"you said I sound well spoken and loving.  ","time":1626309339000},{"user":"thinker","text":"the people I work with see that as \"mouthy and weak\"","time":1626309346000},{"user":"thinker","text":"showing that I'm down, showing that I'm hurt, makes me a target","time":1626309357000},{"user":"thinker","text":"I have a hard time making friends, and a harder time not making agitators.  The only thing I can do to make it in this world is hide it and work harder","time":1626309384000},{"user":"thinker","text":"and I can't hurt someone else by being hurt.  Doing an oil change wrong can wreck an engine faster than you'd think","time":1626309407000},{"user":"thinker","text":"before I did this, I was a janitor in a hospital.  During covid, of course","time":1626309424000},{"user":"thinker","text":"so there was plenty to concentrate on.  And then me and Gabby were together, and all I could do was throw myself into it.  Who would stay with someone who was bent up over an ex?","time":1626309456000},{"user":"helper","text":"A lot of us stay places that might not be healthy for us. It is hard to make change. Yet sometimes, life forces our hand and causes us to change. ","time":1626309515000},{"user":"helper","text":"I think now would be a good time for me to do a summary of what we've talked about. How does that sound?","time":1626309541000},{"user":"thinker","text":"of course, that sounds good","time":1626309550000},{"user":"helper","text":"I encourage you as I am typing away a summary to take a few deep breaths and focus on them. Focus on here in the present.","time":1626309591000},{"user":"helper","text":"Can you do that for me?","time":1626309601000},{"user":"thinker","text":"of course.  type away.","time":1626309609000},{"user":"helper","text":"These last couple years have been a bit of a roller coaster. You've had such closeness with a gal named Amber, and you really wanted things to work. You dated for a long time but things ended. You met someone else as you were in the middle of your healing process and quickly fell for her, you even moved a long distance to be closer to her but things as well did not work out, her parents did not approve. After some deep losses, it has left you, understandably hurt, depressed, isolated. And then all of a sudden you see this picture of Amber with another guy, a guy she might be getting engaged to and this triggers you. You start to have these loud thoughts that \"I am not enough, never will be, never will accomplish anything, and will never have a prayer answered in a meaningful way\". These thoughts lead you to feel that nothing is really worth doing because they won't help. So you find yourself having a hard time completing things, staying focused. The only way that seems to help is when you are at work and that is because you have to stay focused because if you don't something bad could happen.  ","time":1626309944000},{"user":"helper","text":"Take some time to read this and please let me know if anything is missing or doesn't fit Ian. ","time":1626309970000},{"user":"thinker","text":"pretty close","time":1626310044000},{"user":"thinker","text":"good enough for government paperwork lol","time":1626310065000},{"user":"helper","text":"haha well I'm glad I passed the government paperwork test","time":1626310081000},{"user":"thinker","text":"unless you're measuring a short lobster the government is rarely thorough","time":1626310113000},{"user":"thinker","text":"or filing taxes for that matter","time":1626310124000},{"user":"helper","text":"I know you said some more details of course, but did I get the overall picture? Is there anything else you want to remind me of or include? ","time":1626310162000},{"user":"thinker","text":"I guess all I have to add is sometimes, it feels like my heart is withered up","time":1626310185000},{"user":"thinker","text":"you ever see a flower when it dies and just dries up into hard little pieces?  it's like that","time":1626310200000},{"user":"thinker","text":"like the spot that's supposed to have a heart just feels empty, or full of corkwood","time":1626310216000},{"user":"thinker","text":"ffs I never wanted money, or power, or anything crazy, I just wanted to be loved, you know?","time":1626310236000},{"user":"helper","text":"That's a beautiful thing to aim for :)","time":1626310252000},{"user":"thinker","text":"it is, but I don't think anyone wants \"love\"","time":1626310270000},{"user":"helper","text":"You know, I think everyone wants love. I know you do, I do, and other people I know. And I bet if you thought deeply about it you know people in your life, family/friends that also value love.","time":1626310315000},{"user":"thinker","text":"I just feel like love comes second nowadays.  Amber didn't \"love\" mike at first, I don't think.  I know mike didn't love her.  But she was a good fit for him, and he was well off enough that she'd never have to worry","time":1626310354000},{"user":"helper","text":"Love can looks so different from person to person or from season to season. It is a mysterious thing. But an amazing thing to value and search for. It sounds like that's what you are doing. Cheers to you :) ","time":1626310406000},{"user":"helper","text":"Because you are right, not everyone values love like they do other things.","time":1626310424000},{"user":"thinker","text":"thank you Nathan.  I appreciate you seeing that in me","time":1626310445000},{"user":"helper","text":":)","time":1626310452000},{"user":"helper","text":"Another thing I see is some 'cheese' in some of these thoughts","time":1626310473000},{"user":"helper","text":"haha","time":1626310474000},{"user":"helper","text":"let me explain 'cheese'. It's kinda like what we do here ;)","time":1626310490000},{"user":"thinker","text":"cheese?","time":1626310498000},{"user":"helper","text":"Yeah so 'cheesy thoughts' as we call them are basically different types of patterns of thinking that we are all prone to get stuck in. And it's not necessarily that these cheesy thoughts are terrible, usually they are there to try and help us, guide us, protect us even. But sometimes they get stuck repeating and morphing into other things that become quite unhelpful and actually really affect us negatively. ","time":1626310600000},{"user":"helper","text":"If you look to your right, next to the 'Thought\" category, there is a little cute cheeseburger icon. If you click it there will be a list of these cheesy thoughts. Our goal is to pick at least one that applies to the patterns of thinking that are in. Once we identify this we can begin the next step of healing :)","time":1626310722000},{"user":"helper","text":"I like to invite people to choose a cheesy thought that they feel resonates with them. But if you are not sure than I can go ahead and do it.","time":1626310765000},{"user":"thinker","text":"I imagine it falls under \"black and white\" thinking","time":1626310774000},{"user":"helper","text":"Why do you think that?","time":1626310793000},{"user":"thinker","text":"I used the word \"never\" a lot","time":1626310819000},{"user":"thinker","text":"a very definitive, un-moving word","time":1626310827000},{"user":"helper","text":"That's good insight and self-awareness Ian :)","time":1626310851000},{"user":"thinker","text":"Is it really?","time":1626310864000},{"user":"helper","text":"Yeah man! I do this a lot with people and you are doing a wonderful job. Even to just know how you feel and what you are thinking is a big step in self-awareness.","time":1626310905000},{"user":"helper","text":"I also, would agree that black and white thinking is applicable to these thoughts","time":1626310921000},{"user":"thinker","text":"in other thoughts, I tend to be very black and white","time":1626310934000},{"user":"thinker","text":"I think I get very annoyed at ambiguity.  like when you order something at a restaurant, and you have to play 20 questions or something","time":1626310957000},{"user":"thinker","text":"quick story:  I ordered a burger once with extra pickles.  I got like, two on the burger.  I asked for a few more, and the cook got upset saying \"because it doesn't come with pickles originally, technically, two is extra\"","time":1626310998000},{"user":"thinker","text":"what I wanted to say was \"quit being a pendantic prick and give me the pickles,\" but I think I handled it much better than that when I said, \"well can I have some anyways\"","time":1626311024000},{"user":"thinker","text":"that's a huge aside but you see what I mean.  Why worry about grey shades, things either are or aren't","time":1626311054000},{"user":"helper","text":"I like the example. You seem to value honesty and bluntness. Not because you are rude but because it helps with clear communication and healthy expectations. ","time":1626311110000},{"user":"helper","text":"Like you said \"why worry about grey shades, things either are or arent.\"","time":1626311134000},{"user":"helper","text":"And in a lot of cases that is the truth and that is something you seem to care about. But can you see how black and white thinking doesn't help in ALL cases like the one you are going through. When you thoughts are always black and white and they are spun in a web of negative thinking then the whole 'white' part of the thinking had disappeared and you are left with darkness, unpleasant thoughts that are pushing you deeper into depression and isolation. ","time":1626311250000},{"user":"helper","text":"When you have the thought \"I am not enough and I will NEVER be and I will NEVER accomplish anything and I will NEVER have a prayer answered in a meaningful way\" that type of black and white thinking causes you harm by isolating you, creating a negative self-image that almost reinforces those thoughts and puts you deeper into a mindset that nothing is worth doing. \"why watch tv, it doesn't help, why listen to a song, it doesn't help...etc.","time":1626311415000},{"user":"thinker","text":"I think it doesn't help that I obsessively or impulsively don't do anything that might remind me of Amber","time":1626311449000},{"user":"thinker","text":"I love musicals, but I watched a lot with her.  And she loved Harry Potter (I know, grow up), and she loved Disney (again...) so of course seeing this reminds me of her","time":1626311486000},{"user":"thinker","text":"and it snowballs into stupid things","time":1626311491000},{"user":"thinker","text":"I can't listen to Witch of the West Mer-Land because of it and she never even heard the damn song","time":1626311507000},{"user":"helper","text":"Our emotions can be tied to a lot of different things and our thoughts try to protect us. But sometimes we have to choose our thoughts, take control of whats going on up there in our brains because our brains don't really know just how strong and loving we are, just how strong, resilient and loving YOU are Ian.  ","time":1626311585000},{"user":"thinker","text":"I really want to","time":1626311604000},{"user":"thinker","text":"I just want to move on, and some part of me wants to believe it'll all come back together with her and I again","time":1626311624000},{"user":"thinker","text":"or me and Gabby","time":1626311628000},{"user":"thinker","text":"that's an entirely different problem to unpack though","time":1626311645000},{"user":"thinker","text":"how do I deal with black and white thoughts?","time":1626311654000},{"user":"helper","text":"Your acknowledge them, which is what we are doing, You recognize them for what they, call them out in a loving way towards yourself but also look at how it affects your emotions and see how that snowballs into your behaviors which then reinforce that black and white thinking. Look at how it makes us a self-fulfilling prophecy in a sense. And then when we can see all this, and process it and then we choose a New Thought. Which is the next and last part of our journey today :)","time":1626311784000},{"user":"thinker","text":"loving myself is difficult, I have to be honest","time":1626311825000},{"user":"helper","text":"Stay honest that is good. Loving ourselves is not easy. Is that what you feel called to do? To love yourself?","time":1626311864000},{"user":"thinker","text":"I feel like it's important","time":1626311873000},{"user":"thinker","text":"called to do?  Like my calling in life?","time":1626311880000},{"user":"helper","text":"Not like a 'calling' more specifically geared towards right now, in order to deal with black and white thinking. Do you think if you could find a way to love yourself better that it might move you in a positive direction?","time":1626311933000},{"user":"thinker","text":"I don't know, to be very honest","time":1626311942000},{"user":"thinker","text":"I feel like... I don't know.  I need something to break, somewhere","time":1626311952000},{"user":"thinker","text":"I need to pass my senior panel at work, or I need to get started on HVAC school","time":1626311964000},{"user":"helper","text":"A redirection of energy towards other things you care about","time":1626311986000},{"user":"thinker","text":"oh hell I don't know, I think getting my finances straight would help a lot","time":1626312016000},{"user":"thinker","text":"I mean, that's not a terrible thing to start with","time":1626312039000},{"user":"thinker","text":"I need to work out more, but I need a coach for that because I'm not really doing well with it","time":1626312053000},{"user":"helper","text":"I love to see all these goals, all these things you are going to accomplish :)","time":1626312071000},{"user":"helper","text":"It all starts with a thought","time":1626312079000},{"user":"helper","text":"Our thoughts (as you have found out) are VERY powerful. They have the ability to take and to give life (metaphorically) ","time":1626312108000},{"user":"helper","text":"So with all these goals in mind and these values that we have identified and knowing that you are stuck in a black and white thinking pattern, what is a New Thought you can begin to focus on? One that you can think of and tell yourself that you feel could help push you in the direction you want to go.","time":1626312192000},{"user":"thinker","text":"I want to focus on losing weight","time":1626312210000},{"user":"thinker","text":"it takes a lot to lose weight.  A lot of thought and effort","time":1626312220000},{"user":"thinker","text":"maybe it'll help keep my mind off things","time":1626312227000},{"user":"thinker","text":"getting in shape might make me feel better","time":1626312240000},{"user":"thinker","text":"I mean I was kind of already doing it but I feel like I didn't put enough into it","time":1626312255000},{"user":"helper","text":"I think physical health is a huge part of our mental health and when we get in 'shape' it directly affects the way we think about our self-image and helps our mentality.  ","time":1626312336000},{"user":"helper","text":"I think that is a good goal and let's write that down :) but lets come up with a new thought together that will hep you achieve these goals.","time":1626312368000},{"user":"thinker","text":"I'm not sure","time":1626312384000},{"user":"thinker","text":"\"it's worth it to do these things\"","time":1626312392000},{"user":"thinker","text":"\"if I work out, I will see a return\"","time":1626312403000},{"user":"helper","text":"That's a good start Ian","time":1626312404000},{"user":"thinker","text":"\"If I like who I see, I will care for him more\"","time":1626312416000},{"user":"helper","text":"ooohh you seem to be getting deeper and closer to the root","time":1626312434000},{"user":"helper","text":"Keep digging man","time":1626312439000},{"user":"helper","text":"When you come up with that new thought it will be like a light bulb","time":1626312452000},{"user":"thinker","text":"\"If I love the person I see, it will be easier to find someone who loves him as well\"","time":1626312470000},{"user":"helper","text":"These are good thoughts man! How are the sitting with you?","time":1626312492000},{"user":"helper","text":"they*","time":1626312497000},{"user":"thinker","text":"they sit well, I think","time":1626312503000},{"user":"thinker","text":"don't worry about typos, I can tell you're typing on a phone and that sucks","time":1626312518000},{"user":"thinker","text":"I've learned to recognize typing patterns.  I'm weird like that","time":1626312531000},{"user":"thinker","text":"wow that was creepy","time":1626312536000},{"user":"helper","text":"haha okay man","time":1626312536000},{"user":"thinker","text":"I'm sorry","time":1626312540000},{"user":"helper","text":"naw, you're not creepy ","time":1626312543000},{"user":"thinker","text":"this is why I assume I have aspergers","time":1626312551000},{"user":"helper","text":"You're intelligent :)","time":1626312562000},{"user":"helper","text":"Okay back to the thought","time":1626312569000},{"user":"helper","text":"do you think you found the thought? Or do you want me to give it a shot?","time":1626312583000},{"user":"thinker","text":"I want to hear what you think","time":1626312634000},{"user":"helper","text":"I think you really value love and connection and want more for your life so I would say something like....","time":1626312680000},{"user":"helper","text":"\"I am worthy of love and it begins with the love I have for myself\" ","time":1626312713000},{"user":"thinker","text":"wow I like that","time":1626312723000},{"user":"thinker","text":"I think that works","time":1626312730000},{"user":"helper","text":"Yeah? What feelings come up when you read that? I like to read it out loud sometimes, I find that it makes it more cemented in my head. (might give it a try)","time":1626312761000},{"user":"thinker","text":"I get choked up a bit","time":1626312764000},{"user":"helper","text":"Is that a good thing Ian?","time":1626312778000},{"user":"thinker","text":"I think so","time":1626312782000},{"user":"thinker","text":"I've been listening to music, traditional music this whole time.  right now it's \"I vow to thee\"","time":1626312800000},{"user":"helper","text":"I just got chills","time":1626312807000},{"user":"helper","text":"\"I vow to thee to thyself\" ","time":1626312821000},{"user":"helper","text":"ooops","time":1626312829000},{"user":"helper","text":"\"I vow to thee to love thyself\"","time":1626312838000},{"user":"thinker","text":"the song was written post-WW1 to commemerate the english who'd died overseas","time":1626312883000},{"user":"thinker","text":"it alluded to the kingdom of heaven and sacraficing for a peaceful future","time":1626312912000},{"user":"helper","text":"That's beautiful man","time":1626312920000},{"user":"helper","text":"So shall we stick with\"I am worthy of love and it begins with the love I have for myself\" as your New Thought?","time":1626312947000},{"user":"thinker","text":"We shall","time":1626312963000},{"user":"thinker","text":"or rather, I shall","time":1626312967000},{"user":"thinker","text":"well, you too, if you need to","time":1626312979000},{"user":"thinker","text":"obviously it's not exclusive to me","time":1626312985000},{"user":"helper","text":":)","time":1626312986000},{"user":"helper","text":"You are right, it's not. But in this case this is your new thought. I want you to imagine it is like a crystal someone that really loves you gave you and asked you to carry around in your pocket at all times. And when triggering things happen that bring about cheesy thoughts that are hurtful, I want you to \"grab the stone\" remember it. Repeat the words in your head,\"I am worthy of love and it begins with the love I have for myself\"","time":1626313103000},{"user":"thinker","text":"maybe I can go to the flea market, get one of those little rocks on a necklace or something","time":1626313124000},{"user":"thinker","text":"something physical to actually hold and think the words on","time":1626313138000},{"user":"thinker","text":"rosaries don't really work for me anymore","time":1626313144000},{"user":"helper","text":"That sounds like a good idea :) sometimes having that physical momento can be really helpful ","time":1626313173000},{"user":"thinker","text":"I might need it, to be honest","time":1626313188000},{"user":"helper","text":":)","time":1626313216000},{"user":"helper","text":"So how are you feeling now compared to when we started?","time":1626313228000},{"user":"thinker","text":"better","time":1626313233000},{"user":"thinker","text":"still have bronchitis, will have to wait to use the gym","time":1626313243000},{"user":"thinker","text":"people get touchy about hacking and coughing these days","time":1626313250000},{"user":"thinker","text":"but I will put more effort into setting up a workout plan","time":1626313262000},{"user":"helper","text":"And remember this New Thought when troubling times or you are caught in black and white thinking. It seriously helps :)","time":1626313297000},{"user":"thinker","text":"I will ","time":1626313302000},{"user":"thinker","text":"I promise I will","time":1626313305000},{"user":"helper","text":":)","time":1626313306000},{"user":"thinker","text":"Thank you Nate","time":1626313311000},{"user":"helper","text":"You are very welcome Ian. Come back anytime to chat if you want to. ","time":1626313333000},{"user":"thinker","text":"of course","time":1626313358000},{"user":"helper","text":"Also, would it be okay for us to share an anonymized version of this session with the public? ","time":1626313358000},{"user":"thinker","text":"of course, if what we discussed can help others, I want to help others","time":1626313374000},{"user":"helper","text":"That's great man :) embodying that love you value already.","time":1626313396000},{"user":"helper","text":"Have a wonderful rest of your night Ian! You are loved","time":1626313407000},{"user":"thinker","text":"Thank you Nate.  I hope you have a great night as well.  You're a great help and I hope everything goes well for you","time":1626313432000},{"user":"helper","text":":)","time":1626313435000},{"user":"helper","text":"Hey there! This is Nathan from Cheeseburger Therapy. I just wanted to do a check-in with you to see how this 'New Thought' is holding up and to see how you are doing? Have you been using this new thought like we talked about? ","time":1628619714000},{"user":"helper","text":"Reminder of your new thought:\"I am worthy of love and it begins with the love I have for myself\" ","time":1628619732000}]}