{"notes":{"event":"saw my training could take 3 more years than expected","thought":"this could disrupt my plan for family and other goals\n\nI'll sacrifice one value and regret it.\nI'll be unhappy with the decision\n\nOne, or the other, or both would be very challenging, and I won't be capable, or won't be able to balance, and would sacrifice one later if not now.","feelings":"Fear, worried, scared\nStressed for the future & having to make the decision.","behaviors":"waste time overthinking\n\ncreate those future scenarios to try to weigh non-existent matters to make a present decision\n\ndelay and procrastinate on tasks I should be doing now\n\nwatch shows to distract myself from the overthinking","labels":{"fortune-telling":true,"black-or-white-thinking":true},"new_thought":"I can firmly say and accept that i am interested in this specialty despite the extra years of training and that hesitancy to confront that came in thinking i would postpone my value of family that's 3 extra years in training not necessarily 3 years delaying my other value per say soo....."},"messages":[{"user":"thinker","text":"hi!","time":1663952442000},{"user":"helper","text":"Hello. :)","time":1663952446000},{"user":"helper","text":"How are you today?","time":1663952452000},{"user":"thinker","text":"i am doing good","time":1663952459000},{"user":"helper","text":"Oh, that's nice.","time":1663952460000},{"user":"helper","text":"That might make it feel funny to go into troubles.","time":1663952470000},{"user":"thinker","text":"yeah a little maybe ","time":1663952489000},{"user":"helper","text":"Ok, but not too much? Are you feeling up to the task?","time":1663952497000},{"user":"thinker","text":"yeah i am i just have a time restriction ","time":1663952513000},{"user":"helper","text":"Ok! What time?","time":1663952516000},{"user":"thinker","text":"i was trying to finish in an hour plus 10mins ","time":1663952564000},{"user":"helper","text":"Sure, let's shoot for an hour.","time":1663952567000},{"user":"thinker","text":"thank you ","time":1663952570000},{"user":"thinker","text":"i appreciate that ","time":1663952572000},{"user":"helper","text":"Me too. :)","time":1663952576000},{"user":"helper","text":"Ok, so when you're ready, start describing what is most troubling to you in this moment.","time":1663952594000},{"user":"thinker","text":"well i recently found an interest in a specialty and yesterday i was browsing the time frame for training and its 3 more years than expected ","time":1663952659000},{"user":"helper","text":"Oh wow... 3 years.","time":1663952660000},{"user":"thinker","text":"3 in addition to the four i had already accounted for ","time":1663952678000},{"user":"helper","text":"Oye vey!","time":1663952680000},{"user":"thinker","text":"and so i don't i just was excited and motivated but then i also started to get scared and worried just thinking about having to go through that and then well also wanting other things ","time":1663952722000},{"user":"thinker","text":"like a family and wondering about time","time":1663952734000},{"user":"helper","text":"Yeah.","time":1663952738000},{"user":"helper","text":"Like it could conflict with your other wants and goals.?","time":1663952750000},{"user":"thinker","text":"yesss ","time":1663952754000},{"user":"helper","text":"Yeah. That sounds hard. This happened just recently... where are you with it now? What is troubling to you right now about it?","time":1663952778000},{"user":"thinker","text":"it happened on wed when the interest sprouted and yesterday i was searching more about it ","time":1663952804000},{"user":"thinker","text":"what i find more troubling right now is making that decision of pursuing that interest and perhaps specialty and also if i am even capable of accomplishing that and just weighing those thoughts with my other goal to have and build a family ","time":1663952880000},{"user":"helper","text":"Yeah, hm. What is the interest, and what are the benefits you get from pursuing that interest? What would it mean to you to complete the training and enter the specialty?","time":1663952917000},{"user":"thinker","text":"hmm ","time":1663952945000},{"user":"helper","text":"More important is the meaning and value you get from it, not the specific interest.","time":1663952949000},{"user":"thinker","text":"i see ","time":1663952976000},{"user":"thinker","text":"well i'd be practicing something that is exciting, thrilling, and challenging ","time":1663953029000},{"user":"helper","text":"ah... ok.!","time":1663953030000},{"user":"thinker","text":"to start ","time":1663953031000},{"user":"helper","text":"An exciting career, that you can derive meaning from?","time":1663953041000},{"user":"helper","text":"That you can grow into?","time":1663953048000},{"user":"helper","text":"That you can become good at?","time":1663953056000},{"user":"thinker","text":"yeah ","time":1663953068000},{"user":"helper","text":"Okay. So on wednesday you got excited by this possibility. It sounds like the idea really clicked with you, and got you excited, but then on thursday you saw how long it would take just to go through the training, and that conflicted with your expectations for when you'd like to start a family, and perhaps some other goal as well.","time":1663953133000},{"user":"thinker","text":"yes ","time":1663953141000},{"user":"thinker","text":"so far ","time":1663953147000},{"user":"helper","text":"It sounds like it might be especially difficult, if I imagine myself in your shoes, to be able to compare these two goals, because they feed different values. The family value is a different thing than the career/excitement value, and it might be hard to think about how to choose when you are trading off one for the other.","time":1663953192000},{"user":"thinker","text":"exactly, i can't really compare them which makes it harder to weigh them on a scale ","time":1663953215000},{"user":"helper","text":"Yeah. The family value tends to be a more basic need than the career value, on maslow's hierarchy of needs. Our people tend to come first. They are a basic need, our community, or love. And so when that is threatened, it can be very troubling, in a basic way, and I can see that disrupting your thoughts and excitement about the career.","time":1663953275000},{"user":"thinker","text":"you nailed it right in the spot ","time":1663953290000},{"user":"thinker","text":"hehe ","time":1663953292000},{"user":"thinker","text":"like i am afraid of sacrificing one or making a decision to prioritize one and wonder if i'll regret it or if i'll be happy with the decision i make ","time":1663953376000},{"user":"helper","text":"Ohh... yeah. That makes sense. I just wrote those thoughts down in a more distilled form in the notes: \"I'll sacrifice one and regret it\" and \"I'll be unhappy with the decision\".","time":1663953416000},{"user":"helper","text":"These are both fears about the future.","time":1663953424000},{"user":"helper","text":"When you think these thoughts, what do you feel?","time":1663953432000},{"user":"thinker","text":"i feel worried and stressed for the future and having to make that decision ","time":1663953465000},{"user":"thinker","text":"i am also scared because one or the other and both would be very challenging and i do fear not being capable at time especially with the career alone and then if i could do both i am scared that i could not balance it and that i would sacrifice one if not now later on ","time":1663953563000},{"user":"helper","text":"Wow. I totally get that. This is a super hard challenge in today's society I think. There's even a cultural expectation to do both, and do both really well, sometimes.","time":1663953599000},{"user":"helper","text":"I've been present with this myself, so I just want to tell you that I relate, and thanks for talking about this with me.","time":1663953616000},{"user":"thinker","text":"yeah that's definitely true, culturally there is a huge pressure, no yeah its just true haha ","time":1663953663000},{"user":"helper","text":"haha","time":1663953666000},{"user":"thinker","text":"i just wanted to say that i grew up with the value of family and that i do want it independently of the cultural pressure but then just in that moment analyzing i thought to myself if the cultural pressure was never there would i think differently or do i actually want it and is it just the cultural pressure i am ignoring ","time":1663953747000},{"user":"thinker","text":"that was the little hesitation there ","time":1663953760000},{"user":"helper","text":"ah, yeah. this was a moment you were taking to reflect on what you want and value underneath it all.","time":1663953776000},{"user":"thinker","text":"yeah ","time":1663953780000},{"user":"helper","text":"yeah! that's pretty good in this situation I think because underneath it all you are looking at two stories that are coming into conflict. there's the exciting story of you in a career that is challenging and meaningful! and the (maybe warm and fuzzy) story of you building a family, that is deep within you.","time":1663953822000},{"user":"helper","text":"and you are writing your own story of your real, actual life, and now you are making choices and discerning what you want and where you will take yourself.","time":1663953846000},{"user":"helper","text":"it seems quite troubling from the perspective of either of these stories to run into the conflict of the other story taking over your life entirely!","time":1663953864000},{"user":"helper","text":"it brings up fear, and worry. You feel the stress of the thought that in the future you'll regret your choice, because you sacrificed something that matters to you, and that you'll be unhappy with the decision.","time":1663953898000},{"user":"helper","text":"When you are feeling that fear and worry, what do you end up doing or not doing, in your behavior?","time":1663953915000},{"user":"thinker","text":"i definitely waste time overthinking and creating those future scenarios trying to weigh non-existent matters to make a present decision ","time":1663953971000},{"user":"thinker","text":"wasting time doing that causes me to delay and procrastination on tasks and studying i should be doing ","time":1663954020000},{"user":"thinker","text":"i also end up watching shows to distract myself from the overthinking which helps but then i've lost time that i require in other important tasks ","time":1663954068000},{"user":"helper","text":"Good job describing your behaviors! Those are very clear.","time":1663954081000},{"user":"thinker","text":"hehe ","time":1663954086000},{"user":"thinker","text":"it happened so recently its quite fresh ","time":1663954100000},{"user":"helper","text":"Yes, that must be a blessing at least!","time":1663954108000},{"user":"helper","text":"It is very present with you now.","time":1663954114000},{"user":"helper","text":"That makes it easier to analyze.","time":1663954119000},{"user":"helper","text":"Let's look at that, because I just chose a cheese of \"fortune telling\", which is when you have a thought considering one possibility in the future, when there could be a great many, and you end up not responding to the present.","time":1663954151000},{"user":"helper","text":"In this case, you are considering the distant future, after you've gone through the training for this specialization, and/or have a family but didn't do the training— when you have a scary thought that \"I'll sacrifice one value and regret it\" or \"I'll be unhappy with the decision\". Those are both distant future thoughts! And they are scary. They put you in a state of fear and stress for the future, when you have to make the decision now. And that leads you to think think think think think think think about that future state you are worried about, of course, because fear is an emotion of focussssing. And so it focuses you on this distant future, and you don't end up looking at the present. This thinking ends up being too much! And you realize you need to stop it, at least subconsciously, and so you end up watching shows to distract yourself. Meanwhile, you're delaying and procrastinating on tasks that you should be doing *now*. This is all happening because of the fortune telling nature of the thought you're having in reaction to the threatened values of family and career that you're perceiving in reaction to the event of seeing that your training could take 3 more years than expected!","time":1663954319000},{"user":"thinker","text":"yessss exactly hehe ... ","time":1663954323000},{"user":"helper","text":"I also highlighted the cheese \"Black or White thinking\", because you are looking at these values as sacrificing one for the other, fairly black and white. But there could be shades of grey here, a broad spectrum of possibilities in your future. And you might take that into account when addressing the present.","time":1663954369000},{"user":"thinker","text":"aaaa i hadn't seen it like that ","time":1663954382000},{"user":"helper","text":"What do you think? Is anything missing from this summary? Do any new thoughts come up here?","time":1663954403000},{"user":"thinker","text":"no it's true, i agree here...it's very subtle but when you point it out i understand it ","time":1663954428000},{"user":"thinker","text":"whether i choose one or both i'm only seeing the troubling aspects of it all ","time":1663954449000},{"user":"thinker","text":"but it doesn't have to be ","time":1663954462000},{"user":"helper","text":"Yeah, and the trouble here is the threat to your values of family and exciting challenging career.","time":1663954484000},{"user":"thinker","text":"right!!! ","time":1663954490000},{"user":"helper","text":"Those are good things! And good things are great to have available in your life, and you can choose, moment-by-moment, and find new ways in the middle perhaps to get them in a balance that meets you.","time":1663954519000},{"user":"thinker","text":"i like that.. \"moment-by-moment\" because i am trying to make a decision in the future which doesn't make sense ","time":1663954544000},{"user":"helper","text":"that's so hard!","time":1663954547000},{"user":"thinker","text":"very ","time":1663954552000},{"user":"helper","text":"It sounds like you are also exploring and understanding what you want in these values, and what combination of them you want for yourself as you author your life.","time":1663954577000},{"user":"helper","text":"And it's really hard to make a decision for that in the future, vs. exploring it moment-to-moment as you live, and authoring your own sense of self through each moment and seeing the outcome immediately in your life.","time":1663954604000},{"user":"thinker","text":"yeah i really like that and the way you put it together for me ","time":1663954632000},{"user":"helper","text":":) that is nice. I am so glad. :)","time":1663954640000},{"user":"thinker","text":"i can see hope shining through ","time":1663954665000},{"user":"helper","text":"hope shiinnnniiing thruuuuu!!!","time":1663954670000},{"user":"helper","text":"that's wonderful.","time":1663954676000},{"user":"helper","text":"ok let's put you right into that beam of light, in the middle of it, facing out towards it. what do you see in that hope?","time":1663954696000},{"user":"thinker","text":"i see the now endless positive possibilities which cancels out the negatives hehe ","time":1663954752000},{"user":"helper","text":"ohhhh","time":1663954756000},{"user":"thinker","text":"i understand myself a little bit more and both values are important i don't want to have to choose between them ","time":1663954836000},{"user":"helper","text":"ah yeah!","time":1663954845000},{"user":"helper","text":"ok, this is good. you have a new frame of mind.","time":1663954856000},{"user":"helper","text":"So let's now take that frame of mind back to your troubling event.","time":1663954865000},{"user":"helper","text":"So put yourself back in the situation of having an idea for your career, and then discovering that the training for that career could take 3 more years than expected. What can you think to yourself now?","time":1663954892000},{"user":"helper","text":"Given that you understand yourself a little bit more, and that both values are important and you don't want to have to choose between them.","time":1663954918000},{"user":"thinker","text":"i guess i can firmly say and accept that i am interested in this specialty despite the extra years of training and that hesitancy to confront that came in thinking i would pospone my value of family that's 3 extra years in training not necessarily 3 years delaying my other value per say soo.....","time":1663955045000},{"user":"helper","text":"!!!","time":1663955047000},{"user":"helper","text":"That sounds really key.","time":1663955053000},{"user":"helper","text":"Choosing this specialty does not necessarily mean you can't have any family during the training.","time":1663955070000},{"user":"helper","text":"Maybe you'll ... do a worse job at your classes sometimes, because you are caring about your family, and have a great opportunity to do something meaningful there. And maybe that's great! Because you love your family, and your family really matters, and you will have the opportunity to do TWO things you really care about, and bring the best of them to each other.","time":1663955112000},{"user":"helper","text":"When we do things that we really care about, it can give us clarity, and when we do things that feed us, because they are good for us, it can give us strength. And clarity and strength can be you NOT procrastinating, and not overthinking, and getting more done, and living a more meaningful life of value for yourself, your family, and the people you impact in your career.","time":1663955169000},{"user":"thinker","text":"yes, yes, & yes!!1","time":1663955176000},{"user":"thinker","text":"having that clarity eliminates those infectious thoughts ","time":1663955234000},{"user":"helper","text":"congratulations on that!","time":1663955243000},{"user":"helper","text":"Good job!","time":1663955247000},{"user":"helper","text":"You are seeing yourself and your strength, and when that rises in the middle, the fears of each partial thought disappear.","time":1663955264000},{"user":"thinker","text":"i do feel a little more powerful now than at first ","time":1663955274000},{"user":"helper","text":"More powerful!","time":1663955280000},{"user":"thinker","text":"more in control of what is in my hands verses thinking about the future ","time":1663955298000},{"user":"helper","text":"That's really cool.","time":1663955302000},{"user":"helper","text":"The power is coming from the values that you are holding and now recognize.","time":1663955311000},{"user":"thinker","text":"and protecting!!","time":1663955316000},{"user":"helper","text":"yes!","time":1663955318000},{"user":"helper","text":"You have opportunities to pursue them!","time":1663955322000},{"user":"helper","text":"You were perceiving those opportunities as threats to the other values.","time":1663955336000},{"user":"helper","text":"Now you see them as opportunities again. :)","time":1663955343000},{"user":"thinker","text":"yesss ","time":1663955350000},{"user":"helper","text":"Congratulations!","time":1663955354000},{"user":"thinker","text":"thank you hehe ","time":1663955364000},{"user":"helper","text":"Ok, so now you are done— just remember in the future when the event of seeing that pursuing one of your values is going to take a lot of time, that might disrupt one of your other values, that you can firmly say and accept that you are interested in and care about that value — despite the time it takes — and that it doesn't necessarily mean delaying your pursuits of your other values!","time":1663955435000},{"user":"helper","text":"Thank you for being here with me and talking this through. I feel very good about this and it's a great way to start my day. :)","time":1663955458000},{"user":"helper","text":"One more question: would you like this session to be viewable by the public? Other people could benefit from reading it.","time":1663955474000},{"user":"thinker","text":"yeah that's fine with me. ","time":1663955485000},{"user":"thinker","text":"and thank you a lot, you helped me through this ","time":1663955500000},{"user":"helper","text":":) I am so happy about that. Thanks for doing the work with me!","time":1663955511000},{"user":"helper","text":"The review button is in your lower right.","time":1663955519000},{"user":"helper","text":"Enjoy the rest of your day, and your upcoming weekend!","time":1663955529000},{"user":"thinker","text":"you as well!!!! ","time":1663955546000},{"user":"thinker","text":"<3","time":1663955571000}]}