{"notes":{"feelings_behaviors":"-Stressed\n-Worried about competition\n-Fear\n-Shame","thought":"- I've worked on this project for years, and I don't want to have wasted that time\n-I'm not sure where to focus time\n-I'm not making progress fast enough\n-I won't be recognized for the time I've spent\n-I want to be a leader and get responsibility but make room for other's contributions\n-I want to feel respect\n-I need to have results in order for people to respect me\n-\"There's a lot of things about academia that suddenly are relevant in your life again as you advance this project.\"\n-\"Recognition and community are important to this project's completion and validation, but maybe those two things have taken on a sour meaning after your experience with academia.\"","event":"Trying to organize others working in the field I'm working in","labels":{"black-or-white-thinking":true,"fortune-telling":true},"new_thought":"We need a community where people feel accomplishment, both individually (while interacting with the community) and as a group (getting closer to the truth together).\n\nI can feel accomplishment at an individual and group level, in whatever way my work may proceed\n\nMy form of recognition can be wholly different from academia's."},"messages":[{"user":"thinker","text":"I'm having some troubles with a work project... overall I'm not sure what to do.","time":1600455939000},{"user":"helper","text":"Hey, I'm sorry to hear. What sort of troubles?","time":1600456057000},{"user":"thinker","text":"Well, I feel a bit stressed because I have a lot of paths I could pursue with it, and many of them I've pursued to different degrees, and I'm worried about pushing in the right direction. I'm worried about choosing the right aspect to work on.","time":1600456132000},{"user":"helper","text":"It's always hard when you're faced with decisions that you're unsure of. What about it worries you?","time":1600456229000},{"user":"thinker","text":"Well I'm worried because I've worked on this overall project for many years, now, and I want to make sure that something results from it. I don't want to waste time. And that means I have to complete something, so I can release it and give it to others. If I just partly do things, then the partly-done things aren't useful, and it won't matter that I've partly done the things.","time":1600456294000},{"user":"thinker","text":"I don't know if that makes sense.","time":1600456300000},{"user":"thinker","text":"I also have other worries too. I guess, overall, it's a big project and I'm not sure where to focus my time...","time":1600456333000},{"user":"thinker","text":"And I know I can start with something, somewhere, and I've done a lot of that, but I haven't really gotten any one thing out and released to other people in a big way, and I really want to.","time":1600456365000},{"user":"thinker","text":"I'm sorry this isn't super clear. I'm still trying to understand it myself. Thanks for listening.","time":1600456386000},{"user":"helper","text":"No that's okay! I'm going to try to understand with you. From what I hear, it sound like you've had this project under your belt for years now, with the ultimate goal of completing it, and getting it out to the public. So much work has been done already, and you're not sure where to go next in advancing your goal. Am I on the right track?","time":1600456527000},{"user":"thinker","text":"Yeah, you're understanding what I'm saying well.","time":1600456541000},{"user":"thinker","text":"I'm also noticing that I'm worried about competition. Ok, so the project is to make a new version of the WWW, and I think there's this opportunity for it, like right around the corner, and I have been sitting with this vision for a lot of years, and I want to make it real, but I fear that I'm not making progress fast enough, and that after all these years someone else will be the person to do that and I'll have just spent all this time but not actually get the recognition.","time":1600456619000},{"user":"helper","text":"That's a really overwhelming thought. To have put all this work into a project and to finish in second. It seems like you're really proud of it","time":1600456709000},{"user":"thinker","text":"Yeah. Yeah... I'm proud ... and I think there's a lot of good work and good thoughts that I want to make sure come to fruition. Thanks, I think that's like, near the core of it.","time":1600456734000},{"user":"helper","text":"Right, you want to make sure you finish this work, and that the world can see it. Is there a specific event which made you feel like this was at risk?","time":1600456809000},{"user":"thinker","text":"Yeah... so like I've been talking more to some other people working in this area, and I am trying to organize everyone together. And it's hard to get together with people, because on the one hand I want to be a leader and get responsibility, but on the other hand I need to make room for other's contributions.","time":1600456847000},{"user":"thinker","text":"And I know that I have all this background bulk of work I've done that gives me knowledge, but that work isn't really visible to these other people. So it's like I want to be respected by these people but I don't actually know that I am right now, and I have a fear of just being a dude. Maybe they won't respect me. And I've been working for so long, thinking that I'm relatively alone with this vision, pushing on it as a sole inventor.","time":1600456917000},{"user":"helper","text":"Right, this feeling of being alone in your vision. You've worked for such a long time on this project, and you feel a lot of pride and ownership of it. Reaching out to others is hard because you worry they don't share this vision, and because you want to be at the helm of all this work you've poured yourself into. You know you need their help to go forward, but it's scary to trust strangers and know that they're going uphold that work. You're unsure of where to go in the face of this","time":1600457232000},{"user":"helper","text":"Let me know if I'm inferring too much, but do you think I'm getting close?","time":1600457249000},{"user":"thinker","text":"No, you're right.","time":1600457251000},{"user":"thinker","text":"I kind of worry that they share the vision, but don't know it, or don't know or don't respect the parts that I know.","time":1600457272000},{"user":"thinker","text":"And then I think that I could let them know, by putting work into explaining it, but I also have lots of things to explain! Lots of things that are partially done!","time":1600457292000},{"user":"thinker","text":"But they aren't visible.","time":1600457296000},{"user":"thinker","text":"So I think I am worried about having these partially-done things, because now that I'm organizing people together, I need to be have results to show them in order for them to know that I have done good work and respect me.","time":1600457331000},{"user":"thinker","text":"And I could work more on some of them, but anything I work on and focus on will mean other things won't get focused on. And meanwhile, it's as if I'm doing a new thing -- building this group! And that means I can focus even less on other things. :(","time":1600457371000},{"user":"thinker","text":"But the group is ultimately what's necessary in order for this web to succeed. We need a group of people building with it.","time":1600457387000},{"user":"helper","text":"It sounds like there's a lot on your plate. A lot of responsibility, and a need for visibility and product.","time":1600457471000},{"user":"thinker","text":"Yeah... that's how I feel, a lot of responsibility... yeah, and a need for visibility and product.","time":1600457471000},{"user":"helper","text":"And also a need for others to complete this work, to stay on track, and you're not sure others (although experts like yourself) will totally get the things you've already started, the things you specialize in and are precious to you.","time":1600457542000},{"user":"helper","text":"Making another roadblock to your goal of recognition","time":1600457572000},{"user":"thinker","text":"Yeah, there's a fear that as people come together, these gems of mine... or me, myself... will get lost in the noise.","time":1600457595000},{"user":"thinker","text":":(","time":1600457598000},{"user":"thinker","text":"I fear overwhelm of a wave washing over me and I can't swim and I'm stuck in froth after hanging out here alone in the ocean waiting years for it knowing it will come.","time":1600457632000},{"user":"thinker","text":"But once it's here I'm not actually ready, I'm not actually the person.","time":1600457645000},{"user":"helper","text":"Okay, I think this metaphor helps me understand a little bit better. This project and it's potential are vast, kinda like the ocean. It's bigger than you, but you are vital to it. Others are working on something similar, also planting seeds for it, playing roles like your own. They don't recognize your role yet, and you're worried they won't when the time comes.","time":1600457838000},{"user":"thinker","text":"Yeah me too. Yeah, it's like the ocean. A deep sea. It's way bigger than me, but I can play a key seeding role in it as it comes together.","time":1600457840000},{"user":"thinker","text":"Yeah that brings up a new thought in me... like, I think they don't recognize my role and value yet, but that's really just triggering a fear that I won't be recognized in the future. And the future fear is the real thing I'm worried about.","time":1600457890000},{"user":"helper","text":"Okay, let's focus on that. This fear of recognition or lack of it","time":1600457923000},{"user":"thinker","text":"Yeah.","time":1600457924000},{"user":"thinker","text":"I think the recognition would come from producing something good and visible and people seeing it and using it... probably? I guess I don't even know what recognition comes from.","time":1600457948000},{"user":"thinker","text":"Ok, so this is good to focus on because obviously I don't fully understand it yet.","time":1600457961000},{"user":"helper","text":"I agree. What about this fear is particularly troubling?","time":1600457991000},{"user":"thinker","text":"I think it's the fear of wasting my time and my life, and losing an opportunity for greatness that I've seen for a long time and invested a lot of my life into.","time":1600458014000},{"user":"thinker","text":"And I'm not sure what to do about that right now!","time":1600458029000},{"user":"thinker","text":"I could work on aspect A, or B, or C, that I've already been working on, and neither are fully complete, but I don't even know if those are the key things to do, and now I've got a new aspect: G, the Group, and then putting this Group together is triggering the fears even more to some degree.","time":1600458070000},{"user":"thinker","text":"Because when these people see each other, and work together, they will see more of the vision, I think more of the vision that I see, and then they could just do it all without me and they might not realize the instrumental work I did to create the community where they saw the vision...","time":1600458117000},{"user":"thinker","text":"The vision that I've been trying to get people to see for years.","time":1600458124000},{"user":"thinker","text":"Does that make sense? I think it's complicated and I apologize.","time":1600458140000},{"user":"helper","text":"Yeah it does! No need to apologize, I'm just reading over what you said","time":1600458159000},{"user":"helper","text":"From what I gather, there's this omnipresent fear of not being recognized. Not bearing the fruits of your labor, this project you've poured a lot of life and yourself into. You've reached a point in it where to reach its completion, this end-goal which will let your vision be shared with the world, you need other people to work on it. However, these people could just see the value in your work and make it their own, and overshadow the foundational work that you've already done.","time":1600458455000},{"user":"thinker","text":"Yeah.","time":1600458464000},{"user":"helper","text":"And that could mean you won't be recognized","time":1600458495000},{"user":"thinker","text":"Yeah.","time":1600458525000},{"user":"thinker","text":"I'm realizing now that this is a big change in my life, actually. I left academia (which was all about recognition) and decided to not care about that stuff for a while. I just wanted to build things that were really valuable, without caring about how people saw them. But now I have the need to be recognized and respected. So I have to change a lot of things about me and how I've presented myself and my work in the past.","time":1600458574000},{"user":"thinker","text":"There is a lot of story I haven't been telling about myself. A lot of details that would lead me to be more impressive to people.","time":1600458617000},{"user":"thinker","text":"Like I don't mention to people my PhD.","time":1600458623000},{"user":"thinker","text":"Most of the time.","time":1600458629000},{"user":"helper","text":"Ok, I'm starting to see a parallel between yourself and this project. This project, and it's completion, and your own need of recognition, both need people. People not only to work, but to do the recognizing itself. You want to share the details of your life because you KNOW they are impressive, just like you know this project is. But people can miss the point, or not have the same values as you, or steal your thunder, etc","time":1600458871000},{"user":"thinker","text":"Oh yeah.","time":1600458877000},{"user":"thinker","text":"That leads me to realize something deeper in my story. I left Academia because I didn't like the community. I wanted to build a new community. While rejecting the old community, I stopped trying to look impressive. Now I want to build a new community... and this is not just for the WWW project, but it's like building an academic community that I've wanted to build.","time":1600458967000},{"user":"thinker","text":"So it's like, maybe now is the time for me to go through a deep reorientation. Instead of going away from something, going to something new.","time":1600458988000},{"user":"thinker","text":"And in facing this new community, I can find a lot of aspects of myself that could be impressive, and bring those to the surface with them.","time":1600459015000},{"user":"helper","text":"Right, this is the opportunity to show yourself off a little. To actualize yourself in a public sense, to let others see you the way you want to be seen, not within the confines of academia","time":1600459158000},{"user":"thinker","text":"To present myself the way I want to see myself and be seen. To a new group that I want a relationship with, rather than this estranged relationship I have with the traditional academy.","time":1600459160000},{"user":"thinker","text":"Thank you.","time":1600459169000},{"user":"helper","text":"So let me try and connect this with our previous talk on fear of recognition. It seems like recognition is a big thing in academia, this thing you've purposefully distanced yourself from. You haven't been worried about it, but it's now a lingering thought. There's a lot of things about academia that suddenly are relevant in your life again as you advance this project. Recognition and community are important to this project's completion and validation, but maybe those two things have taken on a sour meaning after your experience with academia. Does that resonate with you?","time":1600459360000},{"user":"thinker","text":"Yes thank you, that is very well put!","time":1600459365000},{"user":"thinker","text":"> \"There's a lot of things about academia that suddenly are relevant in your life again as you advance this project.\"","time":1600459375000},{"user":"thinker","text":"> \"Recognition and community are important to this project's completion and validation, but maybe those two things have taken on a sour meaning after your experience with academia. \"","time":1600459391000},{"user":"thinker","text":"Yeah, like during this talk I've felt *dirty* even saying that I care about recognition. But I know I feel it, so I'm honest and say it, but I feel shameful.","time":1600459424000},{"user":"thinker","text":"But maybe I can see the value in that. And the value in building an academic community of people ... with egos...","time":1600459451000},{"user":"helper","text":"It's hard to desire things for oneself. We can claim recognition doesn't matter, but in times when we feel it, it's a wholly validating act. One of the things that can give us purpose. I don't think it's anything to be ashamed of. ","time":1600459553000},{"user":"thinker","text":"Dang. You're right. It's on maslow's hierarchy. \"Esteem needs\" are near the top.","time":1600459569000},{"user":"helper","text":"Right! But it's also in the lifeblood of academia, this thing you've worked really hard to distance yourself from and escape from its thought patterns and values","time":1600459624000},{"user":"thinker","text":"Dang, you're so right. It's crazy prevalent in academia, and I think I've seen some perverse manifestations of it and subconsciously gotten turned off to the whole thing, rather than being able to see good in it. Maybe there is a B&W thought in here.","time":1600459663000},{"user":"helper","text":"I was actually just going to say! ","time":1600459670000},{"user":"helper","text":"B+W seems super relevant. Recognition and academia do not have to be synonymous. The feelings you derive and the meaning recognition give you and your work do not have to be the same as academia's.","time":1600459729000},{"user":"helper","text":"Does this sort of put it into perspective?","time":1600459751000},{"user":"thinker","text":"Yeah, it feels like I need a new thought in here somewhere to bring me closer to seeing the value of recognition and esteem, both personally and in an academic community, so that I can foster that in myself and this group, and create recognition for all the deep work that I've done.","time":1600459805000},{"user":"helper","text":"Right, well let's think of something together that might be helpful. You mentioned earlier you feel shame when having this desire for recognition, and I think we've established that comes from its prevalence in academia. What do you think is a way you can distance yourself from this unhealthy ego to let this drive for recognition be support for a healthy one?","time":1600459928000},{"user":"thinker","text":"Yeah. I've seen ego-recognition-demands get in the way of finding truth.","time":1600459931000},{"user":"thinker","text":"We need a community where people feel accomplishment, both individually (while interacting with the community) and as a group (getting closer to the truth together).","time":1600459975000},{"user":"thinker","text":"I think that's a healthy view on it.","time":1600459994000},{"user":"helper","text":"I agree, and I think it's a really nice way of putting the ways in which you want to distance yourself from this ego-fueled academic body","time":1600460031000},{"user":"helper","text":"Thank you!","time":1600460086000},{"user":"helper","text":"Still getting used to keeping up with everything","time":1600460099000},{"user":"helper","text":"But how do you feel knowing this is your goal for community?","time":1600460115000},{"user":"thinker","text":"I feel like I have a new opportunity here to bring up a lot of good work I've done and make good out of it, in a group of people, where it can be received. That's something that can have a lot of surprising power and benefit and goodness in it. I've been afraid of it all being lost, and afraid of the (fortune telling) situation where people don't see and recognize the goodness, but the reality of this situation is that there is so much goodness around that it could be relatively easy for me to gather up the pieces together and present it to people.","time":1600460204000},{"user":"thinker","text":"I think having this group can create a venue for presenting the work.","time":1600460219000},{"user":"thinker","text":"And make it easier to present it, and easier to get it out and be recognized.","time":1600460229000},{"user":"thinker","text":"So I think probably the triggering event of bringing people together was leading me to think this fortune-telling thought (of a negative future) because my prior perspective has been anti-academia, anti-recognition, ant-ego. But I need to transform that perspective, by having new thoughts like this one, about the goodness of recognition, esteem, and prestige, within this group (individually and as a group), so that I can focus on the opportunities for things that I can *do* instead of the fear that I won't do them.","time":1600460314000},{"user":"helper","text":"I couldn't agree more. I think that's a really wonderful perspective. It's clear you're already beginning to transform your relationship with recognition, ego, and community as a whole! Stripping them of previous negativity and knowing you can feel accomplishment at an individual and group level, in whatever way your work may proceed","time":1600460446000},{"user":"thinker","text":"Oh, yeah, that's a good way to see it. I like that, thank you.","time":1600460467000},{"user":"thinker","text":"> \"Knowing I can feel accomplishment at an individual and group level, in whatever way your work may proceed\"","time":1600460484000},{"user":"helper","text":"I'm glad I can be of some help. How do you feel compared to when we started? Any lingering thoughts?","time":1600460506000},{"user":"thinker","text":"Man, I just feel like this huge issue is clearing up and I see a huge opportunity in front, and I feel accomplished even right now having this transition from my old anti-academic mindset (where I was growing my hair out and becoming a monk outside of society) to one where I can have a place in the human race.","time":1600460563000},{"user":"thinker","text":"Like, this is a big phase transition in my life story that I've been waiting for for a long time ... and it's exciting to think I might be doing that now. Maybe this long wait can be over.","time":1600460594000},{"user":"helper","text":"Belonging to your own values and perspectives is just as important as belonging to a community, or species on the whole. Rationalizing your desires for recognition are a great step at making this change in your life","time":1600460669000},{"user":"thinker","text":"Oh wow.","time":1600460680000},{"user":"thinker","text":"Hm.","time":1600460695000},{"user":"thinker","text":"Ok, so I guess a subsequent step will be to integrate the desire for recognition beyond rationality.","time":1600460719000},{"user":"thinker","text":"So that I can belong to them.","time":1600460725000},{"user":"thinker","text":"That's an incisive way to look at this. Thank you.","time":1600460743000},{"user":"helper","text":"And with that integration know along the way you can always return to what we've talked about, and that your form of recognition can be wholly different from academia's","time":1600460800000},{"user":"thinker","text":"Wow. Interesting thoughts.","time":1600460811000},{"user":"thinker","text":"I've added that to the new thought box too.","time":1600460824000},{"user":"helper","text":"I'm glad it speaks to you","time":1600460831000},{"user":"thinker","text":"Wow. This is very interesting.","time":1600460852000},{"user":"helper","text":"Is there anything else you want to talk about? I feel like you have a great means of moving forward from these fears","time":1600460893000},{"user":"thinker","text":"I think this is good. I think my brainheart is full, and we can be excused from the lunch table now.","time":1600460894000},{"user":"helper","text":"Haha alright I just wanted to be sure. I hope you've found some clarity from this, thanks for doing it with me and reminding me of the method","time":1600460939000},{"user":"helper","text":"I definitely already see some areas where I can improve","time":1600460950000},{"user":"thinker","text":"Thank you very much! This is a big thing for me in my life!","time":1600460962000}]}