{"notes":{"event":"- Experiencing an inner tension\nChronically held stuck energy\n- resistance to the inner tension/energy","feelings":"fear\npanic\nterror","thought":"-  I don't know how to interpret my fear correctly\n- what if i'm being alerted to a real medical issue and i'm under-reacting?\n- am I handling my feelings \"right\"?\n- i don't trust my ability to trust the message(s) from my body","behaviors":"- control/temper/contain/ignore feelings\n- shut down to the tension","labels":{"control-fallacy":true,"black-or-white-thinking":true,"should-statement":true},"new_thought":"I can learn to listen deeply to my body's messages, and trust my own inner knowing. I can seek help if needed from trusted friends, relatives, experts. It's OK to ask for help."},"messages":[{"user":"helper","text":"hello! welcome to your cheese session!","time":1682100029000},{"user":"thinker","text":"hi! thanks so much. glad to be here!","time":1682100037000},{"user":"helper","text":"ready to dive in?","time":1682100047000},{"user":"thinker","text":"haha yea. although i'm just coming rushing in a bit from a previous thing, so may need a moment or two to feel into what's up for now","time":1682100079000},{"user":"helper","text":"sure thing, let's take a min to arrive here. I'll set a timer for a min. take some breaths, arrive into your body","time":1682100117000},{"user":"thinker","text":"oh ok, nice. appreciate that.","time":1682100127000},{"user":"thinker","text":"oh and just real quick - speaking of time, do you need to end by any particular point?","time":1682100143000},{"user":"helper","text":"i do! i have until 12:15 pdt (an hour and 15 mins)","time":1682100171000},{"user":"thinker","text":"right, ok cool","time":1682100175000},{"user":"helper","text":"timer is set","time":1682100194000},{"user":"thinker","text":"thumbsup","time":1682100199000},{"user":"helper","text":"okay...","time":1682100279000},{"user":"thinker","text":"yaya","time":1682100283000},{"user":"thinker","text":"yea thanks. so i think mainly what's most prominent at the moment, and lately, is there's just this inner felt tension that's been pretty consistent. feels kinda like some chronically held or stuck energy","time":1682100330000},{"user":"helper","text":"hmm okay","time":1682100341000},{"user":"thinker","text":"yea","time":1682100345000},{"user":"helper","text":"can you tell me more about the tension/stuckness?","time":1682100361000},{"user":"thinker","text":"yea it's generally around my belly/midsection/solar plexus areas. feels kinda like a frozen or like i said held sensation. feels fearful/fear-based. and just like pretty persistent lately","time":1682100423000},{"user":"helper","text":"have you noticed any triggers that make it worse/more apparent (or better)?","time":1682100451000},{"user":"thinker","text":"mm yea good questions. i mean seems like stress/stressing out obvi intensify it. it's been fairly prevalent in my meditations lately too, so it's not like the meditation is necessarily making it any better or less. sometimes, some moments it does. but partly ive just been exploring sitting with it, being curious about it, kind of observing it in a gentle way","time":1682100548000},{"user":"helper","text":"That sounds deeply self-compassionate. I've had some feelings of my own recently that I've been trying to sit with and be curious about. It's not the easiest process, and I commend your bravery with that","time":1682100635000},{"user":"thinker","text":"aw thanks! and for sharing about your own similar experience lately. yea, it's a practice eh. not always the easiest, but i feel like one thing the overall practice is teaching me lately is that 'just keep going-ness' of it all. like i can see where i've felt this same - or similar, or much worse - sort of feeling through different parts of my life, and it used to just bowl me over, game over style. and now it's like Ok, let's see, i can see what's up here, i can do my best to be with this","time":1682100755000},{"user":"helper","text":"nice!  I'm happy to hear your practice is helping you manage your experiences/feelings. I think in this session, it'll probably make sense to dig into some of the stressors you mentioned. Does that sound like an avenue you're interested in exploring with me?","time":1682100836000},{"user":"thinker","text":"hm yea, i def see where you're coming from - and totally appreciate the look to bring a clear focus, esp in the relatively short time we have here today. but tbh i'm not sure there's a particular stressor that's exactly bringing it on, and i feel like it may be fruitful still to go with this sensation as the main trouble.. but let me see if i can clarify a bit more for you - i think the most troubling thing about it for now is that it feels all-encompassing. like no matter what i do it's just present and persistent, and it feels like something's just 'off.'","time":1682100952000},{"user":"helper","text":"hmm. That's really helpful! I'm starting to see how this feeling that \"something's off\" could be really troubling!","time":1682100999000},{"user":"thinker","text":"oh ya! you just made me remember another aspect of it too, that i think will help us here, thanks. so there is a fear around it - like as much as i see the value in bringing this kind of meditative focus/awareness to it - what if it is actually calling out some real, maybe even like life-threatening (as yet undiagnosed disease, or sth of the sort) issue? and her i'm just kicking back trying to meditate on it all. so yea, it gets to this dual thing of like do i really know what's going on, and am i maybe just using all the meditativeness to actually avoid some real deep scary shit? am i just being totally oblivious?","time":1682101121000},{"user":"thinker","text":"oh and yea thanks, i just read your full comment above. appreciate the understanding","time":1682101144000},{"user":"helper","text":"it sounds like you're not sure how to \"hear\" your fear correctly? Like is it an alarm you should be responding to? Or is it a disturbance that needs calming or reassurance?","time":1682101219000},{"user":"thinker","text":"oh damn. YA! thanks for that - you totally just nailed it. awesome. yea, and i was just listening to this thing earlier this morn about how we go about our lives, but we don't actually really listen deeply. so yea, that's it exactly. that, and the not trusting, or not knowing how to trust my own take on it, or just myself in general.","time":1682101284000},{"user":"helper","text":"how long have you been experiencing this tension? Are the tension and the fear the same feeling?","time":1682101340000},{"user":"thinker","text":"mm yea, more good questions. my first response was 'all my life.' in some form or another, i think. most recently it's been a while. as for them being the same thing... i haven't quite sussed that all out as yet. i'm not sure. but so appreciate you asking the question.","time":1682101419000},{"user":"thinker","text":"but it also seems the more i focus on it, and in a sort of slightly paranoid way, as i think i'm beginning to right now - it intensifies. whereas if/when i'm focusing on my breath and noticing the sensation in the backdrop, it doesn't feel as much like it will eat me alive","time":1682101480000},{"user":"helper","text":"It can be so tough to know how to handle this sort of thing \"correctly\".  There's a narrative we hear about anxiety and paranoia and how that should be viewed and managed. And these's another narrative around intuition and being in the flow of the universe, and allowing intuition to bring ease and harmony to your life. Have you heard those kinds of things before?","time":1682101582000},{"user":"thinker","text":"yea! for sure, totally. i think that's part of it too - am i doing it 'right?' am i walking the correct path? is this sensation an overt indicator that i'm not? and if so, why am i not acknowledging it and responding accordingly?","time":1682101642000},{"user":"helper","text":"hmmm interesting! give me a moment to take that in","time":1682101673000},{"user":"thinker","text":"yea yea sure","time":1682101679000},{"user":"thinker","text":"really appreciating all of your good insights already here too, btw. helping me to draw this out further and explore it deeper","time":1682101701000},{"user":"helper","text":"<33","time":1682101706000},{"user":"helper","text":"hahahha","time":1682101737000},{"user":"thinker","text":"i don't think AI can do this. but i guess we'll see where it goea hah","time":1682101738000},{"user":"thinker","text":"goes","time":1682101741000},{"user":"helper","text":"well maybe it'll help me round out the picture if we connect some behavior to these thoughts and feelings. From what you've said so far, it. sounds like you're trying to manage this tension by meditating. Any other behaviors that seem connected to this state of fear?","time":1682101843000},{"user":"helper","text":"ahh cool, so this event/tension isn't the catalyst for you starting a meditation practice. gotcha :)","time":1682101912000},{"user":"thinker","text":"sure, yea. and well just to clarify a bit, i have a consistent daily meditation practice, going for some time now, so come rain or shine i'm sitting at least once a day. right, yea. but let's see - i mean to an extent it is still one of the behaviors i'd call out on it anyway, bc even if i don't happen to be sitting at the moment, i can bring that meditative sort of awareness to it. that's one thing. but i think maybe more common a behavior is i'll just keep it contained. bottled up. hidden. tamped down. try to control it, and kinda block it out i think. just get on with things, work, on with my day. just ignore it basically. so yea, not tryna listen to it","time":1682102013000},{"user":"helper","text":"hmm okay. Let me see if I can summarize what I'm hearing.","time":1682102068000},{"user":"thinker","text":"for sure","time":1682102071000},{"user":"helper","text":"You're experiencing a chronic \"stuckness\" or tension and it worries you. You wonder whether this feeling is indicative of an underlying health issue and you fear that you're under-reacting to your body's signal. You also dont want to over-react to this signal, and maybe you're not sure what the \"appropriate\" reaction is. So to cope, you try to temper and contain the tension, and feelings of fear about your reaction to that tension, leaving you in a perpetual state of vigilance/attempted containment. ","time":1682102356000},{"user":"thinker","text":"yea nice. that 'perpetual state of vigilance/attempted containment' is good. that feels right","time":1682102382000},{"user":"helper","text":"how about the \"not wanting to over-react\" part?","time":1682102396000},{"user":"thinker","text":"yes for sure","time":1682102402000},{"user":"helper","text":"I don't think I've heard much from you about that. Is that part of the fear too?","time":1682102415000},{"user":"thinker","text":"yea i mean, and i have gone to docs about this in the past, tried to get it looked at, checked out, have tests run etc. but nothing's ever come up. i don't have much faith in the western med system anyway, but i figure i don't wanna eff around just in case. but so yea, not wanting to over-react, and also maybe that's actually called for but i'm keeping shit too tame and dormant, and will pay a big price for it","time":1682102507000},{"user":"helper","text":"I see, so you've taken some steps to listen and react to the tension by going to the (western med) doctor and running tests etc. And they haven't come up with anything amiss? And to keep looking, you'd have to really \"stir the pot\"/advocate \"hard\"?","time":1682102616000},{"user":"thinker","text":"yea well that's true too","time":1682102625000},{"user":"helper","text":"ahh, sorry I was trying to understand what you meant by \"too tame and dormant\"?","time":1682102660000},{"user":"thinker","text":"oh right, i just meant like maybe i do need to react more, over-react even. maybe that's called for, and ii'm not, haven't been doing that. so that's a fear too","time":1682102700000},{"user":"helper","text":"Is there a feeling that comes up when you consider the idea or \"reacting more, or over-reacting even\"?","time":1682102743000},{"user":"thinker","text":"still fear, but maybe a more intensified or varied version","time":1682102768000},{"user":"helper","text":"what's the fear?","time":1682102783000},{"user":"thinker","text":"that if it is something that requires more attention, and i'm just ignoring it/not reacting properly - then not only will i be adversely affected, in whatever way that manifests - but also that i was too stupid, blind, oblivious to know what it was, or ever catch it before it was too late","time":1682102852000},{"user":"helper","text":"I see, that definitely sounds scary!","time":1682102871000},{"user":"thinker","text":"mm","time":1682102874000},{"user":"helper","text":"I think the part I'm not understanding yet is if there are thoughts or feelings pushing you to NOT get more medical attention or causing you to ignore it","time":1682102921000},{"user":"thinker","text":"oh mm, i mean only thing that comes up is just that it's either not really a big deal, or i've been treating it as such for so long that i've just grown used to it","time":1682102978000},{"user":"thinker","text":"like i guess even if i've been scared it MIGHT be something more, i haven't really taken it on as if that's a serious possibility. or i've just been keeping it so far pushed down that i'm used to going on like that","time":1682103060000},{"user":"thinker","text":"if that all makes sense","time":1682103064000},{"user":"thinker","text":"bc i mean it's also not like some debilitating pain or sth like that. it's much more subtle, if persistent","time":1682103093000},{"user":"helper","text":"I think I'm getting it, thank you for your patience and for explaining it again :)","time":1682103095000},{"user":"thinker","text":"ofc","time":1682103098000},{"user":"helper","text":"It sounds like you're not sure how serious this \"message\" from your body is. You aren't denying the existence of the message, but you don't trust your ability to interpret it?","time":1682103179000},{"user":"thinker","text":"yea i think that's pretty spot-on.","time":1682103190000},{"user":"thinker","text":"i think i might also add 'panic' and 'terror' to the feelings. still in the same family of course, but more intense varieties","time":1682103284000},{"user":"helper","text":"oh certainly! Those words carry more bite!","time":1682103312000},{"user":"thinker","text":"haha yea","time":1682103317000},{"user":"thinker","text":"teeth","time":1682103324000},{"user":"helper","text":"Anything missing from the summary? any other additions for the notes?","time":1682103346000},{"user":"thinker","text":"um i don't think so but lemme check real quick, and thanks for asking","time":1682103357000},{"user":"thinker","text":"i think all looks good. i'm just thinking a bit more on the actual event - and i wonder if it's more the tendency to react to the tension, and like shut down to it in a way. like my resistance of it, yea","time":1682103461000},{"user":"helper","text":"Sometimes I find that the event, thought, feelings, behaviors are cyclical. And the event and behaviors are really similar","time":1682103504000},{"user":"helper","text":"I'm kinda feeling like that's the case here","time":1682103519000},{"user":"thinker","text":"sure, yea. right, and i do think calling out my inner resistance to the inner tension/energy as the event is helpful to me to here","time":1682103567000},{"user":"thinker","text":"it feels more accurate","time":1682103571000},{"user":"helper","text":"great! added :) thanks for sharing that. I'm glad this feels accurate","time":1682103629000},{"user":"thinker","text":"yea thanks","time":1682103634000},{"user":"helper","text":"I know you're pretty familiar with the cheese labels. Would you like to take a stab at labeling thoughts?","time":1682103674000},{"user":"thinker","text":"some others can apply, but that feels right to me. love to hear if any other(s) in particular stand out for you ","time":1682103728000},{"user":"helper","text":"labeling! interesting. How does labeling apply to this thought? \"I don't know how to interpret my body's messages to me\"?","time":1682103764000},{"user":"thinker","text":"mm yea, i guess i was actually thinking that more in terms of the feeling itself. the tendency to label it as something 'wrong,' 'bad' and so then to react by trying to hide or contain or shut it off/down","time":1682103810000},{"user":"thinker","text":"but yea you're right, that's not really applied to the thought itself","time":1682103829000},{"user":"thinker","text":"idk, maybe i'm too close to it. u have a go","time":1682103841000},{"user":"helper","text":"I was thinking maybe Black or White thinking?","time":1682103856000},{"user":"thinker","text":"yea, almost chose that one too","time":1682103861000},{"user":"helper","text":"Something about the word \"correctly\" ....","time":1682103880000},{"user":"thinker","text":"right","time":1682103886000},{"user":"helper","text":"like there's a right and wrong interpretation","time":1682103888000},{"user":"thinker","text":"yea, i almost put a 'should' in there too","time":1682103897000},{"user":"thinker","text":"i should know how to handle this, should know the right way, even should know just wtf it is","time":1682103919000},{"user":"helper","text":"sure! I can definitely see that one","time":1682103935000},{"user":"thinker","text":"yar","time":1682103943000},{"user":"helper","text":"(time check.. 10 mins to go)","time":1682103959000},{"user":"thinker","text":"yea for sure, i'm feeling some new thought percolations","time":1682103974000},{"user":"helper","text":"ooh! please share","time":1682103981000},{"user":"thinker","text":"I can learn to listen deeply to my body's messages, and trust my own inner knowing. I can seek help if needed from trusted friends, relatives, experts. It's OK to ask for help.","time":1682104102000},{"user":"helper","text":"I love that :)","time":1682104122000},{"user":"helper","text":"I have an idea for something to add -- let me know how it lands","time":1682104135000},{"user":"thinker","text":"kk sure, hit me","time":1682104141000},{"user":"helper","text":"something about my level of attunement to my body is enough. I'm doing enough to care for myself","time":1682104198000},{"user":"thinker","text":"mm yea, nice. that's funny too, i just wrote a short piece this morn that featured some attunement as a theme","time":1682104239000},{"user":"helper","text":"hahha attunement is showing up all over the place (and this spell checker doesn't like it hahah)","time":1682104269000},{"user":"thinker","text":"lol right","time":1682104273000},{"user":"thinker","text":"hm yea, i do appreciate that offering and i love the wording, and the idea of it. however, i feel a slight bit of inner pushback to it, not totally sure why just yet. so i'll keep it as is for now, and maybe come back to edit more later. but do so appreciate you offering that!","time":1682104352000},{"user":"helper","text":"that's great! Thanks for considering it so openly and sharing your reaction. I think the new thought that you came up with is very nice and CHEESE FREE","time":1682104392000},{"user":"thinker","text":"haha lol thanks","time":1682104397000},{"user":"helper","text":"What feelings come up for you with this new thought?","time":1682104426000},{"user":"thinker","text":"some relief, calm","time":1682104437000},{"user":"thinker","text":"like it's not going to eat me alive","time":1682104451000},{"user":"helper","text":"And how are you feeling now compared to when we started?","time":1682104464000},{"user":"thinker","text":"yea, pretty good. i still feel that inner sensation. but rn it feels more like it's kinda heated up, possibly even slightly morphing in a different way. ","time":1682104501000},{"user":"thinker","text":"and so appreciate the opportunity to explore this very subtle thing in so much depth. all of your questions and insights have been really great! thanks again","time":1682104533000},{"user":"helper","text":"Really cool to hear that the sensation may be shifting. I really enjoyed talking to you and understanding something subtle like this. Thanks for the opportunity to learn","time":1682104590000},{"user":"thinker","text":":D","time":1682104595000},{"user":"helper","text":"Remember to deploy your new though when that panic and terror arises or you think you can't trust your ability to interpret your body's messages","time":1682104637000},{"user":"thinker","text":"yes, thanks!","time":1682104645000},{"user":"helper","text":"would you like this session to be viewable by the public?","time":1682104654000},{"user":"thinker","text":"s'ok w me","time":1682104662000},{"user":"helper","text":"great! tysm, you are done :) have a great rest of your day","time":1682104686000},{"user":"thinker","text":"you too, sayonara!","time":1682104691000}]}