{"notes":{"event":"difficulty doing simple tasks, like packing\n\nWanted to visit my family and girlfriend on Friday, but didn't go","thought":"- I can't do it, I don't have the energy\n\n- I am worthless\n\n- I don't have the ability to do what my rational side wants me to do\n\n- I got too high expectations of myself. My rational side knows this - but I just can't stop it.\n\n- I should pack, I need to go \n\n- I blame myself for the situation.","labels":{"should-statement":true,"blaming":true,"control-fallacy":true},"feelings":"- Depressed\n- Helpless\n- overwhelmed\n- exposed\n-  numb \n- embarrassed\n-  guilty\n- frustrated","behaviors":"Procrastination (watch tv, podcast, clean)","new_thought":"I want to be indulgent with myself. Allow myself to make babysteps without judging too much."},"messages":[{"user":"thinker","text":"Hi there,I'm in a vicious circle ","time":1653041529000},{"user":"thinker","text":"sorry, misunderstood this window, did not get, that it's a chat. Looking forward to it...","time":1653041579000},{"user":"helper","text":"Hi, welcome. My name is Pessia and I'll be your helper today. I see you walked through a lot of the steps already, that's wonderful. How are you feeling now?","time":1653422478000},{"user":"thinker","text":"Hi Pessia,","time":1653422623000},{"user":"thinker","text":"my bus was a bit late, sorry for that.","time":1653422637000},{"user":"helper","text":"No worries at all, I'm glad you're here. ","time":1653422647000},{"user":"thinker","text":"Thx","time":1653422658000},{"user":"thinker","text":"All in all im still not in a good place, but right now it's OK. I was at a local Go-Club - Go is a board-game - and meeting people helps bringing up the mood","time":1653422729000},{"user":"helper","text":"oh definitely. I know of Go, but I've never learned to play it myself. Is that the one that's even more complicated than chess?","time":1653422757000},{"user":"thinker","text":"Complicated is hard to quantify - it's harder to grasp for computers - that's what often mentioned... It's more strategic and less tactical","time":1653422823000},{"user":"helper","text":"aha, yes. That's what I remembered. ","time":1653422839000},{"user":"helper","text":"I'm glad you were able to challenge yourself a little then, and in a social setting. I find those two things combined often do help to boost my mood. ","time":1653422865000},{"user":"helper","text":"I know you wrote much of these notes when you scheduled, a few days ago. Does it feel true to you now as well? We could dive right in. Or if you like, we can take a few moments to recenter and think about what you'd like to talk about today. The time is for you. ","time":1653422919000},{"user":"thinker","text":"All in all I think it's still valid. If it's ok, I would follow your lead, it's my first time on this page and I'm not that familiar with the program","time":1653422979000},{"user":"helper","text":"Of course. So, these sessions typically take 60-90 minutes. We'll walk through your thoughts and feelings a little, and take some time to examine any \"cheese\" - or fallacies- that might exist in this lived experience. Then we can work on a new thought together, though I see you already crafted something that is quite lovely! ","time":1653423051000},{"user":"helper","text":"So first, maybe you could share with me an example of a time lately where you experienced some of this helplessness and numbness. What was happening, and what where your thoughts in that moment?","time":1653423095000},{"user":"helper","text":"looks good to me ;) you're doing great","time":1653423192000},{"user":"thinker","text":"It's often not an acute (not sure if it's spelled like that - I'm not a native speaker) situation. No, it's more a stretch of time - often marked by a goal. ","time":1653423246000},{"user":"thinker","text":"For example a task at work, or packing my bags to visit my girlfriend or family. ","time":1653423291000},{"user":"helper","text":"By the way, I'm just taking some notes on the right. You may see me edit some of the notes you had written earlier, but I'll be sure to keep it all, just in a different organizational sense that will help to bring us some clarity","time":1653423334000},{"user":"helper","text":"go ahead, I'm listening","time":1653423341000},{"user":"thinker","text":"often I got hours or days to accomplish the mentioned goal, but I start procrastinating - watching TV, listning to a podcast, cleaning the kitchen","time":1653423377000},{"user":"thinker","text":"And I get frustrated more and more and don't got the ability to to, what the rational part of my want's to do.","time":1653423473000},{"user":"thinker","text":"In psychological talk, it feels like a conflict between and super-ego and id","time":1653423525000},{"user":"helper","text":"I understand. I also often feel this conflict. The contrast between want and thought, true inner desire, and a constant avalanche of conflicting inner dialogue ","time":1653423561000},{"user":"helper","text":"So when you have an upcoming task or goal, you can know in your subconscious what you truly desire, (thanks :)) but the oppressing thoughts distract from that goal and you find yourself procrastinating, watching tv, even cleaning! Which I imagine in other cases is the thing you would be trying to achieve. Life is funny that way  ","time":1653423687000},{"user":"helper","text":"So you mention it is not an acute moment, but rather an re-occurring event that seems to happen again and again, the same pattern. Perhaps let's look at this example you gave of packing to go to your girlfriends and we'll examine some of the thoughts that happen in that very moment. ","time":1653423783000},{"user":"thinker","text":"I would chose the packing-example, because I completely don't understand it. I like visiting my girlfriend and my family and it's killing me, that I so often can't get me to go","time":1653423848000},{"user":"helper","text":"great, I hear that. I like that you appreciate a challenge! it's something you actually *want*, right? So.. why the difficult. I think this is a great thing to look a little deeper into, and maybe the answers that we find here will apply elsewhere as well","time":1653423898000},{"user":"thinker","text":"Mhh, OK, I wanted to visit my family on friday, but I just, I don't know... Felt like I don't got the energy. ","time":1653424016000},{"user":"helper","text":"hm..","time":1653424042000},{"user":"thinker","text":"I don't get myself in this situations. I know, that the investment of packing my bag and driving one hour would pay of instantly - being arround my family and girlfriend gives me instant energy. ","time":1653424121000},{"user":"thinker","text":"yes","time":1653424139000},{"user":"helper","text":"aha, yes. So, when you do go, you are instantly glad you did. But doing the motions to get there.. it feels like an impossible task","time":1653424149000},{"user":"helper","text":"this past friday, did you you end up not going?","time":1653424155000},{"user":"thinker","text":"yes","time":1653424158000},{"user":"helper","text":"I'm sorry to hear that, I imagine how hard that can be looking back on it","time":1653424179000},{"user":"thinker","text":"Thx, yes","time":1653424185000},{"user":"helper","text":"and so I see some thoughts on the right here, \"I got too high expectations\"  \"I can't stop it\" \"I am worthless\" ","time":1653424225000},{"user":"thinker","text":"The expectations are mostly work, but in this context: I'm not good at showing, when I'm down. I often feel like I put on a mask, when visiting people. It's something I'm much more concious about, compared to former times, but still - I got an expectation about me in social context...","time":1653424369000},{"user":"helper","text":"hm, and what is this expectation?","time":1653424385000},{"user":"thinker","text":"Not putting load on ther people, it the essence of it, I guess...","time":1653424437000},{"user":"helper","text":"you don't want to impose on other people, your family and girlfriend as well?","time":1653424456000},{"user":"thinker","text":"not negatively, yes","time":1653424463000},{"user":"helper","text":"of course... yes that can be a scary thing","time":1653424473000},{"user":"helper","text":"so when you are thinking about packing, and leaving, you are also thinking about how you might put a load on them, the people you love. And this stops you from wanting to go, am I understand that correctly?","time":1653424504000},{"user":"thinker","text":"Maybe... I don't feel like I think much in this situations. Most of what happens seems to happen subconsiously. I'm not able to get me to listen to myself in this situations.","time":1653424608000},{"user":"thinker","text":"It feels like an instinct. An instant flight respnse","time":1653424653000},{"user":"helper","text":"aha, okay.. I can sense how out of control that may feel. That you want something, but your body won't listen","time":1653424676000},{"user":"helper","text":"Let me see if I'm understanding correctly.. ","time":1653424683000},{"user":"helper","text":"you had an opportunity to visit your family on Friday. You would be able to see your girlfriend, and you know that when you get there you'll have a wonderful time. But despite this higher truth, you have thoughts like \"I should start packing, I need to go.\" but then... \"I can't, I don't have the energy, I'm worthless.\" You get caught between this inner desire and face to face confrontation with a need and yet also what feels like complete inability. So you feel depressed.. helpless.. overwhelmed. You procrastinate with distractions such as tv, podcasts, even cleaning. Anything besides the packing. and then suddenly it's too late.. you didn't go.. and now think again, this thought, that you're incapable and worthless... you feel guilty, embarrassed, and the cycle repeats...","time":1653424905000},{"user":"thinker","text":"The thoughts after but then - I barely realize them. I think about packing and next second I sit in bed and watch youtube...","time":1653424937000},{"user":"thinker","text":"But all in all: Yes.","time":1653424952000},{"user":"helper","text":"can you clarify what you mean by, \"the thoughts after, but then..\"?","time":1653424980000},{"user":"thinker","text":"from your question: but then... \"I can't, I don't have the energy, I'm worthless.\"","time":1653425021000},{"user":"helper","text":"aha, so you barely even realize that you are having these thoughts. There are a bit of a subcontext, underlaying your next actions but hard to actually recognize and pull out. Is that right?","time":1653425059000},{"user":"thinker","text":"yes","time":1653425060000},{"user":"helper","text":"yes, that makes a lot of sense. That is often how these thoughts get by with all that they do. We don't always notice how powerful they are, or what they make us truly *believe* about ourselves, because they're working under the visible line of consciousness. ","time":1653425109000},{"user":"thinker","text":"yes","time":1653425115000},{"user":"helper","text":"But that's part of what we do here, bring awareness to these thoughts, the fact that we have them, and where they may be limiting our perception to the bigger picture and affecting our interactions with the world. After all, you really do want to go visit! So who are these measly thoughts to tell you under the radar what not to do ;)","time":1653425159000},{"user":"helper","text":"Let's see if we can dig in. Do you feel ready do pick out some of the cheesy distortions that are affecting your story here today, and write a new ending? ","time":1653425193000},{"user":"thinker","text":"yes","time":1653425198000},{"user":"helper","text":"wonderful","time":1653425204000},{"user":"helper","text":"I Can tell you already have so much awareness and perception of your mind. This is the most important first step. You know that what you ultimately value and what your mind is tricking you in to, may be different things","time":1653425245000},{"user":"helper","text":"So as we begin to delve into these thoughts here, which feels most troubling to you? It may be a combination of some, or a even something we haven't explicitly written out yet. This doesn't mean we'll disregard any of the other thoughts that are coloring the story, but it will help to provide some focus.  ","time":1653425318000},{"user":"thinker","text":"The helplessnes - part is what get's me most, I think. It's part of all other problems...","time":1653425380000},{"user":"helper","text":"yes, that makes sense! This thought \"I can't do it, I don't have the energy\" That is so crippling.. ","time":1653425408000},{"user":"helper","text":"Okay, I see you've selected a couple cheese before we started this session, and I think your intuition really steered you well here. I'd like to examine them a little closer. Can you tell me why you chose \"should statements\"?","time":1653425450000},{"user":"thinker","text":"That's what's going on in my brain, when the super-ego sets an expectation...","time":1653425501000},{"user":"thinker","text":"I should finish this task at work by 12:00","time":1653425517000},{"user":"helper","text":"yes, exacly","time":1653425524000},{"user":"helper","text":"And it's so funny, because even though these should statements are masquerading as motivation, they actually have the exact *opposite effect*","time":1653425549000},{"user":"thinker","text":"yes","time":1653425560000},{"user":"helper","text":"when you think to yourself \"I should pack, I need to go\" This actually enjoyable undertaking of visiting your family becomes yet another unbearable thing to do on a long list of tasks after a long week","time":1653425589000},{"user":"helper","text":"I like to think of it like this story I once heard... ","time":1653425606000},{"user":"helper","text":"imagine you're a young boy, sitting in your room which is just absolutely filthy. You look around at all the dirty clothes and toys and decide for yourself, \"you know what, I think I'd like to have a clean room now. I'm gonna start picking up a little bit\" ","time":1653425653000},{"user":"helper","text":"And right at that moment.. knock knock! In storms your mother, and she yells \"This room is disgusting! Start cleaning right now!","time":1653425675000},{"user":"helper","text":".. do you want to do exactly what you'd just decided to do moments ago?","time":1653425691000},{"user":"helper","text":"likely not right","time":1653425696000},{"user":"thinker","text":":-) ","time":1653425703000},{"user":"helper","text":"Lol","time":1653425707000},{"user":"helper","text":"I suffer from this cheese a lot","time":1653425712000},{"user":"helper","text":"so essentially, this super-ego as you've called it, it's yelling at you to do things you actually really want to do! ","time":1653425730000},{"user":"helper","text":"so you feel frustrated and resentful and tired ","time":1653425740000},{"user":"helper","text":"and sit on the bed to watch you tube","time":1653425746000},{"user":"helper","text":"and then when you do this.. you have another thought \"I can't do it, I don't have the energy\" ","time":1653425768000},{"user":"helper","text":"This is an example of \"control fallacy\" ","time":1653425783000},{"user":"helper","text":"Seeing ourselves as helpless, rather than recognizing where we do have control","time":1653425801000},{"user":"helper","text":"You do so much, I can tell just from our brief conversation that you actually value activity and social interaction and think deeply about the happenings around you. This can be tiring... yes, but only because you are in fact capable. When the should statements drain your energy, you then convince yourself that you're incapable. Your brain really *believes* that","time":1653425869000},{"user":"helper","text":"so you end up not going to visit your family, and yes, this is where the blaming kicks in","time":1653425881000},{"user":"helper","text":"I see you selected that one as well, would you like to talk about it a little bit?","time":1653425890000},{"user":"thinker","text":"Mhh","time":1653425918000},{"user":"thinker","text":"We can, but the blaming feels like a secondary problem right now, but if you think it's important, I would be happy to","time":1653425990000},{"user":"helper","text":"That's a good insight, I think it is secondary in that you are blaming yourself for the residual effects of the first two cheeses. What do you think about those?","time":1653426024000},{"user":"thinker","text":"I'm not sure, what you're asking for. Could you elaborate a bit?","time":1653426079000},{"user":"helper","text":"Of course, I'm just recognizing that I just talked a lot, delving into the details of should statements and control fallacy, and I wonder how it's sitting with you? ","time":1653426109000},{"user":"thinker","text":"I know that they are there and right now it feels like being mindfull about them is a way to tackle themm","time":1653426183000},{"user":"helper","text":"yeah, cool! I agree","time":1653426196000},{"user":"helper","text":"First step is mindfulness, the next step is actually to create a new thought which can take their place. As we discussed, so much of this happens subconsciously. So in order to combat that we create a thought which consciously creates a broader truth, something which is believable and encouraging. It can motivate you without the fierce hands of should statements, and support you and your abilities without the helplessness that is caused by the lack of control in your old thoughts. ","time":1653426300000},{"user":"helper","text":"So next time you have an upcoming task, what is something you can think to yourself that will be kind? I really love the beginning that you have shaped here already, in the new thought box. to \"make baby steps\" Would you like to continue playing with that, or start fresh?","time":1653426364000},{"user":"thinker","text":"I like what I wrote there and it feels right.","time":1653426388000},{"user":"helper","text":"great, the only think I might suggest is sometimes it helps for the new thought to be positive based. It's a little easier to internalize. For example, rather than saying \"without judging to much\" You could say \"I accept the process\" or something similar","time":1653426465000},{"user":"helper","text":"For example: I allow myself to be indulgent, and take baby steps. I accept the process.","time":1653426494000},{"user":"thinker","text":"Mhh, yes, I see. When I read it for myself it has an implicit wink. But the expressive formuation is perhaps better","time":1653426565000},{"user":"helper","text":"aw, I love that. An implicit wink. If it feels fun and playful to you, I say stick with it! We are certainly more likely to remember something if it is also enjoyable","time":1653426612000},{"user":"helper","text":"Well, I'm really glad that the thought you wrote a few days ago still feels good and true to you. Now we have a little more of a foundation to support it as well, after exploring all the ins and outs of your experience here. ","time":1653426651000},{"user":"helper","text":"How do you feel when you think this new thought \"I want to be indulgent with myself. Allow myself to make babysteps without judging too much.\"?","time":1653426669000},{"user":"thinker","text":"It feels like a steep climb, but right now, possible. 70 Minutes ago, I would not be so confident","time":1653426731000},{"user":"helper","text":"That's great to hear. It's really important to keep these new thoughts within reach, for as you said in your new thought, baby steps ;)","time":1653426763000},{"user":"helper","text":"And that actually brings me to my next question, how do you feel compared to when we started?","time":1653426781000},{"user":"helper","text":"More confident.. ","time":1653426793000},{"user":"thinker","text":"More confident, a bit more tired - it's late hiere ;-) And more happy","time":1653426825000},{"user":"helper","text":":) I love that this goes around the world, and I'm glad to hear you feel a little happier","time":1653426856000},{"user":"helper","text":"This new thought works best with practice, to forge new neural pathways, and encourage patience and indulgence with yourself. ","time":1653426886000},{"user":"helper","text":"I'll let you get some rest, but before I do, I'd like to ask if you'd be willing to make this session public? It could be a resource for others experiencing similar trouble to you (as we all sometimes do)","time":1653426928000},{"user":"thinker","text":"Yes, if it helps someone it would be great","time":1653426937000},{"user":"helper","text":"Thank you! It will, I think we've done some really positive work here today. ","time":1653426961000},{"user":"helper","text":"If you'd like to discuss this, or anything else which may be troubling, you can return anytime","time":1653426975000},{"user":"thinker","text":"I'm pretty sure, I will.","time":1653426987000},{"user":"helper","text":"wonderful","time":1653426993000},{"user":"helper","text":"Goodnight, and sweet dreams :)","time":1653427001000},{"user":"thinker","text":"Thank you Pessia. Thank you verry much and have a wonderfull day!","time":1653427020000}]}