{"notes":{"event":"difficult relationships with two old business partners--- Feeling overwhelmed with the situation","thought":"I should be trying to be good with them. \nThey might compete with me and destroy me. \nI might be taking on too much.\nI fear I take on too many projects.\nIf they compete with me and destroy me, I lose their friendship, share in the company, and time spent\n","feelings_behaviors":"death, loss, sad, deflated, beaten, wrong, shamed, killed exiled","new_thought":"We can exist in a friendly competition, moving the market and the world forward."},"messages":[{"user":"thinker","text":"I'm having some anxieties, recurring, about a difficult situation I had. I want to put them all to rest.","time":1545679094000},{"user":"helper","text":"Hi there, thanks for using Cheese! ","time":1545679133000},{"user":"helper","text":"Whats bringing this recurring anxiety? ","time":1545679163000},{"user":"thinker","text":"I'm having difficult relationships with two old business partners.","time":1545679175000},{"user":"thinker","text":"And I'm continuing to work on the business.","time":1545679184000},{"user":"thinker","text":"So these thoughts about them keep coming up.","time":1545679190000},{"user":"thinker","text":"I feel like I've worked through the thoughts before, but then I have them again... or new thoughts, or variations on the old ones, and it's overwhelming.","time":1545679213000},{"user":"helper","text":"what are these thoughts? The old, new, variations. Whichever feels the most troubling ","time":1545679254000},{"user":"thinker","text":"Ok good question.","time":1545679257000},{"user":"thinker","text":"I have a thought that, on the one hand, I should be trying to be good with them. On the other hand, I have a thought that they might squeeze me out and take my stuff.","time":1545679297000},{"user":"thinker","text":"They might compete with me and destroy me.","time":1545679304000},{"user":"thinker","text":"And also that I might be taking on too much. This one is related to them competing with me. It would be like a weakness of mine, that might result in me competing with them, and then they hate me, and then I also lose, and then they destroy me.","time":1545679374000},{"user":"thinker","text":"I think that might be the root thought that leads to the other two.","time":1545679386000},{"user":"thinker","text":"It happens when I feel overwhelmed.","time":1545679390000},{"user":"helper","text":"Just so I get a clear understanding of your thoughts, what would be the weakness in this situation? ","time":1545679433000},{"user":"thinker","text":"The weakness would be me taking on too much. It's like a behavior flaw. I have a fear I take on too many projects, rather than sticking with one and finishing it.","time":1545679459000},{"user":"thinker","text":"I think when I feel overwhelmed I have this thought. And this thought leads to follow-on thoughts that they might destroy me.","time":1545679487000},{"user":"helper","text":"Ah I understand. Im going to summarize everything you've shared to make sure were on the same page","time":1545679521000},{"user":"helper","text":"You've had difficult relationships with two of your old business partners. You think you should be trying to be good with them, but this has proven to be a difficult task. You have the thought that you may be taking on too many projects at once, this for you is a major weakness. Along with this, there is the future possibility of them being your competition. Part of the fear with them being your competition is the potential of them \"destroying\" you. ","time":1545679632000},{"user":"helper","text":"Is this accurate? ","time":1545679637000},{"user":"thinker","text":"I think the triggering event is the feeling of overwhelm.","time":1545679657000},{"user":"thinker","text":"I think the difficult relationships is like... an overview of the whole situation, but it's not the trigger.","time":1545679695000},{"user":"helper","text":"Ok I get that","time":1545679730000},{"user":"helper","text":"What thought do you have when you think about the potential of them being your competition and succeeding? ","time":1545679748000},{"user":"thinker","text":"What thought do I have? or feeling/behavior?","time":1545679765000},{"user":"helper","text":"Why not share both ","time":1545679774000},{"user":"thinker","text":"It makes me think that this is all a waste of time, me trying to take this one, because I might not be capable of it, and if they competed and destroyed me, then not only would I have lost these friends, but I'd also have lost a share in the company, and I'd also have lost the time that I spent on it that I could have invested in my other projects.","time":1545679822000},{"user":"thinker","text":"That's like, death, a very bad outcome.","time":1545679849000},{"user":"thinker","text":"I think that style of thinking is called \"catastrophizing.\"","time":1545679869000},{"user":"helper","text":"What feelings do these thoughts bring? ","time":1545679885000},{"user":"helper","text":"What feelings do these thoughts bring? ","time":1545679887000},{"user":"thinker","text":"Feels like death, loss, sad, deflated, beaten, wrong, shamed, killed, exiled.","time":1545679914000},{"user":"helper","text":"Those are all very strong negative feelings. I'm sorry youre having to experience these ","time":1545679957000},{"user":"thinker","text":"thank you. it's hard.","time":1545679960000},{"user":"helper","text":"I bet. Once again ill quickly summarize","time":1545679972000},{"user":"helper","text":"You have this feeling of being overwhelmed from these difficult relationships with two past business partners. You think you should be trying to be good with them, but that has had obstacles. there is the possibility of them competing with you and destroying you. If they did so, you have the thought that you'd lose friends, share in the company, and time that could have been well spent in other projects. All of this relates back to having the fear of taking on too many projects and trying to figure out how to deal with your relationships. This sistuation has lead to to feel like death, loss, sad, deflated, beaten, wrong shamed, and other negative feelings ","time":1545680159000},{"user":"helper","text":"is there anything youd like to add? ","time":1545680168000},{"user":"thinker","text":"That's pretty good.","time":1545680175000},{"user":"thinker","text":"So nothing I want to add.","time":1545680179000},{"user":"thinker","text":"Thank you.","time":1545680183000},{"user":"helper","text":"Great. For the rest of the session we want to focus on a thought to try and decipher. Which thought is the most troubling that youd like to focus on today? ","time":1545680261000},{"user":"thinker","text":"\"They might compete with me and destroy me.\"","time":1545680287000},{"user":"thinker","text":"That's probably a black & white thought.","time":1545680309000},{"user":"thinker","text":"I don't think I've explored all the shades of grey very well.","time":1545680315000},{"user":"helper","text":"Ok we can focus on that one ","time":1545680356000},{"user":"helper","text":"You automatically knew that that is black and white thinking. How were you able to identify that? ","time":1545680381000},{"user":"thinker","text":"Because the word \"destroy\" is so strong. Competition usually results in multiple people having a part in the competition and getting shares of the pie.","time":1545680408000},{"user":"thinker","text":"There are lots of styles of therapy, and lots of online therapies.","time":1545680429000},{"user":"thinker","text":"There's no reason to believe it's a winner-take-all kinda market.","time":1545680440000},{"user":"helper","text":"I completely agree. ","time":1545680465000},{"user":"helper","text":"When you say \"destroy\", what does that mean in your mind? ","time":1545680482000},{"user":"thinker","text":"It means I have zero in my mind.","time":1545680495000},{"user":"helper","text":"Ah ok. Zero as in they've completely erased you as a competitor. ","time":1545680522000},{"user":"thinker","text":"Yeah, as in I've shut down completely. I guess that only happens if I give up though.","time":1545680541000},{"user":"helper","text":"that is very true ","time":1545680550000},{"user":"helper","text":"You also mentioned that there is no reason to believe \"its a winner tale all kind of market\". How does saying that make you feel? ","time":1545680579000},{"user":"thinker","text":"Well that makes me detach a bit from the thought of being destroyed.","time":1545680602000},{"user":"thinker","text":"So it makes me feel curious I guess","time":1545680608000},{"user":"thinker","text":"But I think when I go further, and think that it's a market that will have many competitors, that changes how I am seeing it and I feel more like it's just time for us to make something good and place it into the competition.","time":1545680648000},{"user":"helper","text":"does that change your approach towards the competition? The competition being your ex business partners","time":1545680678000},{"user":"thinker","text":"Yeah, it's less fearful. It says we can both co-exist and we aren't destroying each other. It's not friends or enemies.","time":1545680692000},{"user":"helper","text":" Thats great","time":1545680728000},{"user":"thinker","text":"Yeah this seems a lot better.","time":1545680742000},{"user":"thinker","text":"Thank you","time":1545680746000},{"user":"helper","text":"Does this impact your relationship towards them? ","time":1545680769000},{"user":"thinker","text":"This thought?","time":1545680786000},{"user":"helper","text":"(this is mostly off topic seeing youve chosen your focus btw.) ","time":1545680798000},{"user":"thinker","text":"It's ok we can play and experiment.","time":1545680801000},{"user":"helper","text":"Does knowing that you can co-exist and know that you're not necessarily destroying eachother impact your thought \"I should be trying to be good with them\" ","time":1545680858000},{"user":"thinker","text":"Oh. That's a good question / good point. Hm.","time":1545680870000},{"user":"thinker","text":"Yeah, well it makes less either/or. It's not so much good or bad to them. I can just make something good, and there will be a market, and we can copy each other's things in the market, and all push the market forward. It's all good.","time":1545680902000},{"user":"thinker","text":"Man I wish cheese were available more like 24/7 so I could get help with this more often.","time":1545680930000},{"user":"helper","text":"Hey well thats a thought! ","time":1545680941000},{"user":"helper","text":"Ok back on topic. \"its all good\" thats good! ","time":1545680956000},{"user":"helper","text":"You're bringing the focus back onto yourself and encouraging yourself to create something good and impactful and letting the market take care of itself ","time":1545680988000},{"user":"thinker","text":"Yeah. That sounds real nice.","time":1545680993000},{"user":"helper","text":"Lets try to come up with a new thought to help you when you think \"they might compete with me and destroy me\" ","time":1545681024000},{"user":"helper","text":"What you said earlier \"It says we can both co-exist and we aren't destroying each other. It's not friends or enemies.\", I think is a good place to start ","time":1545681054000},{"user":"thinker","text":"Friendly competition.","time":1545681066000},{"user":"thinker","text":"We can exist in a friendly competition, moving the market and the world forward.","time":1545681082000},{"user":"helper","text":"that sounds awesome ","time":1545681108000},{"user":"thinker","text":"Yeah I think that's good.","time":1545681129000},{"user":"helper","text":"Are you satisfied with that as your new thought or should we continue to expand> ","time":1545681131000},{"user":"thinker","text":"Maybe I'll have other issues in the future and I would love to work through that too.","time":1545681141000},{"user":"thinker","text":"I think this is quite helpful to iron down that one thing that was really troubling underneath all this.","time":1545681151000},{"user":"thinker","text":"Thank you","time":1545681156000},{"user":"helper","text":"Thats great! ","time":1545681160000},{"user":"thinker","text":"I think this was very fast.","time":1545681161000},{"user":"thinker","text":"We prolly coulda done it even faster if we had just shot through it.","time":1545681173000},{"user":"helper","text":"Yeah definfitel ","time":1545681178000},{"user":"helper","text":"Well, remember to pracitce the thought \"We can exist in a friendly competition, moving the market and the world forward.\" next time youre overwhelmed about being in a \"competition\" with your ex business partnersm ","time":1545681220000},{"user":"helper","text":"partners* ","time":1545681223000},{"user":"thinker","text":"Ok thanks. Yeah this is a big deal. Phew.","time":1545681226000},{"user":"helper","text":"Great! ","time":1545681235000},{"user":"helper","text":"See you soon!","time":1545681238000},{"user":"thinker","text":"Okie","time":1545681240000},{"user":"helper","text":" Merry christmas@","time":1545681249000},{"user":"thinker","text":"!!! :)","time":1545681250000}]}