{"notes":{"feelings":"Unmotivated\nHopeless\nDoubt\nFear of Failure","event":"Wanting to finish these two assignments I had, do laundry, go to the supermarket, then cook. I woke up even earlier than usual but I just didn't do them.","behaviors":"Shut down and go to sleep\n\nHad plans to do things but didn't end up doing it","thought":"I lack drive to actually do the things I want to do\nI am worthless\nI am a waste of space\nIt makes me look lazy\nIt holds me back\n","labels":{"labeling":true,"control-fallacy":true},"new_thought":"I am not worthless and I CAN do things that prove to me that this is true"},"messages":[{"user":"thinker","text":"Feeling down. Complete lack of motivation","time":1618448228000},{"user":"helper","text":"Welcome to Cheeseburger! My name is Nathan and I'm here as your helper today.","time":1618451986000},{"user":"helper","text":"Thank you opening up right away. I hear you are feeling because of a complete lack of motivation.","time":1618452035000},{"user":"helper","text":"feeling down*","time":1618452049000},{"user":"helper","text":"It can be a struggle to feel a lack of motivation. I understand that! ","time":1618452094000},{"user":"thinker","text":"What do I do to get more motivated?","time":1618452355000},{"user":"helper","text":"Well let's dig into more of the why this might be happening and figure it out for you! My goal as your helper is to be here to help you navigate what's going on. We do our best not to give any advice. But we do use a form of Psychology that I think can really help you gain some insight.","time":1618452178000},{"user":"thinker","text":"Okay. I think I understand. ","time":1618452438000},{"user":"helper","text":"So can you tell me when this feeling down and lack of motivation started happening? Was there a specific event that happened recently or a time that you can remember when it started? ","time":1618452256000},{"user":"thinker","text":"I think it was about two weeks ago. I just didn't feel like doing anything. ","time":1618452538000},{"user":"helper","text":"I'm sorry to hear that. 2 weeks sounds like a pretty long time to be feeling down and unmotivated :/","time":1618452335000},{"user":"thinker","text":"It is making it difficult to do the simplest things. ","time":1618452607000},{"user":"helper","text":"I can imagine! I can relate to that feeling and the difficulty there is in accomplishing things when I felt that way.","time":1618452401000},{"user":"helper","text":"What happened 2 weeks ago when you started feeling this way? ","time":1618452420000},{"user":"thinker","text":"It is hard to pinpoint it. I was on school break. I just felt stressed without having a real reason to be.","time":1618452759000},{"user":"helper","text":"mmmm I see, thanks for clarifying!","time":1618452543000},{"user":"helper","text":"What thoughts come to mind when you feel unmotivated?","time":1618452563000},{"user":"helper","text":"And just in case you were wondering about this process a little (as I'm sure you can see me typing away on the left hand side) I am here to take notes so we can end this session with a New Helpful Thought. That is our goal :)","time":1618452702000},{"user":"thinker","text":"I guess it is feelings of hopelessness, overwhelming feeling of doubt, fear of failure. I just kind of shut down and go to sleep.","time":1618453012000},{"user":"helper","text":"wow, that seems like a lot of things to be feeling! I'm hearing in your messages that you don't like feeling this way and I feel you there! Who would want to feel that way. It would be helpful for our process here if we focus on some thoughts you might be having when you are feeling these ways. Can you tell me, when you are feeling these ways, are there any unhelpful or possibly negative thoughts in your head? And if so, can you identify some or one for me? ","time":1618452915000},{"user":"thinker","text":"During those times, I feel worthless. ","time":1618453213000},{"user":"helper","text":"So that is another feeling and that's completely okay but I think what will help you the most is if we look into the thoughts. So when you say you feel worthless during those times are you saying you think the thoughts to yourself that \"I am worthless\"?","time":1618453073000},{"user":"thinker","text":"Yes.","time":1618453337000},{"user":"thinker","text":"Or stuff like I am a waste of space ","time":1618453359000},{"user":"helper","text":"I imagine that must make you really sad. It would make me sad too. ","time":1618453170000},{"user":"helper","text":"Are there some more thoughts that come up?","time":1618453191000},{"user":"thinker","text":"Not really. ","time":1618453441000},{"user":"helper","text":"Are these thoughts you are having today?","time":1618453241000},{"user":"thinker","text":"Yes. I had plans to actually do things yet I lacked the drive to do it.","time":1618453569000},{"user":"helper","text":"That sounds like it could be frustrating to lack the drive to do the things you want to do","time":1618453392000},{"user":"helper","text":"What were the plans you wanted to do?","time":1618453411000},{"user":"thinker","text":"Finish these two assignments I had, do laundry, go to the supermarket, then cook. I woke up even earlier than usual but I just didn't. ","time":1618453733000},{"user":"helper","text":"That sounds like a busy but good day to me.","time":1618453559000},{"user":"helper","text":"What do you think is most troubling about what happened today, about having the thought that you lack the drive to do the things you want/need to do? ","time":1618453603000},{"user":"helper","text":"Do you feel it holds you back, defines you or anything else? I","time":1618453633000},{"user":"helper","text":"I don't want to put words in your mouth, I just like to offer suggestions. ","time":1618453654000},{"user":"helper","text":"btw","time":1618453657000},{"user":"thinker","text":"I definitely holds me back. It makes me look lazy. I don't like feeling this way.","time":1618453921000},{"user":"helper","text":"I imagine you don't like feeling this way! Just looking at the list of things you wanted to accomplish today it sounds like you value getting things done. Would you so?","time":1618453751000},{"user":"thinker","text":"Yes. I like keeping busy and eventually completing what I need to do.","time":1618454065000},{"user":"helper","text":"That can be such a good feeling to put things on a list and at the end of the day to be able to scratch them off. Completing things can be very beneficial for our mental health. Who knew!","time":1618453869000},{"user":"helper","text":"I want to draw your attention to the right side btw just to keep things as transparent as possible you can see I am writing things down as we go. If you ever have any questions about this process, please let me know.  ","time":1618453991000},{"user":"helper","text":"This time is for you :)","time":1618453999000},{"user":"helper","text":"And if I can say so, I think it is a great first step of accomplishing things like you seem to enjoy doing! So congrats on your first step!","time":1618454043000},{"user":"thinker","text":"Thank you. 😊","time":1618454300000},{"user":"helper","text":"So at this point I usually like to do a little summary of what you have said and what I have heard so far. I'm going to take a minute or so to go over my notes and then I will write it out. Feel free to go use the restroom or something if you need to. Take a second to breathe and close your eyes even (just don't fall asleep quite yet, we aren't done) haha","time":1618454150000},{"user":"helper","text":"Latley, you've been feeling unmotivated and you really aren't a fan of that! You actually don't like it much at all. You enjoy accomplishing things, it's something you value and feel good about. Even today as an example you wanted to finish some assignments, do laundry, go shopping, cook, get things done. You even woke up earlier than normal to do it but it just didn't get done. You have this thought that you lack drive to actually do the things you want and when you have this thought you feel hopeless and unmotivated, you are filled with doubt (possibly of yourself). And when you think this way, and then feel this way you shut down and go to sleep or don't follow through with your plans that you had. It is a cycle that seems to be continuing. Like a snake biting it's own tail. It can't seem to actually move forward.","time":1618454508000},{"user":"helper","text":"Is there anything I'm missing to this, or anything you would like to add/ make note of? ","time":1618454534000},{"user":"thinker","text":"That's the gist of how I am feeling. ","time":1618454808000},{"user":"helper","text":"I'm sorry you are feeling this way but I am glad we are on the same page and that you have come to talk to someone about this. You are making great progress even if you don't feel that way. ","time":1618454622000},{"user":"helper","text":"So what we do here is really focus on thoughts and how they influence our feelings which then dictate our behaviors. We all do it, we all have these nagging, unhelpful thoughts whether we realize it or not. And it's not even that the thoughts are 'bad' but they are just not helpful. So our goal now is to dig in some more and label a thought pattern with what we call 'cheese' (they are just different styles of patterns). A lot of the time once we identify whats happening in our thoughts we gain some much needed perspective. ","time":1618454763000},{"user":"helper","text":"Once we have this new perspective we will come up with a new helpful thought that will hopefully impact your life in a positive way!","time":1618454812000},{"user":"helper","text":"Does all this makes sense? ","time":1618454820000},{"user":"thinker","text":"I follow. The ","time":1618455073000},{"user":"helper","text":"If you look to list on the right under 'Thoughts' you'll see a little Burger icon. Do you see it?","time":1618454884000},{"user":"helper","text":"Are you still with me?","time":1618454974000},{"user":"thinker","text":"Yes. I was wondering what the burger icon was for.","time":1618455251000},{"user":"helper","text":"Haha now you know. Cute little burger. ","time":1618455026000},{"user":"helper","text":"I think it would be wise if we focus on this thought you have that seems to be the most troubling, which is, \"I lack drive to actually do the things I want to do\"","time":1618455072000},{"user":"helper","text":"Does that sound like a good focus to tackle? Or is there another thought you would rather look at?","time":1618455098000},{"user":"thinker","text":"Yes. That seems like the main cause of my problems. ","time":1618455482000},{"user":"helper","text":"Okay, I am going to label that thought with one of the Cheese we are talking about and I will explain it alright? ","time":1618455275000},{"user":"thinker","text":"Okay.","time":1618455557000},{"user":"helper","text":"Alright, so what I have heard has brought me to this point of two patterns (cheese) I see taking place. The first one is Control Fallacy. The idea of this is that we are caught in a cycle and see ourselves in a place with no control over our life. ","time":1618455448000},{"user":"helper","text":"Control fallacies are precisely that – fallacious beliefs about our control (or lack thereof) over a situation","time":1618455453000},{"user":"thinker","text":"How do I take back control then?","time":1618455717000},{"user":"helper","text":"great question! I think one of the first steps is to recognize that its happening, which is what we are doing now. :)","time":1618455509000},{"user":"helper","text":"Another pattern I am seeing is 'Labeling.' You seem to run into this place where once you tell yourself you lack drive to actually do the things you want you then go into a place of calling yourself 'worthless' or 'I am a waste of spoace' 'I'm lazy'. Obviously, telling ourselves these negative things is causing negative results in your life. Which makes perfect sense. Again, it's cycling over and over. ","time":1618455661000},{"user":"thinker","text":"Is it possible to break the cycle? ","time":1618455952000},{"user":"helper","text":"Another great question and the answer is a resounding YES :)","time":1618455726000},{"user":"helper","text":"There is hope! It's getting your foot into the door as its seems to be closed. All you gotta do is sneak that foot in and then begin to pull the door open and soon enough you will find this door wide open for you !","time":1618455787000},{"user":"helper","text":"We get that door cracked open by our thoughts. Specifically, by coming up with a new helpful thought that can replace the unhelpful \"I lack drive to actually do the things I want to do\" one. ","time":1618455852000},{"user":"helper","text":"How does that sound?","time":1618455857000},{"user":"thinker","text":"Sounds good. How do I change this type of thinking?","time":1618456168000},{"user":"helper","text":"Lets do it right now by coming up with a new thought! What is something you can tell yourself that is positive and that is opposite of you unhelpful thought?","time":1618455980000},{"user":"helper","text":"your*","time":1618455993000},{"user":"thinker","text":"I am not worthless. ","time":1618456255000},{"user":"helper","text":"wow! That sounds like a powerful thought. Try typing it out again. Just for practice.","time":1618456048000},{"user":"thinker","text":"I am not worthless. ","time":1618456314000},{"user":"helper","text":"You are not worthless! You have worth!","time":1618456089000},{"user":"helper","text":"That new thought really tackles that second thought and I think really helps contradict the negative labeling pattern that you are falling into. ","time":1618456143000},{"user":"helper","text":"How do you feel when you think, 'I am not worthless, I have worth.\" ?","time":1618456162000},{"user":"thinker","text":"I feel because I am not worthless, I should do things that prove I have value.","time":1618456514000},{"user":"helper","text":"I think you are on to something. I am just going to make a quick change if you don't mind. Just because using the word 'should' is also a cheesy thought and we are trying to stay away from those. So I hear you actually saying, \"I feel because I am not worthless that I CAN do things that prove I have value\"","time":1618456353000},{"user":"helper","text":"How does that sound? ","time":1618456358000},{"user":"helper","text":"Are you still with me? ","time":1618456523000},{"user":"thinker","text":"Yes. I can do that.","time":1618456795000},{"user":"helper","text":"Awesome! So I'll help you hear a bit to make this thought clear and concise. ","time":1618456601000},{"user":"helper","text":"A new thought can be \" I am not worthless and I CAN do things that prove to me that this is true\"","time":1618456640000},{"user":"helper","text":"What do you think about that?","time":1618456648000},{"user":"thinker","text":"I think that works. Should I repeat that when I feel down and try to push myself? ","time":1618456937000},{"user":"helper","text":"I think that sounds like a really great plan! ","time":1618456729000},{"user":"helper","text":"Remembering to tell yourself that new thought when you are thinking these negative ones that label yourself or tell you, you arent in control. Because you are, it is your life and you can take control of it by repeating this new thought :)","time":1618456802000},{"user":"helper","text":"What feelings come up when you think your New Thought/","time":1618456841000},{"user":"thinker","text":"I feel kinda silly for thinking that I felt that way before. But I also feel like I can actually do things. So thank you for that, Nathan.","time":1618457244000},{"user":"helper","text":"I am so happy to hear that! Don't feel silly lol we all fall into patterns of thinking like this. Sometimes you just need someone else to process it with. I am happy to be here. ","time":1618457055000},{"user":"helper","text":"It seems like we are at the end of our sessions as long as are feeling good about your new thought? ","time":1618457102000},{"user":"thinker","text":"Yes. I think I am. Seriously. I didn't think it was going to work but I actually feel good. ","time":1618457411000},{"user":"helper","text":"Yes! That is so awesome! Our thoughts are powerful, They are hungry and they grow into whatever we tell them. So keep telling yourself your new thought. Feed your brain all the good stuff :) ","time":1618457228000},{"user":"helper","text":"Also, would you be okay if we make this session public for training purposes and as we are just in Beta testing and growing it could be valuable to have in the future :)","time":1618457273000},{"user":"thinker","text":"Sure thing. I don't mind.","time":1618457524000},{"user":"helper","text":"Well, great! I think we are done here. And please, feel free to come back any time if you need to talk again. Also, tell your friends about us :) We all could use a Helper in our lives.","time":1618457326000},{"user":"thinker","text":"Will do. Thank you very much, Nathan. 😊","time":1618457602000},{"user":"helper","text":"Good night and have a great rest of your week!","time":1618457395000},{"user":"thinker","text":"You as well.","time":1618457644000},{"user":"helper","text":"Hey, this is Nathan from Cheeseburger Therapy. I want to follow-up with you to see how your new thought, \" I am not worthless and I CAN do things that prove to me that this is true\" has helped you since our last convo. Have you had the opportunity to implement your new thought? Would you like to schedule another session soon?                                      I look forward to hearing from you soon!                        Have a great week!","time":1621534653000}]}