{"notes":{"event":"fight with family","thought":"I can't communicate normally with my family.\n\n- he is too controlling at times\n- he's unfair\n- he doesn't understand me","feelings":"I feel easily frustrated and combative when talking with them.\n\n- Annoyed\n- regret\n- defensive","behaviors":"I tend to shout and complain about small things.\n- Don't apologize \n- Don't acknowledge doubts or wrongs\n- Avoidance","labels":{"control-fallacy":true,"blaming":true},"new_thought":"\nMy parents want the best for me, even if they might not show it in the best way. With patience, I can understand their point of view and work on explaining mine so we can move forward on the same page"},"messages":[{"user":"thinker","text":"I don't have a great relationship with my family.","time":1655495754000},{"user":"helper","text":"Hi, thanks for joining me here. I see you're struggling with some family dynamics, I know how difficult that can be at times. I see you're recognizing some challenges in communicating with them. That can take a lot of self reflection, so you're off to a great start :)","time":1655499621000},{"user":"helper","text":"Would you like to tell me a little more about this recent fight?","time":1655499633000},{"user":"thinker","text":"Sure","time":1655499725000},{"user":"thinker","text":"It wasn't a super big fight","time":1655499732000},{"user":"thinker","text":"I guess its more of general quarrels","time":1655499743000},{"user":"thinker","text":"especially when I'm not feeling great overall","time":1655499810000},{"user":"thinker","text":"I tend to take it out on them","time":1655499814000},{"user":"helper","text":"I hear you. Sometimes with family is when we are most exposed or vulnerable, as they know us so well.. and being in that state can also bring out this irritability or annoyance. It's natural, but also a worthy goal to work on ","time":1655499864000},{"user":"helper","text":"So it's a series of quarrels, would you like to share what happened in the most recent one? We can look into what may have caused this feeling of annoyance that became words or complaints you may regret","time":1655499903000},{"user":"thinker","text":"I think it was due to finances","time":1655499911000},{"user":"thinker","text":"like my dad brought up some bills","time":1655499923000},{"user":"helper","text":"aha.. yeah","time":1655499930000},{"user":"thinker","text":"and was grilling me about it ","time":1655499952000},{"user":"thinker","text":"even thought I spent money from my own account","time":1655499969000},{"user":"thinker","text":"I feel like he is too controlling at times","time":1655499987000},{"user":"thinker","text":"and that causes me to push back","time":1655499992000},{"user":"helper","text":"oh yes, that makes sense.. as we get older our parents will sometimes still be stuck in a 'raise the kids' mindset, and we've moved on to being responsible adults, so there's an emotional discrepancy there that can be hard to reconcile..","time":1655500042000},{"user":"thinker","text":"mgm","time":1655500050000},{"user":"thinker","text":"mhm","time":1655500051000},{"user":"helper","text":"And so you found yourself pushing back a little bit, this makes sense.. when he was being controlling about the finances which were from your own account, what other thoughts came up for you? ","time":1655500105000},{"user":"thinker","text":"I thought he was being unfair and didn't understand me","time":1655500201000},{"user":"helper","text":"I see you have this thoughts as well, that you can't communicate 'normally' with your family. You also chose control fallacy to interpret this thought, which is really good insight. It seems perhaps it's going both ways, you see that he isn't communicating well with your, and then, seemingly out of your control, you have difficulty responding in the way you desire as well","time":1655500364000},{"user":"helper","text":"I can see there's a pattern here, in the expectation of communication styles, that likely both of you want to break","time":1655500398000},{"user":"thinker","text":"yep","time":1655500401000},{"user":"helper","text":"please, go ahead","time":1655500405000},{"user":"thinker","text":"yeah I think we both tend to fall into the same unhealthy communication patterns","time":1655500442000},{"user":"thinker","text":"where he sorta provokes me and I lash out ","time":1655500479000},{"user":"helper","text":"what thoughts come up for you, after you lash out? I sense some doubt in yourself and your ability to communicate in a healthy way.. what other thoughts or feelings arise in this moment of recognition?","time":1655500528000},{"user":"thinker","text":"hmm","time":1655500533000},{"user":"thinker","text":"I either tend to blame my parents and come up with justifications for why I acted the way I did","time":1655500571000},{"user":"thinker","text":"in the moment","time":1655500583000},{"user":"thinker","text":"instead of acknowledging that I had control","time":1655500597000},{"user":"thinker","text":"and could have had a more productive discussion","time":1655500610000},{"user":"helper","text":"It can be so challenging in the moment, and in reflection or regret we look back to wish we had done things different, I totally get it","time":1655500645000},{"user":"helper","text":"but as your relationship with your parents is heartier than these quarrels, hopefully we can look at the behavior pattern and find some holes to reroute future conversations in a way that's more empathetic to both sides","time":1655500684000},{"user":"helper","text":"Let's take a closer look at your behaviors here, as I Can see that's where most of our focus is landing. When you feel annoyed, and defensive, I see you noted shouting or complaining about small things. You've mentioned an 'unhealthy communication style.' Are there any other actions you find yourself taking or not taking when you feel this sort of heightened irritation?","time":1655500754000},{"user":"thinker","text":"I don't acknowledge doubts or apologize when i'm wrong  ","time":1655500881000},{"user":"thinker","text":"and become combative in general","time":1655500906000},{"user":"helper","text":"Thank you for sharing that.. I know how hard it can be admit our own wrongdoings, especially when we feel like we're not alone in it!","time":1655500932000},{"user":"helper","text":"I feel eager to dive in to some of these thoughts, to explore control fallacy and perhaps some other cheese that may be guiding your reactions to find one more benevolent to yourself and those around you. ","time":1655500976000},{"user":"helper","text":"I just want to be sure we're on the same page, so I'll take just a moment to summarize if you're ready? :)","time":1655500992000},{"user":"thinker","text":"yep","time":1655500995000},{"user":"helper","text":"Alright","time":1655500999000},{"user":"helper","text":"You've recognized a pattern lately in interactions with your family. Specifically recently you were quarreling with your dad about finances, *your* finances. You had thoughts that he is too controlling sometimes, unfair, not understanding you. These thoughts brought about feelings of frustration, annoyance, competitiveness. Naturally in the moment this is expressed as shouting or complaining, a lack of apology or vulnerability when you're wrong. When you see yourself acting this way, you have the thought \"I can't communicate normally with my family\"... this leads to regret, more behaviors that don't align with your desire for healthy relationships, and so on.. the cycle continues","time":1655501205000},{"user":"helper","text":"Does this fit for you? Is anything missing?","time":1655501218000},{"user":"thinker","text":"that fits ","time":1655501224000},{"user":"helper","text":"Great, thanks for helping me to understand :)","time":1655501238000},{"user":"helper","text":"Are there any thoughts or feelings coming up for you as you read this over, mull over the cycle?","time":1655501260000},{"user":"thinker","text":"I feel frustrated at myself and my communication habits","time":1655501296000},{"user":"thinker","text":"It leads me to pull buck from my family ","time":1655501313000},{"user":"thinker","text":"as well","time":1655501315000},{"user":"thinker","text":"and to avoid communicating things ","time":1655501334000},{"user":"thinker","text":"at times","time":1655501338000},{"user":"helper","text":"I hear you, it can be hard to really sit in it.. easier to withdraw","time":1655501343000},{"user":"helper","text":"I imagine some sadness in there, you want to be with them, to be able to talk with them, but when you see repeated times that it doesn't work.. you pull back","time":1655501377000},{"user":"helper","text":"to save yourself, and them, from the discomfort","time":1655501388000},{"user":"helper","text":"am I understanding correctly?","time":1655501393000},{"user":"thinker","text":"yes","time":1655501401000},{"user":"helper","text":"The value you have, the desire to connect with your family, and the love you have for them, is very apparent to me","time":1655501432000},{"user":"helper","text":"I just wanted to share that with you because knowing it's there means all we need now it find the channel in which you can express it to them to. Or if not is so many words, at least be present in a way that is not the walls or barriers you find being formed in these arguments","time":1655501478000},{"user":"helper","text":"so let's look at the first set of thoughts, the ones you have in the middle of the fight","time":1655501498000},{"user":"helper","text":"\"He's too controlling, unfair, doesn't understand me\" ","time":1655501509000},{"user":"helper","text":"That's really difficult to be thinking about your father! ","time":1655501521000},{"user":"helper","text":"I think you already accurately recognized there is some blaming there.. I'll go ahead and bring up some cheese now","time":1655501542000},{"user":"helper","text":"Blaming means to assume someone is responsible for events which they have little or no control","time":1655501566000},{"user":"helper","text":"It doesn't mean they are right, or that they couldn't be better... it simply means that because you are having these thoughts, you feel badly and in turn act badly","time":1655501593000},{"user":"helper","text":"Every father/child relationship is different but the thing that remaisn the same through them all is eventually the kid grows up, and that can be a significant adjustment for the parent","time":1655501624000},{"user":"helper","text":"There are likely many underlying factors in his love and relation to you that is being expressed in this overpowering way","time":1655501650000},{"user":"helper","text":"in unhealthy communication that in turn activates your own unhealthy communication, without any exit point","time":1655501678000},{"user":"helper","text":"so if we look at those thoughts and recognize where they may not be taking in the whole picture, it can be possible to break the loop and extend vulnerability in it, which may in turn invite the same ","time":1655501721000},{"user":"helper","text":"I know I just went pretty deep into it, because blaming can be a hard one to shake sometimes, especially when it feels so TRUE. But how does that sit with you?","time":1655501751000},{"user":"thinker","text":"yeah thats pretty accurate","time":1655501808000},{"user":"helper","text":"Cool, I'm glad you see it. I feel us already approaching some of the behaviors notes earlier, in acknowledging doubt and the avoidance, just by being here","time":1655501848000},{"user":"helper","text":"so let's look at the most troubling thought of \"I can't communicate normally with my family\"","time":1655501863000},{"user":"helper","text":"You selected control fallacy and you're spot on","time":1655501874000},{"user":"helper","text":"It's so easy to be swayed by our emotions in the moment, *Especially* defensiveness and annoyance. When you see these reactions happening again and again on both sides, it can be natural to think there isn't any other way","time":1655501911000},{"user":"helper","text":"but in fact you already have control. By being here, you are working towards being closer with them (the opposite of pulling back). And I've seen you acknowledge wrongs and defensiveness. What I see in this is where you have a power of emotions, a longing for connection, and a true ability to take this value and turn it into a connection with your family that can withstand fights. (For it's important to remember that everyone fights sometimes, especially in families)","time":1655502039000},{"user":"helper","text":"In fact.. it might be good to look into that a little too","time":1655502047000},{"user":"helper","text":"you say 'communicate 'normally''","time":1655502060000},{"user":"helper","text":"but I want to remind you that feeling annoyed and defensive and upset *is* normal","time":1655502080000},{"user":"helper","text":"to work through it, and to continue loving despite it, that's where the real trick comes in ;) and you're doing just that","time":1655502110000},{"user":"helper","text":"I think that's all the cheese I can east for now, how are you doing now, reading all this?","time":1655502161000},{"user":"thinker","text":"Yeah thats really helpful","time":1655502205000},{"user":"thinker","text":"I definitely to mull over this more","time":1655502209000},{"user":"thinker","text":"and apply it","time":1655502218000},{"user":"helper","text":"hey, I'm glad you bring that up... the best way to apply it would be in finding a new way to think about fights with your family, so that in similar situations in the future you'll have this mentality by your side and can watch your behaviors potentially redirect in the way you want","time":1655502281000},{"user":"helper","text":"What do you say, want to write a new thought with me?","time":1655502294000},{"user":"helper","text":"Imagine you have a quarrel with your family, what can you think to yourself to support and encourage your relationship, and your belief in your communication abilities? ","time":1655502350000},{"user":"thinker","text":"My parents want the best for me even if they might not show it in the best way. Instead of lashing out, I should try to understand their point of view and explain mine in a healthy fashion so we can move forward on the same page.","time":1655502434000},{"user":"helper","text":"nice, I love the sentiment behind that, especially the first sentence! ","time":1655502448000},{"user":"helper","text":"If I may, sometimes it helps to frame things in the positive.. we also want to express the thing we can do and want to do, rather than pushing ourselves with 'should statements' (another cheese) because sometimes this makes us feel like we don't really want to do it.. resentful.. similar behaviors. Thoughts are really powerful!","time":1655502512000},{"user":"helper","text":"so let's see... ","time":1655502516000},{"user":"helper","text":"My parents want the best for me, even if they might not show it in the best way. With patience, I can understand their point of view and work on explaining mine so we can move forward on the same page","time":1655502563000},{"user":"helper","text":"( I also removed healthy fashion, simply because sometimes putting these labels on can create a sort of black and white dichotomy that is too much pressure. Healthy/unhealthy, normal/not- normal... it's all much more nuanced","time":1655502607000},{"user":"helper","text":"we can focus on kindness and let the connection brew from this","time":1655502620000},{"user":"helper","text":"what do you think of this thought? If you sit in it, or say it out loud, what feelings come up for you?","time":1655502638000},{"user":"helper","text":"My parents want the best for me, even if they might not show it in the best way. With patience, I can understand their point of view and work on explaining mine so we can move forward on the same page","time":1655502650000},{"user":"thinker","text":"It feels more empowering and gives me more control over thigns","time":1655502725000},{"user":"thinker","text":"things","time":1655502727000},{"user":"helper","text":"That's so wonderful :) ","time":1655502732000},{"user":"helper","text":"I good to carry that power into the moment, the presence, the new thought, you got this :)","time":1655502762000},{"user":"helper","text":"And how are you feeling compared to when we started?","time":1655502769000},{"user":"thinker","text":"I feel like the relationship is much more manageable than I made it out to be ","time":1655502847000},{"user":"thinker","text":"and I feel lighter after saying it out loud","time":1655502878000},{"user":"thinker","text":"my experience ","time":1655502892000},{"user":"helper","text":"yes, yay ","time":1655502903000},{"user":"helper","text":"emotions can be so heavy, I'm glad we were able to lighten the load a little today","time":1655502917000},{"user":"helper","text":"You can come back to this page anytime, or write your new thought somewhere visible so you have it handy in any future interactions","time":1655502945000},{"user":"helper","text":"Remember it's okay and normal to have these arguments sometimes, it's how you move forward that really counts","time":1655502966000},{"user":"helper","text":"on that note of it being normal.. I Was wondering if I could ask. Many people struggle with family dynamics, and I imagine they could benefit from this session similarly to how you did. Would you be willing to make it public so others can read and learn on our site? Completely up to you, and only if you're comfortable ","time":1655503026000},{"user":"thinker","text":"sure ","time":1655503056000},{"user":"helper","text":"Thank you! :) It is much appreciated. With that we are done.. please come again with this, or anything else that may be troubling you. ","time":1655503091000},{"user":"thinker","text":"awesome thankm you so much!","time":1655503106000}]}