{"notes":{"feelings":"stress\nburnt out\nunmotivated","event":"tired\nsee lots of material to cover\nbehind expected study schedule\nlazy & unmotivated to study","thought":"I don't deserve to sleep because I haven't been productive, and there are a lot of things to do.\n\nI'm lazy.\n\nthere is a lot of material to cover, but I can't get productive.\nI don't have study-stamina.\nThis is the homestretch. 4 weeks left. I've reached my max.","behaviors":"netflix, be with friends, attend some family events","labels":{"labeling":true,"should-statement":true,"blaming":true},"new_thought":"I am tired. I need sleep!.\nI can get sleep and then be a great studier and a great person because I care about this and I'm capable and when I get sleep, all my cylinders will be firing really well!"},"messages":[{"user":"helper","text":"Hello. Welcome back to the big cheese. How are you today?","time":1665086445000},{"user":"thinker","text":"Hi! ","time":1665086758000},{"user":"helper","text":"Hi.","time":1665086761000},{"user":"thinker","text":"Sorry for the delay! ","time":1665086764000},{"user":"helper","text":"That's ok.","time":1665086767000},{"user":"helper","text":"I am relaxed.","time":1665086771000},{"user":"helper","text":"How are you?","time":1665086774000},{"user":"thinker","text":"I’m a bit stressed hehe","time":1665086801000},{"user":"helper","text":"Oh, well I am glad to be here to be a helper for you.","time":1665086809000},{"user":"helper","text":"Why don't we get started then? Can you tell me what is troubling?","time":1665086824000},{"user":"thinker","text":"well lately i've been very lazy and unmotivated to study. ","time":1665086900000},{"user":"thinker","text":"mostly that ","time":1665086903000},{"user":"helper","text":"Ok, I can imagine that could be stressful if you want to get good grades. :-p","time":1665086913000},{"user":"thinker","text":"right hehe ","time":1665086916000},{"user":"thinker","text":"and there is a good amount of material to cover in addition to other school-related assignments and projects ","time":1665086946000},{"user":"thinker","text":"so it's just been difficult because i know there is a lot to do, but i can't seem to put myself in a position to be productive and if i do i simply don't have the stamina to stay focused and efficient for a long time or i should say even a short time ","time":1665087037000},{"user":"helper","text":"Okay, so you're feeling lazy and unmotivated, and you see all this material to cover, and you think \"I can't get productive. I don't have the study-stamina to do this.\" What is most troubling to you in this whole swirl of stuff?","time":1665087090000},{"user":"helper","text":"You end up feeling stressed.","time":1665087096000},{"user":"thinker","text":"i suppose its the fact that its the homestretch for this year. i have about 4 weeks left, but they just feel eternal. and i feel so drained from this year that it just feels like i've reached my max. ","time":1665087183000},{"user":"helper","text":"You've reached your max... oh, like do you feel burned out?","time":1665087197000},{"user":"thinker","text":"yeah!! burned out. ","time":1665087216000},{"user":"thinker","text":"especially because i get the moments with small reasons to pull through but they are not enough ","time":1665087248000},{"user":"helper","text":"Yeah, small reasons, not adding up to the big reasons.","time":1665087258000},{"user":"helper","text":"Burnout often happens when what we are doing isn't feeding some big needs we have.","time":1665087276000},{"user":"helper","text":"Then we \"burn out\" all our energy without replenishing it. Some resource inside us needs to be fed.","time":1665087301000},{"user":"thinker","text":"yeah that second part sounds more relatable ","time":1665087313000},{"user":"helper","text":"What do you think the resource might be?","time":1665087323000},{"user":"helper","text":"Or how might it relate?","time":1665087327000},{"user":"helper","text":"(The second question is better I think.)","time":1665087336000},{"user":"thinker","text":"hmm let me ponder on that for a second ","time":1665087354000},{"user":"thinker","text":"it may be a combination of burnouts like physically, mentally, and emotionally (especially because stress always comes in increasing waves and then it calms down and so forth)...in terms of needs not being fed and replenished that resonated well but i'm not sure which needs aren't being met ","time":1665087486000},{"user":"thinker","text":"yet ","time":1665087490000},{"user":"helper","text":"I see, well it sounds like physical, mental, and emotional needs probably. Like the whole slew. :) Stuff that you might get from rest and recoup. R&R.","time":1665087503000},{"user":"thinker","text":"yeah actually that could be true, especially like the mass effect of poor patterns of sleep accumulating now...i just didn't think about it because i have been trying to get more rest not sleep but more rest which has taken over not doing my work and taking care of my responsibilities ","time":1665087592000},{"user":"thinker","text":"in addition to the lack of motivation to do them ","time":1665087602000},{"user":"helper","text":"Ok, so like you've been doing more non-sleeping rest, like maybe watching tv and video games and internet browsing or something?","time":1665087634000},{"user":"thinker","text":"yesss for me it's watching netflix, spending more time with friends at school or out of school (some things that are pertaining to school, but i'm less strict on the time more easy flowing having less limitations) ","time":1665087736000},{"user":"thinker","text":"attending some small family events ","time":1665087758000},{"user":"thinker","text":"things that don't take too much time but i would other wise say no because i need to study ","time":1665087775000},{"user":"helper","text":"mmm","time":1665087778000},{"user":"thinker","text":"i've also tried to reinforce my exercise routine and sacrificing study/school work time to do that ","time":1665087819000},{"user":"thinker","text":"pretty much prioritizing everything but school related work ... even helping others with their school work as long as it doesn't including doing mine ","time":1665087871000},{"user":"thinker","text":"ironically ","time":1665087876000},{"user":"helper","text":"I see. Yeah, it sounds like a lot of distracting or avoiding the work.","time":1665087886000},{"user":"helper","text":"I also get the impression with the burnout that you might have some resources that need replenishing, and some of these things might or might not replenish some resources, like sleep.","time":1665087914000},{"user":"thinker","text":"right like i'm resting but the pattern of poor sleep continues ","time":1665087938000},{"user":"thinker","text":"and it makes sense because i know i need rest, sleep, and feed certain needs and it just seems like i'm not doing it right ","time":1665087977000},{"user":"thinker","text":"all in addition to studying and work ","time":1665087986000},{"user":"thinker","text":"i am meeting some, but not the essential ones perhaps ","time":1665088000000},{"user":"helper","text":"ah, yeah, that is good to get clarity on!","time":1665088010000},{"user":"helper","text":"it might also be confusing, like why do you end up doing things that when you look in the big picture aren't meeting the needs that you are looking at — studying, grades, and physical rest with sleep?","time":1665088045000},{"user":"helper","text":"when this happens, we can look at our feelings and thoughts right before we start those behaviors and see what they are saying.","time":1665088069000},{"user":"thinker","text":"hmmm it's interesting you ask me that...as i was reading the first thing that came to my mind was that i don't deserve to sleep because i haven't bene productive and i know there is a lot of things to do so i focus on just trying to rest from school by doing other things and needs, first and then thinking i will be ready to study after but that doesn't seem like the case and then yeah...","time":1665088153000},{"user":"helper","text":"Ohhhh... bingo. That is key right there. Good job.","time":1665088166000},{"user":"thinker","text":"and then i guess when i have tried to take a nap in the middle of the day it's not always the best for me because i crave more than just 30-1hr. like my body will ask for more and then i just end up wasting more time on sleep and waking up ","time":1665088246000},{"user":"helper","text":"Yeah... sleep in the middle of the day can be very disruptive and not as good as sleep at night.","time":1665088274000},{"user":"helper","text":"And then your body can get used to sleeping in the middle of the day and might be tired at that time the next day, and might not sleep as well at night when you need to sleep at night.","time":1665088295000},{"user":"thinker","text":"yeah!","time":1665088306000},{"user":"helper","text":"I think I see a general pattern here.","time":1665088314000},{"user":"helper","text":"I think it starts with feeling tired, and unmotivated. When we feel tired (cause we need sleep) we often feel unmotivated to continue on the tasks of our work. However, you also have the value of finishing school — 4 weeks left, homestretch! — and being competent and productive and making stuff and achieving your goals, which is a great thing, but when you feel this tiredness and lack of motivation, you think \"I don't deserve to sleep because I haven't been productive, and there are a lot of things to do.\"","time":1665088415000},{"user":"helper","text":"This thought is in a sense blaming you for not being at a particular schedule of productivity, and expecting something of yourself regardless of the specific case, where in this case, your body and mind and emotions only function when you have sleep. You cannot be productive without sleep. Sleep will feed your productivity.","time":1665088469000},{"user":"helper","text":"But it is like blaming yourself, for achieving some expectation of yourself regardless of the circumstance.","time":1665088505000},{"user":"helper","text":"When you think \"I don't deserve to sleep\", it doesn't meet your sleep need, and you are just left being awake, and feeling the result of lacking sleep— stress, burnout, and unmotivation.","time":1665088536000},{"user":"helper","text":"As a result of those feelings, you end up naturally doing things that aren't sleep, but don't require motivation, like netflix, being with friends, and attending some family events, where there are other people providing the motivation.","time":1665088560000},{"user":"helper","text":"However, this leaves you spending time doing *not sleep* and *not study*, and so you aren't replenishing yourself, nor are you studying and progressing your grades, and this leads to a vicious cycle where you end up again tired and behind your expected schedule. And then you tell yourself \"I don't deserve to sleep because I haven't been productive...\" and the cycle repeats.","time":1665088611000},{"user":"helper","text":"Is anything else coming up for you? Did I leave anything out here?","time":1665088641000},{"user":"helper","text":"Did I get anything wrong?","time":1665088647000},{"user":"thinker","text":"no i think you got everything on the spot...and i really appreciate that observation and classification you made with the looking for external motivation due to the lack of internal motivation ... i feel like i was able to understand myself better because i'm even tired while resting and doing those other things that don't require motivation as you said it ","time":1665088738000},{"user":"thinker","text":"thank you ","time":1665088741000},{"user":"helper","text":"Yeah, it's like external motivation to do stuff that isn't resting.","time":1665088751000},{"user":"helper","text":"and you need rest!","time":1665088754000},{"user":"helper","text":"this external motivation is actually counter-useful, like sometimes it's good to not have motivation because then you can rest and have a really deep sleep :)","time":1665088771000},{"user":"helper","text":"you are welcome. :)","time":1665088778000},{"user":"thinker","text":"right it's so paradoxal ","time":1665088782000},{"user":"helper","text":"It's really easy to get into these cycles when stressed, because we don't take the time to look at everything, and we just go go go go towards the goal. I can tell you really care about studying and school this term! That is admirable and inspiring that you value it so, but it's also going to go better if you value yourself and your need for sleep and rest so that you can feed yourself and care for yourself because you are good and you need to give yourself good sleep so you can be good and do good stuff.","time":1665088845000},{"user":"thinker","text":"yea that's definitely true ","time":1665088858000},{"user":"thinker","text":"i see it now ","time":1665088864000},{"user":"helper","text":"yay","time":1665088867000},{"user":"helper","text":":)","time":1665088868000},{"user":"thinker","text":"hehe ","time":1665088877000},{"user":"helper","text":"So, let's put you back into the mindset of that triggering event— you are feeling tired, but you see lots of material to cover. You might think you are behind on a study schedule. You might be feeling some unmotivation to study. What can you think to yourself now?","time":1665088919000},{"user":"thinker","text":"the part about \"valuing myself\" really resonated with me and i'd like to include that ","time":1665088973000},{"user":"helper","text":":) that's a good one!","time":1665088974000},{"user":"thinker","text":"but when you reminded me of the trigger what came to my mind was just understanding and hearing myself ","time":1665089064000},{"user":"helper","text":"Yeah!","time":1665089065000},{"user":"thinker","text":"and recognizing that i am tired that its not just a trigger and being okay with that an not trying to deny it or hide it and thus seeking external motivation for other things that are not accepting of that truth that i am tired ","time":1665089152000},{"user":"thinker","text":"so to combine it i suppose ....","time":1665089159000},{"user":"thinker","text":"i am tired. and that is okay. i can simply rest. ","time":1665089228000},{"user":"helper","text":"👍 wow, the power of just recognizing that you are tired! That alone is so compassionate to yourself.","time":1665089239000},{"user":"helper","text":"and it is not only okay to rest when you are tired. it is how you will make yourself your best, and make you in a mode where you will be super productive.","time":1665089257000},{"user":"helper","text":"because you really care about studying— that's totally evident. you just need to give yourself the sleep and rest so that your body can do its best at the studying! this will make you a better studier by resting. this is the path to success.","time":1665089289000},{"user":"thinker","text":"yeah i really like the way you put that ","time":1665089301000},{"user":"helper","text":":)","time":1665089305000},{"user":"thinker","text":"it was crazy to accept that because not recognizing it i now see made me want to be active in anything as long as it meant keeping up that i am not tired mentality ","time":1665089369000},{"user":"helper","text":"wowwww that just showed me something really deep — good job noticing that","time":1665089390000},{"user":"helper","text":"You have been calling yourself \"lazy!\"","time":1665089398000},{"user":"helper","text":"that is a labeling thought!","time":1665089400000},{"user":"helper","text":"And as a result, you are wanting to prove yourself by being active.","time":1665089411000},{"user":"helper","text":"But you need sleep!","time":1665089416000},{"user":"thinker","text":"uuuu wow i see that yea i hadn't thought about it like that ","time":1665089417000},{"user":"thinker","text":"ugh wow ","time":1665089429000},{"user":"helper","text":"yeah!","time":1665089432000},{"user":"thinker","text":"i am so mean to myself ","time":1665089434000},{"user":"helper","text":"awwwe","time":1665089437000},{"user":"helper","text":"You just need some sleep. You are so good!","time":1665089443000},{"user":"helper","text":"All you want to do, truly, is succeed and study and be good.","time":1665089451000},{"user":"helper","text":"But yeah, you call yourself lazy and that ascribes something to your character, and then you are trying to defend and prove yourself against that characterization by going around so active!","time":1665089477000},{"user":"helper","text":"But you just need sleep.","time":1665089483000},{"user":"thinker","text":"that completely makes sense!!!","time":1665089484000},{"user":"helper","text":"Yeah. :)","time":1665089487000},{"user":"helper","text":"Good job today.","time":1665089489000},{"user":"thinker","text":"i appreciate you listening ","time":1665089500000},{"user":"thinker","text":"it helped to see me if that makes sense ","time":1665089518000},{"user":"helper","text":"Yeah...","time":1665089522000},{"user":"helper","text":"I think you are calling yourself lazy in response to seeing yourself not wanting to work... when you are tired!","time":1665089533000},{"user":"helper","text":"But rather than ascribing you unmotivation to tiredness and a need for sleep— listening to yourself compassionately —you label yourself lazy.","time":1665089550000},{"user":"helper","text":"That isn't nice and then you end up defending yourself against yourself. lol.","time":1665089560000},{"user":"thinker","text":"haha ","time":1665089564000},{"user":"thinker","text":"we are our worst enemy ","time":1665089573000},{"user":"helper","text":"We are so intimate to ourselves, we really listen when we are mean.","time":1665089588000},{"user":"helper","text":"So this new thought that starts with \"I am tired. I need sleep!\" is acknowledging the accidental and extrinsic, instead of labeling your character. That is so good because it says \"I can get sleep and then be a great studier and a great person because I care about this and I'm capable and when I get sleep, all my cylinders will be firing really well!\"","time":1665089645000},{"user":"thinker","text":"exactly that!! yesssss ","time":1665089657000},{"user":"helper","text":"Ok, I went ahead and put that into your new thought box. How does it feel?","time":1665089683000},{"user":"thinker","text":"i really really like it...it makes me feel rested in my mind at least for now and also motivated that i have a solution to the dismotivation and its easy its just sleeping and trying to prioritize that and not avoid it ","time":1665089751000},{"user":"helper","text":"aww, yeah it's such a restful mindstate that is also good! it's so easy to sleep when you are tired if you are in a mindstate that sees the value of it. you can go with your flow, and you will do great! congratulations!","time":1665089776000},{"user":"thinker","text":";))) ","time":1665089789000},{"user":"helper","text":"Ok, so now you just have to remember when you are tired and/or unmotivated, to think \"I am tired. I need sleep! This will make me better and do my best at school!\"","time":1665089821000},{"user":"thinker","text":"yeah, i am actually going to write it on a sticky note now cause i now i'll need the reminder ","time":1665089854000},{"user":"helper","text":"aww, that is a good idea! often when we are tired, it is hard to remember things. you are being compassionate with your tired self now! You are empathetic with yourself. You like yourself again and are being nice to yourself again. This will make you stronger and more successful and also happier and prouder. :)","time":1665089887000},{"user":"thinker","text":":) ","time":1665089890000},{"user":"thinker","text":"thank you for that sweet message!!! ","time":1665089898000},{"user":"thinker","text":"really! ","time":1665089900000},{"user":"helper","text":"You are so welcome!","time":1665089903000},{"user":"helper","text":"This has been a very nice session.","time":1665089907000},{"user":"helper","text":"thank you for this.","time":1665089909000},{"user":"thinker","text":"no thank you!!! ","time":1665089915000},{"user":"helper","text":":)","time":1665089916000},{"user":"helper","text":"Ok, well you are done! Would you like this session to be viewable by the public? Other people could benefit from reading it.","time":1665089932000},{"user":"thinker","text":"of course, i am okay with that!! ","time":1665089941000},{"user":"helper","text":"Thank you!","time":1665089943000},{"user":"helper","text":"Ok, enjoy your rest, and your new energies you will find after you rest!","time":1665089954000},{"user":"thinker","text":"i love that, sounds beautiful!! ","time":1665089966000},{"user":"thinker","text":"have a nice rest of you day/night!!! ","time":1665089978000},{"user":"helper","text":"👍","time":1665089987000},{"user":"thinker","text":"and until again!! ","time":1665089987000}]}