{"notes":{"event":"unexpected panic attack","thought":"***I'm concerned with the idea of being sick\n-What I'm doing is not enough\n-I might lose confidence in my ability to be there for my daughter","feelings":"-anxious\n***physical symptoms\n-stressed\n-tired\n-unmotivated\n-unfulfilled","behaviors":"-avoid caregiving voluntarily\n-seek therapy","labels":{"black-or-white-thinking":true,"fortune-telling":true,"blaming":true},"new_thought":"I accept physical pain, I will use it as an indicator for what my body needs. I will care for myself out of love, to enjoy my time with my family and friends and be able to do the things that fulfill me and them. I accept that fear may come naturally, but I will transform it into acceptance and rational action."},"messages":[{"user":"thinker","text":"Hi, I’m not sure what to say, I thought to try this out. I’m concerned about being sick, perhaps even with the idea of pain or death. It causes me some anxiety and perhaps phantom physical symptoms. I have some trouble managing my marriage, a child, work, and my parents and siblings. That causes me some stress that has been for a year manifesting as tiredness and lack of motivation as well as recently with the combination of COVID a little bit of high blood pressure. I certainly feel tired and unfulfilled. ","time":1652814059000},{"user":"thinker","text":"I think I should say my thoughts while I have them as to not forget why I’m feeling the way I am. So, thank you for bearing with my ramble. ","time":1652814142000},{"user":"thinker","text":"What brought this on was a surprise panic attack (high heart rate) I had in December of 2020. I had to call an ambulance but thankfully calmed down when they arrived and told me I was fine according to the instruments. I didn’t think much of it until it happened again one week after I saw my wife’s grand father at his funeral (April 2021). I was at the barber shop and had another episode this time it manifested as light headedness and low blood sugar. We have a history of diabetes and blood pressure so I thought it would be wise to go to a doctor and perform routine checkups (though I am 26 years old). The blood and other tests came back extremely normal. I also went to a cardiologist, he said I was “unremarkable” lol, which still makes me smile and also feel good a little. At this time I booked an appointment with a therapist and thought to speak about how I was feeling to navigate the anxiety I have and why I’m having panic attacks. (I should mention that between my first and second attack my performance at work plummeted even though I’m normally much more productive and responsible). ","time":1652815178000},{"user":"thinker","text":"I’ve been having sessions on and off with my therapist for about 8 or 10 months now (which is slowly starving my wallet, but I’d like to feel well, so it’s alright). ","time":1652818175000},{"user":"thinker","text":"I have transferred jobs to a supposedly more comfortable and easy going place, but I think it might be doing more harm than good. I don’t have many marital problems, except that perhaps I don’t get enough intimacy and that we don’t have a shared plan for the future yet, nor do we a shared financial plan. I come from a reserved culture, we are products of an arranged marriages, it is also expected of me to provide for the house, my wife doesn’t demand it, and it gives me a sense of fulfillment when I do. But increasingly I have a feeling that its not enough. ","time":1652819583000},{"user":"thinker","text":"I’ll wait for you to prod me for more details in case I’ve said too much. See you later and thank you for this service!","time":1652819790000},{"user":"helper","text":"Hi there & welcome!  I've been spending the last little while here reading over what you've shared, and just want to say thank you for your openness and your vulnerability.  It sounds like you've been going through some things that are a bit overwhelming at times lately, and that you are really taking a lot of steps to try to feel better and do better. ","time":1652860797000},{"user":"thinker","text":"Hello :)","time":1652860808000},{"user":"thinker","text":"Thank you, and sorry for the ramble!","time":1652860820000},{"user":"thinker","text":"I’m in your care!","time":1652860831000},{"user":"helper","text":"No need to apologize :)  It all sounds relevant and helps me to get a good sense of where you're at and what's bringing you here.  ","time":1652860855000},{"user":"helper","text":"Before we get started, I'd just like to check in and ask if you have any questions about our platform in order to feel more comfortable?","time":1652860872000},{"user":"thinker","text":"well, I’m just not sure what the cheese is, is it the negative thought I’m supposed to try and change?","time":1652860916000},{"user":"helper","text":"ah!  good question.  yes, you're on to the right idea.  we are trained using cognitive behavioral therapy techniques to help people try to identify thoughts that might be contributing to negative feelings they are experiencing.  the idea is, if you can bring awareness to them and consciously choose new thoughts, you can use the power of your mind to help you start feeling better and create change in your life in the direction you'd like to be heading.","time":1652860993000},{"user":"helper","text":"so the cheese isn't the thoughts themselves, per se, more the patterns within the thoughts (that everyone falls into at one point or another) that contribute to the negative feelings","time":1652861025000},{"user":"thinker","text":"Understood!","time":1652861027000},{"user":"helper","text":"Great!  Sessions with me usually last about 90 minutes, give or take about half an hour, depending on what's feeling beneficial.  Does that sound okay with your schedule?  ","time":1652861078000},{"user":"thinker","text":"Yes, I’m here to try and have a few light bulb moments that I hope would push me forward, so I’m here the entire time :)","time":1652861132000},{"user":"helper","text":"Great :)  yes, i can really hear your willingness to bring even more awareness to yourself (it sounds like you already have a good amount too!), so im excited to dive in and explore together.","time":1652861164000},{"user":"helper","text":"On the right panel, I've jotted down some notes from what you initially shared and may continue to make notes for both of our benefit as we chat, just to give a little structure and organization to what we're talking about and hopefully provide more clarity.  If at any point, something doesn't resonate or feel true to your experience, please feel free to let me know!  This time is for you.","time":1652861223000},{"user":"thinker","text":"Will do :)","time":1652861239000},{"user":"helper","text":"I understand that there's a number of things that have been going on for you lately.  It sounds like you've been making efforts to have a positive marriage and family, and to do well with your work.  But it sounds like perhaps the stress of everything is feeling a little overwhelming, and that over the course of the past couple years, since having a panic attack, you've been proactively taking steps to better manage your health and your life.  But it sounds like maybe there's still a feeling of a little stuckness, or not feeling totally confident if you're making the progress you'd like.  Does that sound accurate?","time":1652861384000},{"user":"thinker","text":"It does! And sometimes it feels like its taking too long. ","time":1652861429000},{"user":"helper","text":"Sure.  When you say taking too long, are you referring mostly to the therapy sessions you've been doing?","time":1652861453000},{"user":"thinker","text":"Therapy has been perhaps the most positive thing that I’ve done for myself the past two year (a long time now that i think about it). Im talking about feeling normal again, not worrying about things that I see other people go and do normally, having true fun and enjoyment. ","time":1652861537000},{"user":"helper","text":"Ah, thank you for clarifying!  I'm really glad to hear that you've found a therapeutic relationship that feels beneficial for you -- that can be very powerful, and I'm glad to hear that it's been something that's been helpful in providing support for you.  Feeling normal again....do you feel that prior to the panic attack, you didn't feel the large sense of worry you've been experiencing?  Just trying to get a better sense, thanks for your patience with my questions :)","time":1652861636000},{"user":"thinker","text":"Yes exactly, prior to the panic attack, I felt the normal amount of worry (imo) that a person should feel, enough to cause change, but not enough to hinder. ","time":1652861698000},{"user":"helper","text":"I understand.  And I know you mentioned having a child...is that a recent addition to your family, or have they been with you awhile now?","time":1652861732000},{"user":"thinker","text":"She’s 7 months old! And she has been a part of our family and perhaps she is more pleasure than worry at the current koment :)","time":1652861777000},{"user":"helper","text":"Awww :)  Congratulations!!  My husband and I are expecting our first (a little girl) soon, and it's very sweet to hear that.   I just ask because I know that even with the joy they bring, children (even during the pregnancy) can certainly bring a new sense of responsibility and perhaps feeling our own significance more, having such a small being depending on us.","time":1652861861000},{"user":"thinker","text":"Thank you :) I wish you a safe delivery and prosperity! :) It's a gift for sure!","time":1652862412000},{"user":"thinker","text":"Honestly, I feel like I thrive on this kind of dependence, but I'm worried that with my mentality that I may lose confidence for caring for her.","time":1652862443000},{"user":"thinker","text":"For example, right after her birth, our culture dictates that the mother and child spend 40 days with the mother's mother in her home, not in our home. So I defied the culture and stayed with them instead lol, I also tried my ultimate to contribute to caring for her, so much my own mother feels I've been taken advantage of haha, but I'm rambling now. Anyways, now a days its a little bit difficult because I'm feeling down and that I haven't had any fulffillment in a long time so I sometimes, rarely, avoid baby sitting and give the task to someone else.","time":1652862573000},{"user":"thinker","text":"But whenever I'm in the mood, even if she's crying or warm due to vaccines, I still manage to get a giggle and laugh which makes my day, at least until some negativity overcomes it lol","time":1652862619000},{"user":"helper","text":"It is sweet to read about your experience as a new father.  And thank you for the well wishes :)  ","time":1652862145000},{"user":"helper","text":"I'm hearing in here another concern -- that you've really been giving your all to be present as a father, even going so far as to defy culture (which I know how difficult that can be, and how everyone can have an opinion what they feel is best), but even so, you worry that if you aren't able to get a better handle or perspective on your mental health, that it might affect your ability to be there and care for her","time":1652862242000},{"user":"helper","text":"Does that sound like something that comes up for you a lot?  Or is it more another worry in the sea of worries?","time":1652862257000},{"user":"thinker","text":"It does come up, but its mixed with all the other things, somehow they don't come up separately like this except rarely. I've been nodding while you typed that, that's how I feel.","time":1652862810000},{"user":"helper","text":"Thank you...I think that helps me understand a little more","time":1652862352000},{"user":"helper","text":"I'm just taking a moment to take everything in...thanks for your patience","time":1652862397000},{"user":"thinker","text":"Take your time! but just to point something out, I see in the behaviors section that I avoid caregiving, but maybe I described that wrong.","time":1652862942000},{"user":"thinker","text":"Whenever asked I do hold her, play with her, change the diapers, etc, but increasingly I don't do it volunteerily (don't know the write word for that)","time":1652862987000},{"user":"thinker","text":"Yes :)","time":1652862991000},{"user":"helper","text":"okay, sure!  thanks for helping me understand that better.  i definitely want the notes to accurately reflect your experience, so that's helpful","time":1652862539000},{"user":"helper","text":"So just a little recap so far:  Since having a panic attack in late 2020 (a stressful year for most everyone, no doubt!), you've been feeling a bit overwhelmed.  You're a new dad, and it sounds like you get fulfillment both from being there for your wife and your daughter.  It sounds like there aer also expectations of you from extended family.  It sounds like generally, you have a pretty good handle on things: you have stable work, you are present for your family, yet there are is a general feeling of anxiety.  You don't have a lot of stress in your marriage, but you would desire more intimacy, and would also like to make a shared plan (both financial and perhaps general) with your wife.  You've been increasingly worried about the idea of being sick, and it sounds like some of your anxieties have manifest in psychosomatic symptoms.  You get fulfillment from being a husband and a father, but you worry more and more that what you're doing isn't enough.  You think that this anxiety you've been experiencing may impact your confidence in being able to be their for your daughter.  These thoughts contribute to feelings of anxiety, physical symptoms, stress, tiredness, lack of motivation, and unfulfillment.  In response to these difficult feelings, i hear that you've been seeking therapeutic support (both in the form of doctors and mental health experts) and sometimes avoid voluntarily caregiving for your baby, something which wasn't a problem for you when she was born.  ","time":1652862937000},{"user":"helper","text":"Is there anything that you'd like me to understand better, or that you'd like to add?","time":1652862954000},{"user":"thinker","text":"I just want to say that the most prevalent thing those feelings have contributed to are my physical symptoms, and anxiety. I notice them so much it puts me in a feedback loop. Am I sick, will I be alright, why is my blood pressure so high, etc. This week I had an episode and had to go the ER because my BP was so high, the doctor said I'm only 26, drink some water and relax, then the BP went back down a little. Yesterday night, I measured it and it was also a little high, barely had a couple hours maybe of sleep.","time":1652863633000},{"user":"helper","text":"I understand.  Yes.  Thank you for bringing our attention to what feels MOST troubling in all of this.  I definitely hear what you're saying about the feedback loop this has been creating, and I think that make a lot of sense.  I also hear that these physical symptoms have been very real and (i imagine) very scary at times.  ","time":1652863226000},{"user":"thinker","text":"Yes, exactly. I hope to fix the situation soon, because I don't like those feelings haha","time":1652863763000},{"user":"helper","text":"i imagine!  again, i just want to say i really notice the level of self awareness you have, of wanting to take good care of yourself, both for your own wellbeing and for that of your loved ones.  it sounds like you really care a lot -- i know when we care deeply about important things in our life, we can put a lot of pressure on ourselves.","time":1652863327000},{"user":"thinker","text":"Yes, thank you, my mother says I should take a step back and not think too  much, easier said than done unfortunately.","time":1652863880000},{"user":"helper","text":"easier said than done, indeed :)  but i understand her sentiment and her care too.  ","time":1652863391000},{"user":"helper","text":"Are there any feelings or behaviors that you'd like to add?  ","time":1652863410000},{"user":"thinker","text":"Nope :)","time":1652863921000},{"user":"helper","text":"okay, thank you","time":1652863437000},{"user":"helper","text":"I understand that in all of this, in the sort of sea of worry that you've been experiencing, the most troubling and pertinent thing are the real and scary physical symptoms you've been experiencing.  Naturally, when we feel our health or bodies are in danger, it can trigger more feelings of anxiety.  I think it is wise of you to notice the feedback loop that some of these anxious thoughts have been creating, to bring awareness to it to attempt to interrupt the cycle.  ","time":1652863549000},{"user":"helper","text":"I'd like now to bring awareness to the cheese icon.  If you click on it, you'll see a list of cheese labels, again, patterns of thinking we all fall into at times that tend to lend themselves to distressing feelings.  ","time":1652863593000},{"user":"helper","text":"Feel free to peruse with me and if you like, feel free to let me know if any of these feel relevant to your thoughts about the idea of being sick, or in general to how you've been feeling","time":1652863628000},{"user":"thinker","text":"I think Black/White thinking is something relevant, fortune telling would be another, maybe blaming?","time":1652864206000},{"user":"helper","text":"I'd love to hear in your own words how those relate!  I can definitely see correlations, but I think it might be powerful to hear you reflect on how some of these patterns may be contributing, if you'd be open to sharing","time":1652863740000},{"user":"thinker","text":"Sure, for black and white thinking, I'm often feeling that I'm either very sick, or very healthy. Like for my recent high BP, I felt like I needed to get on some medication quickly to fix the situation, or else something bad will happen. Or in my care for my family, I often feel I have to be there all the time, or I wouldn't be properly caring.","time":1652864358000},{"user":"thinker","text":"When in reality, perhaps all of those things exist in a gradient. I can be a little tired and worried and therefore have some rising blood pressure. I may need to adjust my lifestyle to bring it down, etc. But in the moment, its difficult to think of those things, I'm not sure why.","time":1652864419000},{"user":"thinker","text":"For Fortune telling, I find myself seeing what is happening to others as something that will surely happen to me, even though there might be little to no indication of it, just the thought or mention of some relative who had to go through some tough time or procedure gets me going.","time":1652864498000},{"user":"helper","text":"take your time, im listening :)","time":1652864004000},{"user":"thinker","text":"Blaming is perhaps something I didn't talk about much but from my therapy sessions, I've been told the reason stems mainly from the lack of intimacy in my marriage, but I feel like that's unfair to my wife. But more and more, I've been noticing a disparity in how much we offer each other. (I believe in the languages of love and to give them without expecting return, but my subconcious is thinking of other things haha)","time":1652864597000},{"user":"helper","text":"Thanks so much for sharing all of that.  There are a lot of insights here, and i hear how much you are looking at yourself, trying to understand how you can continue to learn how to approach things in a good way.  I think we can hone in a few things here, there is good insight in all of them.  Since you hadn't shared much about the blaming piece before, i just want to ask a clarifying question.  When you say you notice a disparity in what you offer to one another, do you mean mainly physical intimacy?  Or do you mean in general, offering love to one another in a variety of ways?","time":1652864249000},{"user":"helper","text":"No right answer, and if you're not comfortable answering it's totally okay too","time":1652864262000},{"user":"thinker","text":"It's alright, I don't mind! Really, its just in general but most noticibly when I ask for anything, its often rejected first, then perhaps out of guilt, accepted. It's been slowly changing over the term of our marriage, but its something that comes up often, I used to speak up at the beginning but it made my wife feel bad, so I somehow started suppressing these emotions and only asked when I know for sure I can be accepted (rejected for the first time most times unfortunately). I tried discussing the subject, but our culture and her up bringing somehow affects the conversation and it rarely ends up positvely, just with both of us sulking like kids haha.","time":1652864920000},{"user":"thinker","text":"Physical intimacy is the most prevalent, but even other things, simple gestures, words, gifts, a touch, its rare unfortunately.","time":1652864952000},{"user":"thinker","text":"I'm not too demanding in my opinion, but people are different.","time":1652864972000},{"user":"helper","text":"i understand.  it sounds like there is so much care in how you are trying to approach things, and that you really care about trying to have good communication and connection in your relationship with your wife.  i'm sure it can feel painful when you ask to get your needs met and it feels like rejection.  that's understandable.  i also understand that sometimes culture and upbringing can have a way of making it difficult to talk about things, and that marriage and new parenthood really have a way of making us confront the patterns within our lives.  ","time":1652864589000},{"user":"thinker","text":"Yes, thank you for your empathy, it helps when someone sees where I'm coming from","time":1652865124000},{"user":"helper","text":"of course.  i don't usually share too much, but it is very fascinating that we are having a lot of parallels in our lives right now.  my husband also comes from a culture where he is expected to provide, and while i don't neccesarily have that expectation for him, to do that alone, it is a big expectation for himself.  at the same time, i think similar to you, he wants to flip the paradigm on some of the things he grew up with and wants to be more present with caregiving and family life (something that's not totally expected).  i think he feels a lot of similar pressure, not knowing how he is able to be all of those things, and being afraid of letting us down.  but i really don't see it that way -- what make me feel safe and cared for is his commitment to us and his efforts, not how much his results are, if that makes sense...  ","time":1652864777000},{"user":"thinker","text":"It does! I hope that you both can get through the pressures successfully! You seem like a very healthy family! I'm glad you're not focusing on the results but the intentions! For me I feel its a bit difficult, maybe we're too young an inexperienced, but I sometimes can't get a point accross haha, but its getting better :) I should hang in there. (see the blaming? xD)","time":1652865375000},{"user":"helper","text":"haha thank you :)  no, we're not perfect, and my intention isn't to burden you with our situation, i just mean to point out that i hear that you are doing a great job, and that i understand the pressures you are going through.  my husband is the same age as you haha...that is why i'm feeling a little blown away by all the similarities.  ","time":1652864931000},{"user":"thinker","text":"Oh wow, strange world xD And I'm not burdened! Thank you, its good to hear I'm doing good from time to time :)","time":1652865469000},{"user":"helper","text":"strange world indeed!  let me just take a moment here...","time":1652864992000},{"user":"thinker","text":"Take your time!","time":1652865501000},{"user":"helper","text":"so, i want to ask what would feel most beneficial at this point.  i think there are a couple things we could do with the remainder of our session.  we could focus solely on the physical symptoms and changing some of the narratives and thought patterns around that.  i hear that you are thinking intentionally about communication in your marriage, that there has been progress in getting to know one another in the time that you've been together, and that there are things you'd like to continue to work on.  (one more thought that's coming to mind:  as far as disparity in physical intimacy, i do wonder if one factor that may be contributing could be that being a new mom is just having your wife feeling a little \"touched out,\" a phenomenon that can be common in women with babies -- having a little one rely on your body for so much comfort and nourishment, combined with the healing of childbirth, can make one more averse to intimacy for a period of time...  something that really has nothing to do with you and everything to do with the season of life you both are finding yourself in)  i'm wondering if you'd like to just focus on the physical symptoms, or if you'd like to also try to tie in this piece and see if we can find some helpful new thoughts around this too?","time":1652865330000},{"user":"thinker","text":"I agree, we should focus on the physical symptoms!","time":1652865858000},{"user":"thinker","text":"Regarding being \"touched out,\" first new term learned today, I like it, and secondly, I feel she's been more open to touch and physical intimacy than before birth. Physical intimacy has been an issue we have since the beggining unfortunately, but like I said, slowly but surely, equilibrium will be found with both of us being happy, hopefully","time":1652865947000},{"user":"helper","text":"ah, okay thank you for clarifying!  i really appreciate your optimism, and it sounds like you've been doing everything in your power to be a safe space for your wife to feel like she can open up physically.  that does sound very encouraging that it's been more comfortable for her since giving birth, and again, i can hear the care and concern that you have for her experience too :)  ","time":1652865533000},{"user":"helper","text":"so certainly, hopefully having a little space to reflect on that piece can provide a little more insight or food for thought, but we can focus on bringing change to the patterns around the physical symptoms, the part that's been most distressing for you.","time":1652865582000},{"user":"thinker","text":"Let's do it :)","time":1652866098000},{"user":"helper","text":"i just want to scroll up to where you were talking about b&w thinking and fortune telling for a moment to reread that...","time":1652865620000},{"user":"thinker","text":"sure","time":1652866135000},{"user":"thinker","text":"I like the idea of making one, so let me have a shot.","time":1652866188000},{"user":"helper","text":"would you like to have a go at drafting a new thought, or would you like to have me offer one, and you can edit as you like to make it more true to you?","time":1652865681000},{"user":"helper","text":"of course :)","time":1652865684000},{"user":"thinker","text":"Just to make sure, I'm supposed to reframe what exactly?","time":1652866203000},{"user":"helper","text":"thanks for asking!  i understand that you've been having a recurring and intense thought about the state of your health: an intense worry of being unwell or that your health is in grave danger.  I also understand from your reflections in that there is a pattern of having all or nothing thinking in regards to your health -- that it's hard at times for you to see it as just a holistic aspect of who you are and your wellbeing that should be maintained consistently with love.  in contrast, sometimes you see it as something that's sort of either very well and not needing maintenance (perhaps?) or very unwell and needing immediate attention or intervention.  I also hear that the fortune telling pattern comes into play when you hear of an unfortunate health incident affecting a family member or someone close and having a tendency to generalize that it will also happen to you, to consider this one scary possibility in the wide realm of possibilities for your health.  ","time":1652865943000},{"user":"helper","text":"So taking that into account, the awareness of this thought, as well as the awareness of some of your patterns around it, is there a way that you can consciously choose to think about your health in a loving and holistic way, something that honors all of you, without jumping in to extremes?","time":1652865990000},{"user":"thinker","text":"I will try my best, but it might seem too philosophical or cheesy. We are human, we degrade, and that's okay.","time":1652866531000},{"user":"helper","text":"take your time...","time":1652866138000},{"user":"thinker","text":"Oo it got erased. Sorry let me type it in the notes app","time":1652866226000},{"user":"helper","text":"sure :)","time":1652866229000},{"user":"thinker","text":"Physical pain is alright, feel it, know that its part of life. Don’t let it control you, instead use it as an indicator of what you should do next. ","time":1652866345000},{"user":"thinker","text":"What do you think?","time":1652866355000},{"user":"helper","text":"i think it's a great start!  sometimes i find it helpful to phrase new thoughts/intentions in the form of positives, rather than negatives...","time":1652866393000},{"user":"helper","text":"So I would keep most of it how it is but i might shift it slightly to : I accept physical pain, I feel it and acknowledge it as part of life.  I use physical pain as an indicator of what I need/what my body is trying to tell me.","time":1652866464000},{"user":"helper","text":"I just say that because it's a little mind trick -- sometimes when we tell ourselves 'don't' our brain tends to just hear what follows the don't.  I also have been having an idea that if you like, you could incorporate, something like: I tend to my health and wellbeing from a place of love.","time":1652866542000},{"user":"helper","text":"it sounds like you've been trying to take good care of yourself, but that sometimes it stems from fear.  i wonder if switching that framing might feel like a new paradigm","time":1652866577000},{"user":"helper","text":"ultimately, it is your thought & i want you to choose something that feels beneficial and true to you :) something that hopefully steers away from these negative feelings and towards the best version of yourself","time":1652866613000},{"user":"thinker","text":"I like that, just let me take a moment from your time and think a little1 :)","time":1652867143000},{"user":"helper","text":"of course :)","time":1652866642000},{"user":"thinker","text":"I accept physical pain, I will use it as an indicator for what my body needs. I will care for myself out of love, to enjoy my time with my family and friends and be able to do the things that fulfill me and them. I accept that fear may come naturally, but I will transform it into acceptance and rational action.","time":1652867325000},{"user":"thinker","text":"I don't know if that's any better, but I stole some of your words!","time":1652867343000},{"user":"helper","text":"i looooove this!  i really do.  when i read it, it feels like it is free of the extreme fear and has a measured sense of rationality.  i also really like that you are bringing your intention -your why- to it.  WHY you want to take good care of yourself.  again, it sounds like a lot of this fear and anxiety is coming from how much you do care.  i like that this new thought is choosing to focus on the love and care that you feel, and how will you choose to channel it.","time":1652866931000},{"user":"thinker","text":"Thank you :) I will use it then!","time":1652867483000},{"user":"helper","text":"how does it feel for you to hold this thought in your mind?  ","time":1652866992000},{"user":"thinker","text":"It feels good, I think I need time to accept it, but it will be beneficial to say the least. I should try using my imagination positvely and associate the thought with positivity and prosperity.","time":1652867551000},{"user":"helper","text":"i understand, it might take some practice, especially when we've been so used to thinking a different way.  the more you practice it, the easier it should get, and help to form new neural pathways -- one's that are easier on your health and your body and free of the feedback loop you've been feeling stuck in","time":1652867107000},{"user":"helper","text":"i like the idea of using your imagination with it","time":1652867117000},{"user":"thinker","text":"Thank you :) I will try my best.","time":1652867636000},{"user":"helper","text":"i encourage you to write it down & remember to practice it :)","time":1652867146000},{"user":"helper","text":"how are you feeling now, as compared to when we started?  It's okay it it's mixed feelings, just want to check in","time":1652867162000},{"user":"thinker","text":"I feel positive really, I woke up tired and not wanting to do much, but I tried to wear positivity and be optimistic of this session, it really helped me think things through.","time":1652867719000},{"user":"thinker","text":"You're empathy and ideas going back and forth helped me greatly.","time":1652867731000},{"user":"helper","text":"i'm really glad to hear it.  i was grateful to hear about your experience too, and hear how positive it's been for you having a new baby.  thank you for sharing all of that :)  ","time":1652867280000},{"user":"helper","text":"is there anything else that you need in order to feel complete before we close?","time":1652867295000},{"user":"thinker","text":"I'm complete, for now haha, I need much more work on other things but overall, its a giant step forward. I will adopt this thought and see how it works with my life.","time":1652867852000},{"user":"helper","text":"i'm glad to hear.  i'm sure at times, some of the scary feelings might come up again, but if you can, try to redirect yourself to this thought you've created in those moments!  we are all done for today.  ","time":1652867399000},{"user":"thinker","text":"Will do, and thank you very much for your precious time! I hope you have a good and safe delivery. And live long and prosper :)","time":1652867930000},{"user":"helper","text":"thankyou so much for the kind wishes -- they are much appreciated!  if you would like to come back in the future to talk about anything, you are welcome to do so.  take care & wishing you lots of health and prosperity as well!","time":1652867463000},{"user":"thinker","text":"will do, thank you very much! :)","time":1652867976000},{"user":"thinker","text":"Sorry, but if I want to talk, do i come to this page? or book a different appointment? And would you like me to answer a survey, its been very good to talk?","time":1652868064000},{"user":"helper","text":"Hi again! I hope it's not too late for you to receive this. If you would like to talk again, you can schedule another appointment on the home page. If you would like to request the same helper, you can reference this session in your opening statements. ","time":1652888818000},{"user":"helper","text":"As for a survey, that would actually be greatly appreciated! I'll leave a few questions here which you can reply to when you have time. ","time":1652888834000},{"user":"helper","text":"Select all that apply:\na. I felt heard and understood\nb. I have a better understanding of myself (thoughts, feelings, behavior)\nc. I have a new thought that feels true to me\nd. I would recommend this service to others\ne. I believe this new thought will work and positively change my behavior","time":1652897180000},{"user":"helper","text":"How would you rate your helper? (1 is unhelpful, 5 is great)","time":1652897192000},{"user":"helper","text":"How would you rate the session overall? (1 is unhelpful, 5 is enlightening)","time":1652897201000},{"user":"helper","text":"How much would you pay for this session?","time":1652897209000},{"user":"helper","text":"And finally, Would you be open to making this session public so others with similar trouble to you can learn from this experience? ","time":1652897254000},{"user":"helper","text":"Thank you!","time":1652897257000},{"user":"thinker","text":"a, b, c, d, e all apply to me","time":1653173677000},{"user":"thinker","text":"My helper was great (5)","time":1653173692000},{"user":"thinker","text":"i would rate it at a (4). It was very good to be heard and talked through my own feelings. Its also amazing to have a positive outcome from one session, so its pretty good. ","time":1653173796000},{"user":"thinker","text":"I feel that I would pay 90 USD per session especially if we could get the same helper who would me more familiar with our cheese   ","time":1653173903000},{"user":"thinker","text":"I don’t mind sharing it if we can remove private bits from it :)","time":1653173962000},{"user":"thinker","text":"thank you!","time":1653173966000},{"user":"helper","text":"Thank you so much for sharing! I'm glad to hear you had a positive experience with us. I know sharing can be a vulnerable experience, and we can certainly remove anything which could identify you or feels too private to expose. Would you be open to giving me some time stamps and/or quotes of that which you would like to be removed from the final version? ","time":1653333381000},{"user":"helper","text":"Of course, it feels a little more complicated than that, don't worry. We can leave it as is. I want to be sure you're comfortable. ","time":1653333438000},{"user":"thinker","text":"Actually, after looking through the chat I think its alright to share :) so you have the okay from me!","time":1653339565000},{"user":"helper","text":"Wonderful, thank you! It really helps us to show the world what we do, and help even more people. ","time":1653340851000}]}