{"notes":{"feelings":"worried\ndoubt\nunmotivated\nwonder: will goals ever make happiness","thought":"- My goals are wrong.\n  - Everything I've been doing and what I have left to accomplish could be wrong.\n\n- I have to make a decision to change\n- I could make the wrong decision. Is this just a hiccup, or is a real change necessary?\n\n\"Will my goals ever make me happy as these moments of break?\"","event":"Feel happy when taking a break from goals","behaviors":"- Taking more breaks\n- Delaying progress towards goals","labels":{"black-or-white-thinking":true,"blaming":true,"fortune-telling":true},"new_thought":"this yarn of feelings can flow, so I can feel them all as I go, and bring them together to find alignment and connection, and create a beautiful crocheted piece that is myself"},"messages":[{"user":"helper","text":"Hello, welcome to cheese. I hope I can help you today.","time":1682528528000},{"user":"thinker","text":"hi ","time":1682528561000},{"user":"thinker","text":"i am sorry ","time":1682528564000},{"user":"thinker","text":"thank you ","time":1682528567000},{"user":"thinker","text":"can i have a min to settle down real quick?","time":1682528584000},{"user":"helper","text":"Yes. I'm here whenever you're ready.","time":1682528586000},{"user":"thinker","text":"thank you so much ","time":1682528596000},{"user":"thinker","text":"i'll be quick ","time":1682528599000},{"user":"thinker","text":"i'm back ","time":1682528726000},{"user":"thinker","text":"thank  you ","time":1682528729000},{"user":"helper","text":"No problem.","time":1682528731000},{"user":"helper","text":"How are you feeling today?","time":1682528761000},{"user":"thinker","text":"i'm feeling calm today actually ","time":1682528798000},{"user":"helper","text":"Oh, that's nice. :)","time":1682528798000},{"user":"thinker","text":"yeah ","time":1682528808000},{"user":"helper","text":"How do you feel about having this buddy session, and being a thinker?","time":1682528818000},{"user":"thinker","text":"i'm feeling relaxed and hopeful about it ","time":1682528866000},{"user":"helper","text":"Good. What are you finding troubling in your life?","time":1682528882000},{"user":"thinker","text":"you know i was thinking a lot about how lately i have just been second guessing my goals in life and doubting whether what i have been working for so long is something that will make me deeply happy and align with my overall purpose in life ","time":1682529022000},{"user":"helper","text":"Wow, you know I have been feeling remarkably similar, myself. So this might be a specially-aligned session between the two of us. This crisis of meaning.","time":1682529039000},{"user":"thinker","text":"right ","time":1682529054000},{"user":"helper","text":"Second-guessing your goals, and doubting them, wondering if it's aligned with your deeper purpose and what you're living for.","time":1682529063000},{"user":"helper","text":"Asking what you're living for.","time":1682529069000},{"user":"helper","text":"I feel in this maybe a bit of somber melancholy. Are you feeling something in it particularly troubling?","time":1682529096000},{"user":"thinker","text":"hehe its funny that you ask its a little weird because its true it sounds very somber and melancholic but i almost feel that for the past and for what's gotten me to this point, because ironically i feel very happy and content with life in general but when thinking about all those things i said i do feel worried that is the prominent feeling ","time":1682529223000},{"user":"thinker","text":"am i making sense ","time":1682529226000},{"user":"helper","text":"Yeah... I feel the same way myself. Like it's beautiful spring outside, and I have enough food in my belly and other things seem good. But like... I've got this deep story in my life of a pursuit that ... maybe has been wrong. And redirecting myself is kinda troubling, like a deep wrong thing, isn't that troubling?","time":1682529283000},{"user":"thinker","text":"yess...yesss exactly that ","time":1682529295000},{"user":"thinker","text":"very very troubling ","time":1682529299000},{"user":"helper","text":"Yeah. So you've got a prominent feeling of worry— what do you think you are worried about?","time":1682529314000},{"user":"thinker","text":"i'm worried about my goals being wrong, changing and having to make a decision about it whether to continue a life long goal or not and being in that limbo of you know is this just a hiccup or are all these thoughts and feelings and this moment in life telling me something ","time":1682529438000},{"user":"thinker","text":"i'm worried about being wrong either way in terms of how continuing, pausing, and changing can be very very life changing mentally and physically in terms of existing ","time":1682529529000},{"user":"helper","text":"Yeah.","time":1682529533000},{"user":"thinker","text":"i want to do right my me in the past and right by me in the present and in that balancing i hope to do right by my future self ","time":1682529579000},{"user":"helper","text":"This is a big impactful life story of yours. This is a path you've been on for a while and have deeply invested in. And you have a future in which you want to deeply invest. Is that right?","time":1682529605000},{"user":"helper","text":"I can see how being worried about being wrong can make it really hard to make a decision. Like, if you think that you've made the wrong choice in the past — with the thought \"my goals are wrong\" — then you might think you could make the wrong choice now, and in the future as well.","time":1682529664000},{"user":"thinker","text":"sorry i lost internet for a second but yes on that first one ....","time":1682529674000},{"user":"thinker","text":"i'm reading the rest ","time":1682529685000},{"user":"thinker","text":"yesss to that second part too ","time":1682529720000},{"user":"thinker","text":"yeah its scary to think that i've made the wrong choice in the past too ","time":1682529747000},{"user":"helper","text":"That makes total sense. If I were to guess, I'd say that you have a deep care for the meaning in your life, for where you are developing competence and what you are contributing to. You want a good sense of purpose, and perhaps value your creativity. Does any of that connect?","time":1682529816000},{"user":"thinker","text":"it truly does","time":1682529826000},{"user":"helper","text":"Ok. Well, I am getting a picture of you as someone caring about this so deeply that you are finding deep questions about your choices, which are (perhaps errantly) causing you to question your own self and your decisions and your ability to make decisions, when you think \"my goals are wrong\" it could translate into \"I made wrong decisions\" and maybe a concern of something being wrong with you, which could feel very troubling, and cause you to have fear in making decisions in the future.","time":1682529914000},{"user":"helper","text":"Yet, you are in a place where you are refining your understanding of your purpose, because it is something you care about, and want to care for well, and this is good work that you are doing, and also hard work.","time":1682529942000},{"user":"thinker","text":"that feels very true ","time":1682530044000},{"user":"thinker","text":"i love the part of \"refining my understanding\" rather than something drastic like redefining or changing hehe ","time":1682530089000},{"user":"helper","text":"Nice. :)","time":1682530094000},{"user":"helper","text":"Ok, so let's flesh out more of the picture here. We've got a few troubling thoughts: \"My goals are wrong.\" and \"I have to make a decision to change,  but is this just a hiccup, or is a real change necessary?\" and \"I could make the wrong decision.\" What is most troubling about all of this now?","time":1682530162000},{"user":"helper","text":"We've noticed the prominent worry that you're experiencing.","time":1682530185000},{"user":"thinker","text":"ok ... hmm ... those most troubling worry is that my goals are wrong !!! ","time":1682530224000},{"user":"thinker","text":"that one hits more deeply because it affects everything i've been doing up till now and what yet left to finish to accomplish that -- it questions everything i've done and everything i've been working for and continue to do and all the things i need to work harder to get to that particular finish line!!! as well as a lot of things i jeopardize/lose/sacrifice to also get there ","time":1682530372000},{"user":"helper","text":"That makes total sense. You're concerned that your goals are wrong, and thus everything you've been doing and have left to accomplish could be wrong.","time":1682530395000},{"user":"thinker","text":"exactly ","time":1682530403000},{"user":"helper","text":"That's a big trouble dude.","time":1682530409000},{"user":"thinker","text":"i knoooowww ","time":1682530415000},{"user":"helper","text":"Yeah.","time":1682530420000},{"user":"helper","text":"What triggered you starting to think that your goals are wrong/","time":1682530430000},{"user":"helper","text":"?","time":1682530434000},{"user":"helper","text":"What happened immediately before you started thinking this?","time":1682530445000},{"user":"thinker","text":"yesterday actually pushed this right to the surface ","time":1682530472000},{"user":"helper","text":"Ok.","time":1682530477000},{"user":"thinker","text":"so all the things, work, and steps i have left make it daunting for sure and so the thought was always there, but yesterday i had such a spontaneous and exciting day and i genuinely felt very happy and it had me question everything ","time":1682530566000},{"user":"thinker","text":"but also because i've had more of those days and its always or i shouldn't say always but its often when I'm either taking a break from my goal per say ","time":1682530626000},{"user":"helper","text":"When you're taking a break is when you thought \"my goals are wrong?\" What happened yesterday that led you to think your goals are wrong?","time":1682530645000},{"user":"thinker","text":"yeah when i take those breaks and i get those feelings of pure happiness i would say ","time":1682530705000},{"user":"helper","text":"Oh, so when you feel the happiness, you think your goals are wrong? Because you're feeling happier when you are not working on your goals?","time":1682530725000},{"user":"thinker","text":"yeah saying it now it almost feels like or i want to compare it to what i imagine it would be to take drugs or opioids for relief and it sounds like an addiction away from my goals but really its just life and living ","time":1682530821000},{"user":"helper","text":"Hm, so like, the idea of taking a break feels like a dirty habit?","time":1682530868000},{"user":"helper","text":"Or like an escape from reality?","time":1682530874000},{"user":"thinker","text":"yeah that too hmm well i don't know now ","time":1682530896000},{"user":"helper","text":"I think I'm seeing what you're saying. Like, your breaks have been making you happy, and then you feel troubled by this, because in the break, you're not pursuing your goals. And it's a weird ambivalence, because you're happy in those times, but being happy not doing your goals leads you to think your goals are wrong.","time":1682530943000},{"user":"thinker","text":"yes and i wonder if my goals and the end of it will ever make me as happy as these moments of break ","time":1682531003000},{"user":"helper","text":"Mmmm yes.","time":1682531006000},{"user":"thinker","text":"and is it even not worth it but if being happy is important to me and that is not reached at the end will i have made the wrong decision all my life ","time":1682531078000},{"user":"thinker","text":"and back to square one haha ","time":1682531090000},{"user":"helper","text":"Mmm. There might be an underlying assumption here that you will find happiness at the end of the goal-bow.","time":1682531111000},{"user":"helper","text":"Whereas happiness can also be found in the journey itself.","time":1682531123000},{"user":"thinker","text":"go ahead... uuu that's interesting yess partly ","time":1682531138000},{"user":"thinker","text":"i am enjoying the journey but that is true i do assume there will be like an extra dose of happiness at the end ","time":1682531174000},{"user":"helper","text":"Yes, and I think that is often true, when we accomplish our goals we can get satisfaction, and that can be a factor in happiness.","time":1682531192000},{"user":"thinker","text":"but really its the last little thing and the most joy is everything that happened to get there ","time":1682531216000},{"user":"thinker","text":"right perhaps hehe ","time":1682531226000},{"user":"helper","text":"Perhaps so. And I also am present with many facets of happiness, here, like when you take a break, I imagine you getting happiness from the little things in living, like the weather, or eating, or perhaps talking with friends, or other little things.","time":1682531249000},{"user":"helper","text":"These can be meeting different needs than the deep purpose.","time":1682531264000},{"user":"helper","text":"Also, even if there is or is not happiness at the end of the goal-bow, the journey along the way will be more satisfying when there is a purpose that you believe in during the process.","time":1682531286000},{"user":"helper","text":"It sounds like you are doubting your goals, which could be leading you to doubt the purpose.","time":1682531300000},{"user":"thinker","text":"mmm yeah ","time":1682531315000},{"user":"helper","text":"I hear a desire for alignment, perhaps with harmony in your life between your feelings and your purpose.","time":1682531354000},{"user":"thinker","text":"there is definitely a small disconnect there ","time":1682531388000},{"user":"helper","text":"Ok. So let's summarize what's happening. You are noticing that when you take a break from pursuing your goals, that you are happy. It almost occurs to you like having an addictive habit (the break) which perhaps feels guilty, but the main thought resulting is \"My goals are wrong.\" This is deeply troubling, even while you have some happiness, because it could imply that everything you've been doing and what you have left to accomplish could be wrong. You think that you need to make a decision here — but are concerned that your decision itself could be wrong! You sit in this state of worry, and doubt, and are wondering whether your goals will ever make you happy. When you are feeling that worry, doubt, and wonder, what actions are you taking or not taking?","time":1682531541000},{"user":"thinker","text":"i'm definitely taking more of those breaks lately or i should say for a while now and i am delaying the progress towards my goals ","time":1682531625000},{"user":"thinker","text":"its also been difficult to be motivated when working towards my goal because the feelings during the process are not as thrilling as those breaks ","time":1682531689000},{"user":"helper","text":"Mmm, yes.","time":1682531711000},{"user":"helper","text":"That makes total sense when you are doubting your deep goals that have been the reason for all this work and investment, that you've invested a lot of your life into, and have further plans to invest into, that doubting those goals would lead you to feel unmotivated. And in that lack of motivation, you could be taking more breaks. Of course! And that could feel like an addiction, because it's a cycle that encourages more of itself.","time":1682531768000},{"user":"helper","text":"Wow, I could imagine that this pattern of thought could just be creating more of itself.","time":1682531784000},{"user":"thinker","text":"damn you hit it ","time":1682531784000},{"user":"helper","text":"This is interesting.","time":1682531793000},{"user":"thinker","text":"what is?? ","time":1682531800000},{"user":"helper","text":"Well, it seems here that your interpretation of the happiness during breaks, and the doubt, is leading to more breaks, which is leading to more of the doubt...","time":1682531838000},{"user":"thinker","text":"right...","time":1682531840000},{"user":"helper","text":"And in the middle of this, you have unknown, and wonder.","time":1682531850000},{"user":"helper","text":"You don't know if you want to continue your goals, or revise them.","time":1682531861000},{"user":"helper","text":"Or change them completely.","time":1682531864000},{"user":"helper","text":"So let's look at some cheeses.","time":1682531872000},{"user":"helper","text":"The thought that \"my goals are wrong\" is pretty black and white. It could be, like we said before, something that could use a little revision. Maybe you have some other need to get met that breaks are giving you, and that's making you happy because you're meeting the need, and maybe the goals themselves aren't totally wrong.","time":1682531910000},{"user":"helper","text":"But when you think they are wrong, just flat out wrong, and these are deep goals, then that has some deep implications and is rippling through other thoughts and consequences.","time":1682531935000},{"user":"helper","text":"One is that you are doubting yourself, and perhaps your ability to make choices. You didn't say this explicitly, but I suspect that when you think your goals are wrong, you could put some negative energy onto your own decision-making — blaming yourself. A blaming thought is assuming you are responsible for the err you see in your choice of goals, when perhaps what is happening is something that was outside of your control, and doesn't need to map onto you as a person.","time":1682531997000},{"user":"helper","text":"But when you do consider yourself as making an error, you might not trust yourself in making decisions again, and thus you are frozen in indecision about what to do next, thinking you might make another error in goals. This is a fortune telling thought, where you are focusing on making the wrong decision again, and in that fear and anxiety, it's easy to avoid facing the decision, which could lead to taking more breaks, and not responding to the present. And it's in the present moment where you can inspect your feelings in the breaks, and see how they align to your goals and your purpose.","time":1682532084000},{"user":"helper","text":"In the end, I hear you wanting alignment, with your goals, and your feelings. This is a beautiful thing to want, and I admire people who have that. They make the world better, because they act with integrity and passion and are easy to be around, making an aura of clarity for the people they are with, and I want to support you in having that.","time":1682532133000},{"user":"helper","text":"To get there, I could imagine being present with your feelings of happiness when taking breaks, and also present with the feelings and reasons you expected your chosen purpose and goals to bring you, could help you discern whether your goals are or are not aligned with your happiness.","time":1682532191000},{"user":"helper","text":"I just wrote a lot. Is anything there amiss? Does anything come up for you in that?","time":1682532217000},{"user":"thinker","text":"you did but i was absorbing all that slowly as you were putting it all together ","time":1682532274000},{"user":"thinker","text":"and it was very very helpful ","time":1682532282000},{"user":"helper","text":":)","time":1682532332000},{"user":"thinker","text":"\"being present\" is something that sticks out the most ","time":1682532341000},{"user":"helper","text":"Mm, yes.","time":1682532348000},{"user":"thinker","text":"especially will help to live more profoundly but shift away from that state i have put myself in between breaks/happiness and my goals, i've created a teeter totter between the two and \"being present\" will help ","time":1682532479000},{"user":"helper","text":"Mmmm Yes!! That is black / white itself.","time":1682532483000},{"user":"thinker","text":"oh no ","time":1682532484000},{"user":"helper","text":"And the black/whiteness is between present and future.","time":1682532491000},{"user":"helper","text":"I think you distilled that down really well.","time":1682532495000},{"user":"helper","text":"You are on a teeter totter between experiencing happiness about present breaks, and unmotivation about future goals.","time":1682532517000},{"user":"thinker","text":"yesss ","time":1682532531000},{"user":"helper","text":"Hmm... I don't know exactly what to make of that, but it seems very poetic itself.","time":1682532542000},{"user":"helper","text":"But I do know what to make of our session. The next step is to ask for a new thought. So let's get you into that mindset of feeling happy when you take a break from your goals... what is a new thought that you can think to yourself in this place? Perhaps something bringing you closer to finding alignment with a deep purpose?","time":1682532604000},{"user":"helper","text":"(Or whatever value is calling to you.)","time":1682532615000},{"user":"thinker","text":"hehe ok let me give it a go...","time":1682532628000},{"user":"thinker","text":"i was just sort of meditating there for a moment and when i thought about alignment and closed my eyes i felt calm and at peace with my thoughts i was very much present .... so ","time":1682532755000},{"user":"helper","text":"!!","time":1682532757000},{"user":"helper","text":"\"alignment\" is a thought that is bringing you calm and peace and presence.","time":1682532866000},{"user":"thinker","text":"yes ","time":1682532877000},{"user":"helper","text":"That sounds different than worry and doubt and ... what about unmotivation?","time":1682532891000},{"user":"thinker","text":"uuu ","time":1682532911000},{"user":"thinker","text":"moving forward i'd love to not redefine my motivation and allow myself to feel those emotions i associate with being unmotivated but not let it sway me ","time":1682533032000},{"user":"helper","text":"mmm.... !! That feels cool. You can feel the feelings you experience with the unmotivation towards the goals, but there is a bigger goal here, one of understanding yourself and your feelings, and finding harmony with yourself and your goals.","time":1682533065000},{"user":"thinker","text":"boom yes ","time":1682533069000},{"user":"helper","text":"And that is something you can always be motivated by.","time":1682533073000},{"user":"thinker","text":"i couldn't put it into words but i was feeling all that ","time":1682533091000},{"user":"helper","text":"Yeah, that's really interesting. That's also a goal that you can have faith in.","time":1682533104000},{"user":"helper","text":"It's not all your goals that are wrong.","time":1682533111000},{"user":"thinker","text":"yeah there's just a disconnect between everything ","time":1682533141000},{"user":"thinker","text":"and that is partly coming from my disconnect with all my feelings and stages ","time":1682533181000},{"user":"helper","text":"Yes! Connection.","time":1682533187000},{"user":"helper","text":"Taking a break is disconnecting.","time":1682533196000},{"user":"thinker","text":"woah yes ","time":1682533206000},{"user":"helper","text":"Thinking your goals are wrong is saying \"that part of me is wrong\" and creating more disconnection.","time":1682533214000},{"user":"thinker","text":"!!!!! ","time":1682533220000},{"user":"helper","text":"\"Hmm, this is curious. Let me connect the feelings I'm having on this break to my conception of my goals, and the feeling I have while pursuing them.\"","time":1682533262000},{"user":"helper","text":"Being present with the feelings can help connect you back together.","time":1682533277000},{"user":"helper","text":"What's a thought that you think you can have the next time you are feeling happy while taking a break?","time":1682533294000},{"user":"helper","text":"It sounds like you're going to be more present, and connected.","time":1682533340000},{"user":"thinker","text":"yesss ","time":1682533343000},{"user":"thinker","text":"for a new thought i'd like to perhaps use a metaphor ... connecting had me thinking of crocheting and perhaps yarn being all my feelings in different situations and letting them flow and feeling them as i go and brining them together to find that alignment and connection and create a beautiful piece ","time":1682533473000},{"user":"helper","text":"That is beautiful!","time":1682533476000},{"user":"helper","text":"So, when you are taking a break and feeling happiness, you can think \"this yarn of feelings can flow, so I can feel them all as I go, and bring them together to find alignment and connection, and create a beautiful crocheted piece that is myself\"","time":1682533536000},{"user":"thinker","text":"uff yes ","time":1682533544000},{"user":"thinker","text":"i like it a lot ","time":1682533548000},{"user":"thinker","text":"thank you ","time":1682533553000},{"user":"helper","text":"I like it too. You did a great job today.","time":1682533562000},{"user":"helper","text":"How do you feel when you think this new thought?","time":1682533569000},{"user":"thinker","text":"it makes me happy ","time":1682533576000},{"user":"helper","text":":)","time":1682533578000},{"user":"helper","text":"When you think this, and feel that happiness, what actions come up for you?","time":1682533588000},{"user":"thinker","text":"i feel motivated ","time":1682533599000},{"user":"thinker","text":"to feel to do  to act ","time":1682533603000},{"user":"helper","text":"Motivated! To feel do and act!","time":1682533609000},{"user":"helper","text":"You are moving and grooving into integrating yourself into a beautiful piece!","time":1682533620000},{"user":"thinker","text":"can't wait to see it ","time":1682533628000},{"user":"helper","text":"Very good.","time":1682533628000},{"user":"helper","text":"Me too. (In my dreams, I suppose, since I don't know who you are, or if I'll ever talk to you again.)","time":1682533644000},{"user":"thinker","text":"hehe right ","time":1682533654000},{"user":"thinker","text":"(we are always left with that at the end)","time":1682533670000},{"user":"helper","text":"Yes.","time":1682533674000},{"user":"helper","text":"Ok, well you are done! What do you think about this session being viewable by the public?","time":1682533689000},{"user":"thinker","text":"i'm comfortable with that ","time":1682533694000},{"user":"thinker","text":"no problem ","time":1682533699000},{"user":"helper","text":"Okay, thank you thinker. I think other people will benefit from reading it.","time":1682533709000},{"user":"helper","text":"Thank you very much for sharing yourself and earnestly working to become a more beautiful piece of art today!","time":1682533723000},{"user":"thinker","text":"thank you for going through this with me today and being so patient and helpful ","time":1682533750000},{"user":"helper","text":"<3","time":1682533755000},{"user":"thinker","text":"you are a wonderful helper !!!","time":1682533769000}]}