{"notes":{"event":"Had an argument with my father and his wife--he apologized but did not offer an explanation","feelings":"Angry\nUpset\nconfused\nhurt\ndefensive\nscared","thought":"A pattern of behavior with them is unhealthy for me\n\nShe unwillingly put him up to this, she put the thought (we are taking advantage of him) in his head\n\nShe has taken advantage and stolen my father away for her sons -- then projects the guilt onto his relationship with my kids\n\nHe wishes I had not been born, that I am a burden\n\nthis darkness, confusion and division is creeping and stalking humanity, my family, our society, our civilization, more and more of late. ","behaviors":"\"sickeningly loyal\"\nhyper-vigilant","labels":{"should-statement":true,"mind-reading":true,"blaming":true},"new_thought":"It's okay, you don't have to be afraid. There is more going on under the surface that you may not understand right now but what we do know is I love my family and my family loves me and this will bring us together again through all that goes on around us\""},"messages":[{"user":"thinker","text":"I had an argument with my father and his wife this past Sunday. this doesn't happen often, however, now I see a pattern of behavior with them that is unhealthy for me. And the argument is disturbing my peace of mind, I am angry and upset days later.","time":1631116963000},{"user":"helper","text":"Hello, thank you for joining me here. I am running a little bit late today, do you mind if we start half an hour past?","time":1631123132000},{"user":"thinker","text":"ok yes that's fine","time":1631123798000},{"user":"helper","text":"Great, thank you! See you in half an hour ","time":1631124034000},{"user":"helper","text":"Hello again, I appreciate the extra time. I see here that you are angry and upset days after an argument with your father and his wife that disturbed your peace of mind. I imagine that's really uncomfortable, especially as you've had some time to recover and it seems to be still sitting and causing turmoil. Can you tell me a little more about this disruption?","time":1631125872000},{"user":"thinker","text":"We had a conversation last wednesday, a week ago. I asked if I could bring my daughters (2 ages 20 and 27) to his house to do laundry, and spend time together the coming Sunday( this just past). At first he said no. it was akward. I thought maybe it was because his wife didn't want us to come. i couldn't tell as it was a phone call with me on speaker with his wife there. they seemed to be having a conversation in the back ground but non verbal perhaps. hard to tell as it was just awkard. He said no, that wouldnt be a good idea. I said ok, no worries, I would bring the girls to the laundrymat by there house. and we can visit another time.  ","time":1631126069000},{"user":"thinker","text":"and then he changed his mind.","time":1631126081000},{"user":"thinker","text":"so we agreed i would bring the girls and we concluded our phone call. then on sunday when we got there, he was acting strangely and before long my elder daughter said - grandad, what's wrong - are you ok?","time":1631126138000},{"user":"thinker","text":"and he said no, im not ok. im upset. and we said what's going on? and he said he felt taken advantage of by my girls and I. and I asked in what capacity did he feel taken advantage of? and he said because we had come to do the laundry there.","time":1631126198000},{"user":"thinker","text":"i got upset, angry, confused. I said dad - you said it was ok for us to come. ","time":1631126229000},{"user":"thinker","text":"Why are you ambushing us with this now? We were stuck in traffic for 2 hours to get here - we could have gone somewhere close to home. this is not acceptable to me.","time":1631126264000},{"user":"thinker","text":"my elder daughter was also taken aback. we argued about it for about 25-30 minutes, culminating with my daughter in tears, me in a very angry mood and no explanation. he then apologized. ","time":1631126322000},{"user":"thinker","text":"but did not offer an explanation. his wife muddy","time":1631126337000},{"user":"thinker","text":"'d the waters a bit by trying to change the subject -which made me feel more hyper vigilant and more angry - i thought that she had unwillingly put him up to this - and that he couldn't explain why he felt taken advantage of because she had put that thought in his head.","time":1631126403000},{"user":"thinker","text":"or he was having a neurological break due to old age and ongoing issues with bladder infection and onset dementia","time":1631126436000},{"user":"thinker","text":"or he was testing me to see if I would get angry if he inexplicably and chaotically changed direction and plans. suffice to say - it's very confusing and hurtful to be accused of a betrayal in this way - my daughters and me both - by a beloved parent and grandparent","time":1631126533000},{"user":"helper","text":"That sounds very confusing! I can see why you have these intense emotions of betrayal and frustration, and anger. it seems a grandparent who is usually kind and excited to be with his family abruptly turned the tables on you wishing you weren't there and you cannot find any logical reason except perhaps his wife if not dementia. You and your daughters were hurt, and since then you have been trying to find some reason this could have happened, and why it's left you feeling the way it has. Am I understanding correctly?","time":1631126685000},{"user":"thinker","text":"that is right on track yes","time":1631126697000},{"user":"thinker","text":"like i wonder if he is thinking we are taking advantage of them - is it because she thinks that. reason i suspect this is because here sons, both grown, have not had children. and seem unlikely to, and she laments and grieves not becoming a grandmother. and she compensates for my father leaving my mother and my sister and me 40 years ago for her - saying things like - your father did not pay for my sons college education. as if that could make up for the time i lost when he left. and i see this possible projection on her part, of her taking advantage, stealing my father away for her sons, then in the lonlieness of denied grandparentage she projects that guilt onto my fathers relatoinship with me and my kids.","time":1631126892000},{"user":"thinker","text":"or - he doesn't want us to use his washer and dryer. or she doesn't, or they both don't and yet they feel guilty becasuse they know that is selfish and alienating.","time":1631126979000},{"user":"thinker","text":"in any case - i am feeling way too open hearted and willing to try and understand, make excuses for bad behavior, and i would like to close down my empathic / compassionate ways and disengage from the relationship - if any friend or acquaintance did this - i would not be so confused - i'd of thought - wow - this person is fucked up in the head and i would do well to stay away from them - it's like dealing with a paranoid drug addict type.","time":1631127090000},{"user":"thinker","text":"yet i am sickeningly loyal because it's my father i guess.","time":1631127115000},{"user":"helper","text":"I'm going to take a moment to read and understand, I can see there is a lot going on here and I want to be sure I hear you fully","time":1631127157000},{"user":"thinker","text":"thank you","time":1631127163000},{"user":"helper","text":"We do have a loyalty that goes deeper, unquestioningly so, when it comes to family","time":1631127255000},{"user":"helper","text":"I think often that is a beautiful thing, to stand by them no matter their flaws and limitations, but of course as you said if anyone else did something like this you would leave them much faster, because at the end of the day you feel hurt and betrayed and it's important to put your emotional health first","time":1631127315000},{"user":"helper","text":"It seems to me part of what is most troubling here is yearning for a reason he could have acted this way, to make sense of it all. He didn't give you one, and so you are abounding with theories that could explain the sudden outburst, and the root of his new thought \"I'm being taken advantage of\" Which to you came out of the blue","time":1631127378000},{"user":"helper","text":"Is this confusion partly what makes you feel upset and angry? ","time":1631127404000},{"user":"thinker","text":"yes - i feel there is a pattern of behavior here where the final reckoning of his behavior, in conjunction with his 2nd wife, after leaving my mother, sister and me, shows a design on his part towards wishing i would not have been born - that I am a burden. i do not think these types of thoughts on my own, but only in the wake of his behavior in moments like the one described above, which to be fair, happen infrequently. which only makes them stand out more and triggers my hypervigilent behavior.","time":1631127598000},{"user":"helper","text":"oh, that is a very scary thing to think of your father!","time":1631127620000},{"user":"helper","text":"He left your mother and you 40 years ago, and for the most part seems to be glad to be part of your life, but occasionally when he lashes out in ways such as this you revert back to the very vulnerable thought that perhaps he wishes you did not exist, or your children, and this is deeply painful making you want to close off your empathy and protect yourself and your children","time":1631127701000},{"user":"thinker","text":"yes i think this really gets towards the center of the issues I am experiencing right now.","time":1631127726000},{"user":"helper","text":"I can understand that... I'm sorry to hear that you are experiencing this pain. It is a difficult thing to experience divorce, at any age, but especially when you are young that 'betrayal' of sorts can linger and come out in unexpected ways. Such as now, when you are trying so hard to find any reason to explain his behavior asides the one that hurts the most. When this excuses for him fail to reach the heart of it, such as \"He just doesn't want us to use his laundry\" or, \"she put the thought in his head\" Then you are left alone with the most painful reason of all, that he is burdened by you, so this leaved you feeling angry upset and confused...","time":1631127881000},{"user":"helper","text":"I am wondering, when you experience these hurt emotions, what actions do you take or not take?","time":1631127904000},{"user":"thinker","text":"great question - i am not sure what to do. lately - since covid and after lockdown last year - it's hard to get motivated to do things i used to enjoy and maybe took for granted in hindsight. like i used to go to yoga class everyday. sometimes twice a day. made every problem like this much more manageable looking back now.","time":1631128016000},{"user":"thinker","text":"I sent a text to my father and his wife. i apologized for losing my temper, and asked that he tell me more about his feelings of being taken advantage of. and then i mentioned looking forward to getting this past us. they replied - but it was as if his apology at the moment of never happened. and that all that was left to excoriate was my behavior - disturbing and scary behavior. which i again see as a projection. i am hyper defensive about this. i can't stand being gas-lit as i have been in numerous relationships where that was normalized and expected to play along.","time":1631128302000},{"user":"thinker","text":"so it happening now with my dad, in the context of the pandemic, or climate disaster or other chicken little the sky is falling anxiety is a bit more paralyzing than in previous memories of similar situations.","time":1631128369000},{"user":"helper","text":"I hear your, it has proven to be much more difficult to find our usual outlets for peace in these times... I'm glad you reached out, and that together you both look forward to moving forward, but it seems his apology was unsatisfying. Tell me, what are these behaviors that are disturbing and scary to you, the one that surface when you are feeling defensive?","time":1631128463000},{"user":"thinker","text":"do you mean the behaviors of mine that are disturbing?","time":1631128511000},{"user":"helper","text":"yes","time":1631128553000},{"user":"helper","text":"When I asked how you act or don't act, in a way that is referencing to how you behave when immediately reacting to these difficult emotions, and I think you alluded to that in your last comments","time":1631128595000},{"user":"thinker","text":"sure - when i get angry it's because i am scared.","time":1631128604000},{"user":"thinker","text":"when i get angry at people i love and trust - its because in my view, they are acting inconsistently with my judgement of them being deserving of that love and trust - and its not lost on me that my father was also expressing this same type of hyper vigilance.","time":1631128692000},{"user":"thinker","text":"he felt or at least said we were taking advantage of him - something i would objectively view (were it true) of my daughters and I not being deserving of his love or trust.","time":1631128744000},{"user":"helper","text":"That's very interesting...","time":1631128753000},{"user":"thinker","text":"I also reacted with the same emotional judgement - oh dad you are unaccountably accusing us of taking advantage of you when we are clearly not - you told me it was fine to come here to do laundry and you clearly lied about it or else you wouldn't be upset this way. so you are picking a fight with me over nothing - i don't trust you and you are not deserving of my love or trust as a result. birds of a feather.","time":1631128846000},{"user":"helper","text":"yes... and the cycle repeats, both parties feeling misunderstood and betrayed..","time":1631128869000},{"user":"helper","text":"It's really impressive that you can see how he might be feeling, even when so immersed in your feelings yourself","time":1631128895000},{"user":"helper","text":"I can see how you value family, and your connection with your father, you don't only want to feel better for yourself but also for him and your children and that is very admirable","time":1631128933000},{"user":"thinker","text":"thats kind of you to say but i only want everyone to get along because it's only when we all are in peace and harmony that healthy human capability can begin to be revealed.","time":1631128989000},{"user":"helper","text":"That is a good reason to want peace and harmony, it doesn't lessen the desire with impure motivation in any way","time":1631129025000},{"user":"helper","text":":)","time":1631129026000},{"user":"thinker","text":"cooperation and trust are becoming more and more challenging to maintain across many channels and relationships in my life - maybe it's just in the news more that people are afraid - carrying guns in texas or that elections are being stolen or that vaccines are a hidden plot to hurt people, etc - the hyper vigilance seems to be increasing in volume and complexity and frequency. I want to rise above that and calm and soothe it with love, togetherness, common domesticity and kindness and peace. ","time":1631129134000},{"user":"helper","text":" Yes.. beautifully put. Inspiring to think of it on a grander scale, the world and the people in it are struggling. We do what we can.. and when times like this come up, and our closest connections seems frayed, it becomes that much harder to bear the weight surrounding us","time":1631129198000},{"user":"helper","text":"I'm going to take a moment to summarize what you've shared with me so far and see if we can unravel the troubling and find some new perspective, if you're ready?","time":1631129222000},{"user":"thinker","text":"ok yes","time":1631129223000},{"user":"helper","text":"This past Sunday you went to your fathers house with your daughters to do laundry. He had said it was okay (after some tension) but when you arrive it was apparent that he was not okay. After some digging, he said \"I feel taken advantage of\" and you had an argument since this seemed so completely out of left field, after all you were there to spend time with family, not to use him. He offered no explanation for his sudden change of behavior. His wife was there and did not make things easier and you began to have thoughts searching for a reason that he could act or feel this way. You thought \"She put this thought in his head\", \"She has taken advantage of him and is projecting that guilt by making him think is us\" because it seems there is no way he could have invented this thought and caused all this trouble as the grandfather he normally is. But then you also have a deeply troubling thought that perhaps he is acting this way because ultimately he \"Wishes I had not been born, that I am a burden\" These thoughts vary from frustrating and confusing to intensely scary and you feel hurt, betrayed, and defensive. When you feel this way you become hyper-vigilant and act out in your anger, (a behavior you've actually seen repeated in your father as well). This makes it difficult to connect the lines in your family and relationships, which ultimately what you desire most, to maintain your strong connections in order to foster strong human capability in those around you. ","time":1631129643000},{"user":"helper","text":"Am I understanding everything okay? Is anything missing or feeling untrue to you?","time":1631129656000},{"user":"thinker","text":"this is all very accurate yes. ","time":1631129722000},{"user":"helper","text":"Good, I'm glad I hear you. There are many layers here and multiple angles we could take from this point forward to find some healing. I am wondering, what is *most* troubling to you today? I have written some thoughts on the right, feel free to choose from these or if you like we can encapsulate the thought new here","time":1631129793000},{"user":"thinker","text":"these are part of it - also i guess we can add something like this - there is darkness and confusion and division creeping into humanity's communal and co-operative experience right now - and it found it's way into my family of origin over a seemingly needless misunderstanding regarding my kids doing thier laundry at the grandparents house, making the grandparent feel taken advantage of. this darkness, confusion and division is creeping and stalking humanity, my family, our society, our civilization, more and more of late. or at least it feels this way now to me more than it did before this event. i have a discussion with my girlfriend that is ongoing since the pandemic began, and it grew more poignant when the election cycle and the BLM #metoo and qanon movements began to pick up steam in pop culture and social media last year. the idea is that the world is going crazier and crazier out there in the world. at least the clickbait for proof of this is there. however - we need to calm ourselves and become more crisis competent and move capable of compassion and love for any one who is scared, angry, upset and lashing out emotionally. i still believe in this hopeful direction - however - if people are going to keep testing the limits of what is acceptable for human interaction - i guess i need to draw the line somewhere and just turn towards those i can help. and if i can't help - i need to shut up and sit down and not act as if i have been wronged worse than them in some shouting match about who is the bigger victim or who is more outraged or who has more righteous indignation or vindicate-able rage. ","time":1631130304000},{"user":"thinker","text":"and unfortunately i did just this - acted more outraged than my dad was in order to win the argument.","time":1631130401000},{"user":"helper","text":"It is easy to slip into bigger and more righteous outrage in any argument, because the alternative is 'losing' and nobody likes to lose... I see now you've already stepped outside the basic perimeter of what you were fighting about and realized that the hurt and betrayal may be sourced from a much larger issue than where to do laundry","time":1631130485000},{"user":"helper","text":"I am noticing also a theme through all of this that must be a reason he was so upset that you were there, but of course you don't have all the details on hand, you cannot fully understand his dynamic with his wife nor his reaction the pandemic and all the other crazy stuff going on outside right now. Every one has handled things differently, some shut down, some lash out, some become hurt or overwhelmed by much smaller things than normal.. I see a pattern of thought here in your reaction to this experience which we actually have a 'cheese' for. Cheese is what we use to understand our thoughts better and externalize them. They are perfectly normal, but sometimes leave us feeling confused or bitter. ","time":1631130626000},{"user":"helper","text":"In this case, I see a couple.. the first I'd like to mention is 'should statements'","time":1631130643000},{"user":"helper","text":"You haven't used the word should outright, but I see your search for reason that you have an expectation that he should have acted a certain way, and since he did not there should be a reason","time":1631130682000},{"user":"helper","text":"When we use this thought pattern, and are hurt when the world outside is not behaving in the way it is supposed to, we quickly feel resentful and confused... you begin turning to explanations that actually hurt you further, such as wondering about his wifes manipulation of him, feeling that your family love and connection is out of your hands","time":1631130768000},{"user":"helper","text":"you even doubt that he wanted you at all... these should statements introduced you to another set of cheese called \"Mind reading\" which is to infer from someones behavior what their thoughts are. Someone else's mind is always inherently unknown, but when we begin to make assumptions it is easy to go down a path which will hurt us. You begin to feel angry and defensive based off these thoughts you think he or his wife are having, and your consequent feelings and behaviors can actually harm your communication making it difficult to reconcile, to hear him fully, and bring the family together again. This is what you ultimately want! Since I know you have mentioned wishing you could break away, at the end of the day you are loyal and in this disintegrating world family is one of the last pillars still standing. ","time":1631130958000},{"user":"helper","text":"Does this all make sense? I know there is a lot going on here but by recognizing where our thoughts are hurting us we can discard them and move forward :)","time":1631131076000},{"user":"helper","text":"haha!","time":1631131101000},{"user":"thinker","text":"yes - should statements and mind reading. i remember someone saying - stop \"shoulding\" all over me. say aloud for effect. funny but true.","time":1631131102000},{"user":"helper","text":"That is funny...","time":1631131111000},{"user":"helper","text":"David burn has a beautiful book, and one my favorite sayings is \"musterbation\"","time":1631131128000},{"user":"thinker","text":"and mind reading - oh wow - yes - that is impossible but i guess we try to infer based on evidence.","time":1631131129000},{"user":"helper","text":"It is necessary in a way, that we mind read... it is what we do all the time, to communicate verbally and non verbally. Of course we can never fully understand what is going on under someone elses skin but it only when we get stuck on negative assumptions that the mind reading technique goes to far","time":1631131193000},{"user":"helper","text":"especially when we get into screaming matches such as you mentioned, even if someone says things, it is possible and likely that is not what they mean. We grow further and further from the truth which will bring us together","time":1631131248000},{"user":"helper","text":"I have one more cheese which may help actually, that seems to be on the border of your experience here in your relationship with his wife","time":1631131285000},{"user":"helper","text":"I can see that you feel she is responsible for part of the health of your family relationships","time":1631131311000},{"user":"helper","text":"but by delegating that to her you lose some of the control yourself to feel welcoming and comfortable","time":1631131347000},{"user":"helper","text":"she is an outsider in your blood family, and may not know how to interact in everyone's best interest. This is frustrating! And it is even possible that she *did implant that thought in his head, but by wondering so the divide and the darkness which you had mentioned early only grows larger, leaves your feeling scared and hurt, and makes it harder to reconnect","time":1631131428000},{"user":"helper","text":"It is difficult to control our emotions, but we do have control of our thoughts, and we can choose the ones that make us stronger and more connected with our loved ones. ","time":1631131517000},{"user":"thinker","text":"good advice. i wish i had not gotten so upset. but regret won't help. i am going to control my thoughts as much as possible, and see them as people doing their best, sometimes afraid just like me.","time":1631131581000},{"user":"helper","text":"yes.. exactly","time":1631131591000},{"user":"helper","text":"We have a technique here to control our thoughts moving forward","time":1631131601000},{"user":"helper","text":"we write a new thought, to take place of the old ones in reaction to the same event","time":1631131615000},{"user":"helper","text":"so say for example that something similar happens again, your father acts in way that is odd and disconnecting, and doesn't offer an explanation. What is something you can think to yourself in response that will be understanding of all partied and help you to feel ok at the end of the day?","time":1631131684000},{"user":"helper","text":"*parties","time":1631131697000},{"user":"thinker","text":"i will picture him as a scared little boy and myself as a calm and loving adult and act accordingly. i will imagine that i am a detective and that i have to solve the case and must not create more crime or muddy the crime scene in order to make sure the truth and safety are preserved and valued","time":1631131766000},{"user":"helper","text":"Haha, I like the analogy","time":1631131780000},{"user":"helper","text":"Remember though, even calling him a scared little boy is another form of mind-reading.. the facts are we truly don't know what he is going through","time":1631131805000},{"user":"thinker","text":"i guess i can picture myself as a scared little boy and offermyself comfort and care and say - it's ok - you don't have to be afraid - this isnt that serious. it's just laundry for example.","time":1631131840000},{"user":"helper","text":"Hm, now I think we are getting closer to that comfort","time":1631131861000},{"user":"helper","text":"\"It's okay, you don't have to be afraid. There is more going on under the surface that you may not understand right now but what we do know is I love my family and my family loves me and this will bring us together again through all that goes on around us\"","time":1631131924000},{"user":"helper","text":"Something like that.. if it is comforting to you?","time":1631131931000},{"user":"thinker","text":"yes it really helps to reframe things this way","time":1631131944000},{"user":"helper","text":"good, :) I'm glad to hear. Sometimes a little simple reframing can really help us to zoom out and recognize the bigger picture","time":1631131981000},{"user":"helper","text":"What feelings come up for you when you consider this new thought \"It's okay, you don't have to be afraid. There is more going on under the surface that you may not understand right now but what we do know is I love my family and my family loves me and this will bring us together again through all that goes on around us\"?","time":1631132008000},{"user":"thinker","text":"honestly a few tears squirted out when i read what you wrote there.","time":1631132027000},{"user":"thinker","text":"im really scared about dying. im really scared about my dad dying. im really scared about leaving my kids behind when i pass away.","time":1631132062000},{"user":"helper","text":"These are very hard things to consider..","time":1631132090000},{"user":"helper","text":"it is the circle of life, but it is hard","time":1631132098000},{"user":"helper","text":"I think new thoughts like this can help","time":1631132118000},{"user":"helper","text":"help us to be present while we are here, to surround ourselves with love and care and purpose","time":1631132149000},{"user":"helper","text":"That is all we can do, and sometimes it's enough :)","time":1631132163000},{"user":"helper","text":"How do you feel now, compared to when we started?","time":1631132173000},{"user":"thinker","text":"much better thank you  ","time":1631132180000},{"user":"helper","text":"I'm really glad I was able to help. It was a pleasure talking with you today, I can tell you think deeply about things, both close to you and on a larger scale and that can be a hard burden to bear sometimes ","time":1631132231000},{"user":"helper","text":"Remember, this new thought works best through repetition because we are forging the healthy path for our mind to take when confronted with challenges. Whenever you are feeling doubtful or scared, remember to think \"It's okay, you don't have to be afraid. There is more going on under the surface that you may not understand right now but what we do know is I love my family and my family loves me and this will bring us together again through all that goes on around us\"","time":1631132293000},{"user":"helper","text":"And this will help to pause and remember what is most important, and the love that you've surrounded yourself with despite the chaos. ","time":1631132328000},{"user":"thinker","text":"It's okay, you don't have to be afraid. There is more going on under the surface that you may not understand right now but what we do know is I love my family and my family loves me and this will bring us together again through all that goes on around us","time":1631132426000},{"user":"helper","text":"yes :)","time":1631132436000},{"user":"thinker","text":"got it - thank you - very very helpful. making a note of it.","time":1631132443000},{"user":"thinker","text":"fabulous - will do","time":1631132479000},{"user":"helper","text":"Of course. With that, we are done here. Please come again if you'd like to discuss this further, or anything else that may be troubling you ","time":1631132482000},{"user":"helper","text":"have a wonderful day!","time":1631132494000},{"user":"thinker","text":"you as well thank you so much!","time":1631132498000},{"user":"helper","text":"Oh, quickly before you go actually","time":1631132520000},{"user":"helper","text":"I was wondering if it is okay for use to make this session public, in order to use it in training or as a reference for people who may be struggling with similar trouble?","time":1631132561000},{"user":"thinker","text":"that would be awesome if it helps anyone please do","time":1631132571000},{"user":"helper","text":"Thank you! ","time":1631132578000},{"user":"helper","text":"I think it will :)","time":1631132584000},{"user":"helper","text":"okay, catch you next time <3","time":1631132604000},{"user":"thinker","text":"take good care!","time":1631132608000}]}