{"notes":{"event":"close friend died a month ago\nwife had a miscarriage\nproject partner may be quitting","thought":"I'm delusional (and broken)\npotential for death in everything\n\"what am i doing\"\nI can't tell what's real (disillusioned)\ngrieve my whole life\n\nI could give up on everything and restart as someone with a lot less ambition\n\n blaming myself for the miscarriage\n\nmy relationships are ruined","behaviors":"isolated myself\nstop investing\nmessy room\ntodos aren't done\n\"look like a shitshow\"","feelings":"sad\neverything crashing in","labels":{"labeling":true,"black-or-white-thinking":true},"new_thought":"Each of the bad things happening have different reasons for them. I can notice that they're come from very different reasons, and that doesn't mean that I'm at fault\n\nI just need to work through them all, and see what they are, and look to the other side."},"messages":[{"user":"thinker","text":"Hi. I've been going through a lot of difficulty. I just went on a run, preparing for this session, and thought about it all. I might have worked a lot of it out on the run. I'm not sure where I stand right now.","time":1680386406000},{"user":"thinker","text":"I'm experiencing a lot of loss. Death. Failure.","time":1680386495000},{"user":"thinker","text":"It's been hard to move and do things and get things done. Partly because I'm often failing as I go.","time":1680386643000},{"user":"helper","text":"hii","time":1680386687000},{"user":"thinker","text":"Hi.","time":1680386698000},{"user":"helper","text":"Welcome to cheeseburger therapy. I hear you've got a lot going on. And I need just a min to get my computer plugged in","time":1680386739000},{"user":"helper","text":"and we can get started.","time":1680386745000},{"user":"helper","text":"brb","time":1680386748000},{"user":"helper","text":"okay, I'm ready","time":1680386871000},{"user":"thinker","text":"Okay.","time":1680386897000},{"user":"helper","text":"Thanks for sharing some of what you're going through off the bat. It sounds like you're experiencing some loss, and you're having a hard time doing things?","time":1680386952000},{"user":"helper","text":"you're feeling like you're failing?","time":1680386968000},{"user":"thinker","text":"Yeah, it's a lot of stuff at once.","time":1680386975000},{"user":"thinker","text":"My close friend died a month ago. I spent two weeks in his state. Flew back and my wife had a miscarriage. Another death. I tended to that. Meanwhile a lot of work tasks pile up. I return to them, and I am overwhelmed. Failing to get things done. And on top of that, I am discovering new problems. One of my projects might be failing. My partner on it quitting after 2+ years. Another project I ran into a problem in the design that I hadn't noticed over like 5 years. An obvious problem, that might make the whole thing not work. It's a bummer. I discovered that yesterday. It feels like in general I'm noticing all this potential death in everything. I'm noticing ways things might fail. And there are a lot of cracks in my life that could crack open.","time":1680387155000},{"user":"thinker","text":"I'm like \"what am I doing?\" I feel lost in all this.","time":1680387189000},{"user":"helper","text":"I can imagine how difficult it must be to experience any one of these things, and how overwhelming it may be for all of them to be happening at the same time","time":1680387225000},{"user":"thinker","text":"Yeah, and I feel really alone, and like I've isolated myself, to take on all these things, taking big risk, and now I am seeing a lot of failure and it's ... sad.","time":1680387256000},{"user":"thinker","text":"I wanted a friend to call this morning, but he's dead. I need new friends. I don't even have the kind of friends I want in my life.","time":1680387276000},{"user":"helper","text":"*oooof* I have experienced loss in my immediate family, and I know what it's like to just want to call that person. I'm sorry you're going through that.","time":1680387325000},{"user":"helper","text":"I have been taking notes on what you've shared so far on the right side of the page. Please let me know if something doesn't look right to you","time":1680387364000},{"user":"helper","text":"I know there's so much going on for you right now, but is there something specific that troubling you most right now?","time":1680387406000},{"user":"thinker","text":"(Another way to ask this is \"what's most troubling about all this?\" which is a way to capture all of the lots of stuff and integrate it into a single thing without having to exclude things to get specific.)","time":1680387438000},{"user":"helper","text":"(:thumbs-up:)","time":1680387450000},{"user":"thinker","text":"I guess what's most troubling is the experience of everything crashing in, and feeling like I've been deluded. Failure.","time":1680387496000},{"user":"thinker","text":"And if that's true and I just need to restart then that would be fine, I mean it would be horrible, but I guess if I step through that... I'm good at death now... I can face death and let go.","time":1680387536000},{"user":"thinker","text":"But if that's true then I need to let go of a whole lot, like my whole life here.","time":1680387554000},{"user":"thinker","text":"I don't know where the death ends.","time":1680387563000},{"user":"thinker","text":"I don't know what I'm letting go.","time":1680387570000},{"user":"helper","text":"okay, let me see if I'm understanding you. With the death of your friend, your wife's miscarriage, your partner maybe leaving, and the failure of another project, you're feeling overwhelmed. Like everything is crashing in. You're noticing the potential for death in everything, and it leaves you thinking you were delusional. This, in turn, is pulling you towards isolating yourself and not knowing where to turn.","time":1680387735000},{"user":"thinker","text":"Yeah. I think the delusional part is key.","time":1680387741000},{"user":"thinker","text":"It's like everything feels fake. I can't tell what's real.","time":1680387747000},{"user":"thinker","text":"I can't tell what to actually do, what actually needs to be done, because everything might disappear.","time":1680387759000},{"user":"thinker","text":"I'm ready to mourn and grieve my whole life.","time":1680387766000},{"user":"thinker","text":"Maybe that's too much.","time":1680387771000},{"user":"thinker","text":"I don't know what's alive.","time":1680387773000},{"user":"helper","text":"Could you help me understand what you mean when you say \"I don't know what's alive\"? Is that in reference to what's left \"alive\" in your life today?","time":1680387831000},{"user":"thinker","text":"Yeah, like my friend dies, and he's a part of me, and I don't know if that part of me dies, and what is going on.","time":1680387849000},{"user":"thinker","text":"And if my project has an error in its inception, then does that mean the whole project is dead, or just some aspect of it.","time":1680387873000},{"user":"thinker","text":"alive = real = functioning = right & true => something to invest in","time":1680387932000},{"user":"thinker","text":"dead = fake = broken = wrong & error => let it go","time":1680387949000},{"user":"helper","text":"right, that makes sense. I can imagine you're worried that EVERYTHING might die. You're anticipating the death/failure/breaking of your partner in one project and also in your other project?","time":1680387977000},{"user":"thinker","text":"Yeah...","time":1680387984000},{"user":"helper","text":"The loss you've experienced has shaken your world. Nothing feels reliable or stable","time":1680388000000},{"user":"thinker","text":"I keep noticing things that are false and wrong and should die and I wonder if there's more and more and maybe the whole thing is rooted in falsehoods. I think I've actually been living life with too much optimism for a while and I really need to prune down. Like a tree, pruning branches, and letting them die, so the tree can live better.","time":1680388031000},{"user":"helper","text":"The death of your friend, and your wife's miscarriage have shaken your faith in the veracity of every part of your life. Like everything is crashing in. You're noticing the potential for death in everything, and it leaves you thinking you were delusional for EVER thinking \"things will be ok\". You're anticipating \"dead = fake = broken\" in all parts of your life. And you're considering letting it all go.","time":1680388142000},{"user":"helper","text":"is there anything missing?","time":1680388155000},{"user":"thinker","text":"Yeah, that first part you mentioned with the death and miscarriage, reminds me that those were random things that happened at the same time, and they aren't connected as part of some bigger pattern, but maybe the doubling-up of them have gotten me extra down and feeling like there's a bigger pattern than there is, and looking deeper than I need to. Maybe I can remember that those were randomly co-occurring crises.","time":1680388214000},{"user":"thinker","text":"Like, it seems like there's a lot of B&W in all of this.","time":1680388238000},{"user":"thinker","text":"And maybe that's happening with me because of those things happening simultaneously.","time":1680388249000},{"user":"thinker","text":"But also a lot of my work failures feel like they might be related.","time":1680388269000},{"user":"helper","text":"Do you think it's right that thinking you were being delusional is the most troubling thought?","time":1680388284000},{"user":"thinker","text":"Yeah I think the delusion is the most troubling thing in me.","time":1680388293000},{"user":"thinker","text":"It's like \"maybe everything is broken\"","time":1680388303000},{"user":"helper","text":"yeah, it sounds that way as I'm hearing your talk about it","time":1680388306000},{"user":"thinker","text":"\"because I'm broken\"","time":1680388308000},{"user":"thinker","text":"\"I'm delusional\"","time":1680388313000},{"user":"helper","text":"OHH wow! that's interesting","time":1680388322000},{"user":"helper","text":"and i can imagine how you'd feel sad and isolated thinking that you're broken and delusional","time":1680388345000},{"user":"thinker","text":"Yeah, and like I look around and my room is messy, and I look like a shitshow.","time":1680388369000},{"user":"thinker","text":"I have a huge stack of todo items that I haven't finished. If I can't do basic things... how can I think that anything will work. I've had a lot of confidence.","time":1680388393000},{"user":"helper","text":"well let's see if any of the cheese labels apply to \"I'm delusional and broken\"","time":1680388444000},{"user":"helper","text":"you already mentioned B&W","time":1680388455000},{"user":"helper","text":"does that feels like it would apply here?","time":1680388466000},{"user":"thinker","text":"Yeah because I've been thinking the whole world is falling in","time":1680388479000},{"user":"thinker","text":"Yeah, labeling is definitely what I'm doing.","time":1680388493000},{"user":"helper","text":"You're thinking that you are delusional -- labeling yourself \"delusional\" without considering if your behavior is extrinsic? Does that sound right?","time":1680388581000},{"user":"helper","text":"Are you familiar with the cheeses and how we can apply them to our thoughts?","time":1680388613000},{"user":"thinker","text":"Yeah","time":1680388617000},{"user":"helper","text":"okay so, I can totally see how thinking you're delusional and broken -- something intrinsic about yourself, would lead to isolation, messy room, not investing... etc. Does it leave you feeling hopeless?","time":1680388692000},{"user":"thinker","text":"Yeah.","time":1680388694000},{"user":"thinker","text":"And then I want to give up, give it all up. Go out into the pasture and try to live a normal life.","time":1680388720000},{"user":"thinker","text":"Eating food and having friends in the midwest. Or south america.","time":1680388741000},{"user":"helper","text":"yeah, I can relate to wanting to give up when I'm feeling hopeless. That's so real and so personal. And I want to thank you for your vulnerability in sharing that with me","time":1680388765000},{"user":"helper","text":"Having friends in the midwest or south america? does that imply you'd leave your relationship and your projects behind?","time":1680388820000},{"user":"thinker","text":"Yeah, that kind of thought crosses my mind.","time":1680388827000},{"user":"thinker","text":"I said \"wife\" but it's actually not that committed.","time":1680388840000},{"user":"helper","text":"ahh, is it ok for me to call that \"your relationship\"?","time":1680388865000},{"user":"thinker","text":"that's fine","time":1680388870000},{"user":"helper","text":"Sounds like thinking \"I'm delusional and broken\" makes you feel like running far far away","time":1680388937000},{"user":"helper","text":"and it's not a good feeling?","time":1680388955000},{"user":"thinker","text":"it specifically makes me feel like giving up on everything and then restarting, as someone a lot less ambitious.","time":1680388988000},{"user":"helper","text":"how does that idea land with you?","time":1680389007000},{"user":"thinker","text":"sad","time":1680389012000},{"user":"thinker","text":"but I imagine happiness with lowered ambitions","time":1680389028000},{"user":"thinker","text":"because I gave up on a better world","time":1680389033000},{"user":"helper","text":"hmm okay. I want to get back to our original cheesy thought because I think we may be able to make some tweaks there that pull your mind and heart a different way. I have no expectations or judgement, just exploring for now","time":1680389121000},{"user":"helper","text":"do you have a sense of a new thought that might be cheese free, compared to \"I'm delusional and broken\"?","time":1680389165000},{"user":"thinker","text":"(The first step is to cut the cheese, by doing storytelling describing the impact of the cheese on the negativity in the feelings and behaviors.)","time":1680389185000},{"user":"helper","text":"ahh, thanks for the note!!","time":1680389198000},{"user":"thinker","text":"(And starting with the thought itself. This links in the mind of the thinker how the thought that he is thinking is *causing* the negative feelings and behaviors. Then when the thinker sits with this mental association, he'll naturally begin to let go of the cheesy thought, and will make space for a new thought to naturally appear on its own.)","time":1680389234000},{"user":"helper","text":"(okay, I'll give that a shot :) )","time":1680389260000},{"user":"helper","text":"After your friend's death and this miscarriage, you feel incredibly shaken, and start to wonder \"am I delusional?\" \"Is everything in my life broken?\" You believe these labels to be true of your character and don't attribute them to the terrible loss(es) you've faced. You come up with a solution to restart your life somewhere else as a less ambitious person, and you find that thought to be sad.","time":1680389451000},{"user":"helper","text":"You're left feeling isolated, overwhelmed, and incredibly saddened","time":1680389476000},{"user":"thinker","text":"Yes.","time":1680389483000},{"user":"thinker","text":"(This could be as simple as: \"You had a bunch of bad things happen, but then you think `I'm delusional` which attributes it to your character, something in the core of you. This makes you think that everything around you is falling in, and leads to black&white thoughts, and you feel incredibly sad and start fantasizing about restarting life with less ambition. This is all caused by the cheesiness of attributing these random events outside of you to something in *your* character. It is not your fault that your friend died and the miscarriage happened.","time":1680389574000},{"user":"thinker","text":"I'm sorry I started being simple there but then it really started getting to me and I got carried away and wrote a lot and now I'm crying.....","time":1680389589000},{"user":"thinker","text":"(I was just trying to give a tip about being simple and direct on the thought+cheese -> feelings -> behaviors)","time":1680389617000},{"user":"helper","text":"I can't imagine how painful this must be. You're doing an amazing job working through this.","time":1680389626000},{"user":"helper","text":"Your experience with this model is showing, and I think (hope) it'll help us move towards a shift for you here","time":1680389674000},{"user":"helper","text":"and it's NOT YOUR FAULT your friend died or the miscarriage happened","time":1680389709000},{"user":"thinker","text":"yeah I think I am blaming myself for the miscarriage and thinking my relationships are ruined","time":1680389715000},{"user":"helper","text":"A miscarriage is no one's fault. My sister had a miscarriage last year, and it took a huge toll on her and her family. It can be so difficult to mourn that kind of loss","time":1680389844000},{"user":"helper","text":"It's so human to blame yourself, but the truth is it's NOT YOUR FAULT","time":1680389871000},{"user":"thinker","text":"It's the ultimate place for negative energy to go if we don't process it — the self.","time":1680389875000},{"user":"helper","text":"right! that's beautifully put","time":1680389889000},{"user":"helper","text":"Is there a new thought emerging for you?","time":1680389920000},{"user":"thinker","text":"(Ok, and to ask for the new thought, we want to get back present to the event.)","time":1680389942000},{"user":"helper","text":"mm so something like \"Is there a new thought you could think when faced with this loss?\"","time":1680389987000},{"user":"thinker","text":"I usually start with the event itself.","time":1680389996000},{"user":"thinker","text":"Get the thinker in the frame of mind of the event, and then ask for a new way to think about it.","time":1680390006000},{"user":"thinker","text":"I think \"loss\" is probably a thought.","time":1680390017000},{"user":"thinker","text":"When I look at this situation, I see that I've had a bunch of things happen: a death of a close friend, a miscarriage, and a potential project partner quitting, and each of these have their own very different reasons.","time":1680390057000},{"user":"thinker","text":"I think seeing that they come from very different reasons is a good thing to notice.","time":1680390071000},{"user":"thinker","text":"And this doesn't mean that I'm at fault.","time":1680390084000},{"user":"thinker","text":"But each of these does mean change.","time":1680390099000},{"user":"thinker","text":"Big changes in life.","time":1680390104000},{"user":"thinker","text":"And I need to find my way through that change.","time":1680390110000},{"user":"thinker","text":"And to make my way through, it will help to know what is still true to me.","time":1680390134000},{"user":"thinker","text":"What is alive.","time":1680390139000},{"user":"helper","text":"hmmm that's an interesting perspective. Certainly seems like B&W","time":1680390170000},{"user":"helper","text":"I want to do a time check, we're a couple mins past the hour. ","time":1680390188000},{"user":"helper","text":"If we stay on for another 10 mins, I need to take a very short break to feed my neighbor's dog","time":1680390227000},{"user":"thinker","text":":)","time":1680390231000},{"user":"thinker","text":"I think we have a new thought up there.","time":1680390238000},{"user":"helper","text":"!! yes!!","time":1680390245000},{"user":"helper","text":"how does it feel when you think the new thought? ","time":1680390287000},{"user":"thinker","text":"I feel like there's work I can do again. Like I am a life form, present in these challenges.","time":1680390289000},{"user":"thinker","text":"To work through them and do good.","time":1680390294000},{"user":"thinker","text":"It gives me a reason to be alive again.","time":1680390298000},{"user":"helper","text":"wow! that's powerful","time":1680390307000},{"user":"thinker","text":"So I don't feel as apathetic.","time":1680390307000},{"user":"thinker","text":"Thank you.","time":1680390387000},{"user":"helper","text":"So the new thought is \"Each of the bad things happening have different reasons for them. I can notice that they're come from very different reasons, and that doesn't mean that I'm at fault\"?","time":1680390395000},{"user":"thinker","text":"Yeah, and I just added \"I can look through each of these, see what they are, and look through to the other side\" which is where life happens again.","time":1680390440000},{"user":"helper","text":"How are you feeling now, compared to when we started?","time":1680390457000},{"user":"thinker","text":"I feel like I have direction and purpose instead of feeling lost and delusional like the walls are crashing in.","time":1680390471000},{"user":"helper","text":"that's really good to hear :)","time":1680390487000},{"user":"thinker","text":"thank you","time":1680390492000},{"user":"helper","text":"I'm sure you know the drill -- remember to think this new thought when you're remembering these losses","time":1680390519000},{"user":"thinker","text":"thank you.","time":1680390524000},{"user":"thinker","text":"I will take it with me.","time":1680390528000},{"user":"thinker","text":"this weekend.","time":1680390531000},{"user":"thinker","text":"I will go back onto a run and let this go forward in my mind","time":1680390545000},{"user":"helper","text":"okay! thank YOU! enjoy your weekend and your run","time":1680390556000},{"user":"thinker","text":"thank you very much for your help today.","time":1680390559000},{"user":"helper","text":"would you like this session to be viewable?","time":1680390569000},{"user":"thinker","text":"Yeah, we can make it public.","time":1680390622000},{"user":"helper","text":"okay, thank you so much again. Goodbye :)","time":1680390633000},{"user":"thinker","text":"goodbye!","time":1680390652000}]}