{"notes":{"feelings":"- numb\n- helpless","event":"lost motivation to do anything","behaviors":"- decline outings with friends\n- not submitting assignments \n- do nothing instead","thought":"- its too late for me to learn how to try\n- its do or die and I can't really do","labels":{"control-fallacy":true},"new_thought":"Its ok even if I sometimes feel like I'm in the passenger's seat of myself, because at the end of the day, I am in control of my own actions and what becomes of them."},"messages":[{"user":"thinker","text":"Hi there, my life has been pretty tiring lately. I don't think I'm depressed, but recently I've had absolutely no motivation to to things, even small and simple tasks like filling out a sheet from school or attending an online recital where my peers and teachers were waiting for me. I can't find motivation to get out of bed until late afternoon, and if I weren't forced out of bed by a ringing alarm clock on the other side of my room, I don't think I'd get up at all.","time":1650347269000},{"user":"thinker","text":"I see it less of procrastinating now and more of an inability. I really don't know what I'm supposed to do since I just do absolutely nothing nowadays. The only reason my grades in school are okay is because my teachers like me as a person.","time":1650347365000},{"user":"thinker","text":"Because I've been so messy and lifeless for a really long time, I often decline outings with my friends, and that's morphed into them seeing me as untrustworthy since I have to come up with an excuse. And as of last week, my best friend has stopped speaking to me and messaging me entirely. He's been on my mind a lot now, and it really sucks because I feel like he was some wonderful support to me. We had a really close relationship, and could have easily escalated to something romantic so I think it hurts a lot more than it would have if he were just a normal friend. :( ","time":1650347754000},{"user":"thinker","text":"Thanks for the help,  hope we get somewhere tomorrow","time":1650347783000},{"user":"thinker","text":":)","time":1650347788000},{"user":"helper","text":"Hi, welcome to Cheeseburger Therapy! ","time":1650405636000},{"user":"helper","text":"Thank you for sharing all of that with me. I hear that lately you are feeling very unmotivated to do things, sort of like an inability to get anything done. Seems like apart from an ongoing sense of dread, this is actively affecting your school commitments, social life, and even a close relationship. does that sound about right?","time":1650405796000},{"user":"thinker","text":"Yes, that's correct. It's pretty debilitating :(","time":1650405821000},{"user":"helper","text":"im so sorry :( I've personally been in a similar situation in the past, and I know how shitty it feels to not want to do anything, but I'm guessing theres also pressure from society (or just your internal pressure) to get up and do something, and the internal conflict sucks","time":1650405899000},{"user":"thinker","text":"I'm not sure if there's any way to get out of it, but the mere thought of it sounds amazing. I guess I haven't given up completely yet, and that's good, but for now I'm kind of trapped in a really stupid feeling position","time":1650405968000},{"user":"helper","text":"hey props to you for not giving up just yet! No doubt getting out can be hard work, but trying to talk things through like you're doing here to day is a great start. I'm hoping that in today's session, to just be a sounding board for you and see if we can even take a small step forward towards figuring out what's troubling you. Does that sound good?","time":1650406095000},{"user":"thinker","text":"Yes, that sounds great! I'll be on and off for about fifteen minutes, but will try to be as responsive as possible!","time":1650406158000},{"user":"helper","text":"ok no worries, appreciate the heads up. Also wanted to check whether you have any time constraints today?","time":1650406177000},{"user":"thinker","text":"No, not really. I can be online for a pretty long time, just have to walk home from school which is the 15 minutes lol","time":1650406228000},{"user":"helper","text":"gotcha. alright, lets see where this session takes us then.","time":1650406252000},{"user":"helper","text":"So you mentioned lately you are feeling very unmotivated, do you remember any particular event or events that happened that set this off?","time":1650406303000},{"user":"thinker","text":"Not really, it's mostly been like this for as long as I can remember. Recently it's gotten a lot worse, though, from procrastination to just a complete block in my brain to do anything at all.","time":1650406376000},{"user":"helper","text":"I see, yeah I recall you making the distinction between procrastination vs inability earlier. how are you currently drawing the line between that?","time":1650406455000},{"user":"helper","text":"does it feel really different to you?","time":1650406460000},{"user":"thinker","text":"Procrastination before was mostly just putting off work and rushing it in the last few hours, nowadays I often wait around and just see the due date pass by without starting. Doesn't feel like I can do much\n at all ","time":1650406528000},{"user":"helper","text":"ahh ok, so before with procrastination, when it was the last few hours, you still felt the importance and urgency to complete it, and you actually stress out about it to try to finish. but now it sounds like there is a numbness and you just watch the deadline pass?","time":1650406617000},{"user":"thinker","text":"Yeah, that's it! ","time":1650406666000},{"user":"helper","text":"gotcha. nowadays, as you watch the deadline pass, what kind of thoughts come up for you?","time":1650406723000},{"user":"thinker","text":"Mostly just recognizing that it's passed and that I still haven't done any work whatsoever - wondering where something in the procrastination cycle went wrong mostly","time":1650406813000},{"user":"helper","text":"hmm can you explain that second part a bit more?","time":1650406833000},{"user":"helper","text":"(btw just wanted to let you know im casually taking some notes on the right hand side, if you see anything that doesn't resonate well, feel free to let me know anytime)","time":1650406909000},{"user":"thinker","text":"Ooh, got it. About the procrastination part, before when I wasn't so inactive I still used to put off work until the last bit, but right before then I sort of hyperfocused and finished my work to hand it in right on time. Not much actual effort was put into that super focused work, so I always felt that it would happen no matter what if I don't have an assignment ready before it's due. Seemed like a safety net just in case, but as of recent it's just been gone- I haven't been hyperfocusing so it feels a lot more like inability now. Sorry if my message is long and winding, I couldn't really wrap my head around it when trying to explain what it felt like.","time":1650407117000},{"user":"helper","text":"no worries at alll! thank you for sharing all of this. honestly sometimes I have things in my head that im 'thinking' about for a long time, but because its all in my head, its often messy. That's why talking to someone often helps because it kinda forces you to at least find some way to express it, and then you can read it back and realize ohhhhhh that's what it is, or fill in whatever gaps that dont sit well with you","time":1650407202000},{"user":"helper","text":"so im kind of sensing that when you were procrastinating, there was this 'last minute hyperfocused' part that automatically kicked in, which is something you thought you could rely on, sort of like an auto pilot. But lately that part has disappeared, which kinda left you with nothing and as a result things just dont get done","time":1650407296000},{"user":"thinker","text":"Yeah, that's right. Since elementary school, actually, I was always lopped into those \"gifted kid programs\" so I always assumed that's just how things worked in the brain of those gifted kids- but now I realize I'm probably too far into life that I don't know how to put hard effort and actually work for something. This adds to the helpless feeling when I just do nothing instead of actually starting and getting things done.","time":1650407421000},{"user":"thinker","text":"Also, I'm home now! So there won't be too many delays in my responses from now on.","time":1650407443000},{"user":"helper","text":"Great, thanks for letting me know, although there were hardly any delays. im pleasantly surprised that you walked home from school while having this conversation, hopefully you looked while crossing streets and stuff lol","time":1650407488000},{"user":"helper","text":"anyway, yeah what you said makes a lot of sense. I mean, procrastination is something that everyone kind of at some point faces, but some people definitely more than others. Actually a lot of people I've talked to who struggle with really extreme cases of procrastination often tell me that they started off feeling bored or not challenged","time":1650407590000},{"user":"helper","text":"so for example like growing up in school, they always managed to do stuff the last minute and get away with it, so its kind of like why try regularly?","time":1650407634000},{"user":"helper","text":"Do you think that applies/applied to you when you were procrastinating? ","time":1650407647000},{"user":"thinker","text":"yeah, it definitely does apply here- I never really needed to put in any effort to get good grades, so I just didn't- and now the situation at hand with myself not trying to get things done just feels like that one thought experiment with the frog in slowly boiling water, I really think I realized too late on this one","time":1650407753000},{"user":"helper","text":"its too late for you... to try?","time":1650407785000},{"user":"thinker","text":"I feel like it's really late for me to be learning how to try- I'm already taking a few courses at school which are for twelfth grade and such, it seems like it's do or die and I can't really \"do\" because of my lost motivation","time":1650407912000},{"user":"thinker","text":"really shitty feedback loop stuff, having ltos of trouble getting out","time":1650407932000},{"user":"helper","text":"I see. hey, its never too late to try anything. but I can totally understand its at times EXTREMELY difficult to find motivation to","time":1650407994000},{"user":"helper","text":"but just throwing it out there that its not too late","time":1650408012000},{"user":"helper","text":"ok so im curious, do you like the stuff you are studying? is it too easy/hard? genuinely uninteresting","time":1650408058000},{"user":"helper","text":"or does it not matter what you are doing, you feel like you can't/don't get excited about anything (doesn't have to necessarily be school related btw)","time":1650408086000},{"user":"thinker","text":"huh, good question- I feel like during the start of the year a lot of my energy towards a subject depended on momentum and how I looked at the class in comparison to others- if I had a really boring class which I could get easy marks in quick, I either felt indifferent or slightly happy that I didn't have to do much for a block. If I can find a certain point of a subject that I genuinely find interesting, though, I can usually get pretty excited about it- though the energy doesn't exactly go anywhere nowadays, since I just don't do work outside of class","time":1650408268000},{"user":"thinker","text":"in class, though, I can usually talk about a subject I like to my teachers or peers for quite a while. (long enough to get my mark bumped up lol)","time":1650408308000},{"user":"helper","text":"I see! so it seems like you're not completely numb, you still feel a sense of excitement about things you enjoy, and it translates into engaging conversations in class. But nothing makes it past AFTER class when you have to do homework and stuff ","time":1650408389000},{"user":"thinker","text":"Yeah, that's when I just power down and all. My emotions are a lot more muted once I'm out of public eye (which I find really weird but don't care too much about). I like to make jokes to my friends that I don't exist when they don't see me- they don't seem to think much of the jokes, but sometimes that's how it feels","time":1650408487000},{"user":"helper","text":"oh wow, that is an interesting thing to be feeling though.. usually people 'hide' themselves by being extra quite or extra loud (over compensating) when they are out and with others, and then when they're alone is when they feel all their emotions and 'true self'","time":1650408560000},{"user":"helper","text":"do you feel the opposite of that?","time":1650408566000},{"user":"thinker","text":"Hm, I'm not sure what my 'true self' feels like- mostly when I'm out and seem happy with my friends, it genuinely feels happy until I think about it for a while- though that may just be the case with normal emotions, being pushed out of the scene when you try to rationalize them. If that's the case, then yes- I do think I feel the opposite of that, yeah.","time":1650408659000},{"user":"helper","text":"that's totally valid. yeah I can relate in terms of a moment where I feel genuinely happy, all up until I acknowledge it and start thinking/ overthinking it","time":1650408721000},{"user":"helper","text":"the feeling of bliss is truly only felt","time":1650408736000},{"user":"helper","text":"anyway, so when you're alone, you mentioned your emotions are a lot more muted. do you not feel things, or do you think you are TRYING to not feel things/ avoid certain feelings?","time":1650408783000},{"user":"thinker","text":"I don't think it's voluntary- the moment I get home my emotions just sort of shut down. I use the word muted because the physical signs of emotion sometimes still remain, like crying even when I don't particularly feel sad- but just during a sad moment.","time":1650408875000},{"user":"helper","text":"I see. so its it like... you dont really feel your emotions? sounds like its something that just happens and you're looking at it from above","time":1650408949000},{"user":"thinker","text":"Oh yeah, you explained it exactly right! It really does feel like I'm just in the passenger's seat when it comes to emotions once I'm home","time":1650408980000},{"user":"helper","text":"ahhh ok. wow this is is all too familiar to me","time":1650409020000},{"user":"helper","text":"can I maybe tell you what happens to me, and you can see if it helps explain anything you feel?","time":1650409057000},{"user":"thinker","text":"ohh yes please!","time":1650409062000},{"user":"helper","text":"so long story short, over the years I have noticed that I have a lot of trouble being 'present'. This is easier when im out with others, because they situate me. I can place myself in the context of others, what they're doing, etc. But when i'm alone, its a lot harder because there is no more reference point","time":1650409143000},{"user":"helper","text":"as a result, theres becomes two 'parts' of me, one that is the body and even the emotions, biological things that happen, and then the other is kind of the consciousness. and that's why often I feel like things are just 'happening' around me or happening to me","time":1650409259000},{"user":"helper","text":"I can acknowledge that I am crying, or I can tell people that I am sad, but often I dont feel sad","time":1650409288000},{"user":"helper","text":"in the rare moments that I do, I am actually in the moment REALLY feeling it, I'm definitely not thinking about how sad I am","time":1650409312000},{"user":"thinker","text":"holy shit","time":1650409317000},{"user":"thinker","text":"yeah","time":1650409318000},{"user":"thinker","text":"yeah that's accurate, way too accurate I'm incredibly surprised","time":1650409336000},{"user":"thinker","text":"it often feels like I'm (conscious bit) just asleep and every so often when I wake up, I'm actually experiencing things and feeling some semblance of the emotions that I usually only have a sort of outline of. I get the feeling that I'm following myself around ","time":1650409410000},{"user":"helper","text":"yep, and im guessing you have a tendancy to overthink things and have long convoluted conversations/back and forths within your head?","time":1650409463000},{"user":"thinker","text":"yes and yes, the context thing you mentioned earlier was really interesting to me, I always kind of felt like a mirror that just reflected whatever situation I was in- and that situation bit you said is another way to think about it for me, really brings it together","time":1650409551000},{"user":"helper","text":"well im glad! at the very least you can takeaway from this conversation that somebody out there kinda gets what you're going through","time":1650409594000},{"user":"thinker","text":"yeah, thank you. It feels better to know that someone's gone through it before","time":1650409628000},{"user":"thinker","text":"did you ever get out of it?","time":1650409632000},{"user":"helper","text":"so heres the thing, I dont know how relevant what we're talking about is to procrastination and stuff, might be related but separate, so I dont really have an answer to the procrastination thing.","time":1650409691000},{"user":"helper","text":"But","time":1650409692000},{"user":"helper","text":"for this kind of detachment we are talking about, for a long time I was really frustrated by it too, because it feels like people are experiencing joy, sadness, SOMETHING, and im just sitting here overthinking everything and watching. but I think over time, 2 things changed. ","time":1650409757000},{"user":"helper","text":"1) I've learned to not think about it as black or white. because from talking to other people who are overly emotionally and always let emotions affect their decision making, i've learned that what I experience is actually preferred in many situations where it requires someone to be more objective and rational. So I think shifting my mindset that from 'ugh this objectively sucks' to 'hey maybe its not too bad' helped me","time":1650409891000},{"user":"helper","text":"2) I sometimes have to remind myself to be more present. and with some practice, its doable. In the beginning it feels a little forced, like have you heard that the act of smiling actually tricks your brain into thinking its happy? so kind of doing that, but also with sadness. Its important to feel sad sometimes too, because personally I think feeling anything is better than feeling nothing","time":1650410002000},{"user":"helper","text":"lol sorry this totally turned into my life story instead of a session about you..","time":1650410018000},{"user":"thinker","text":"oh yeah no worries I enjoyed reading about your experiences and I really do think they can help","time":1650410047000},{"user":"thinker","text":"number two is really interesting to me, just the subtle reminder to think in the present and try to focus in the moment doesn't sound as impossible as just waking up one day fully awake","time":1650410116000},{"user":"helper","text":"yeah! and I think one thing that helped me remind myself was the idea of 'intention'","time":1650410145000},{"user":"helper","text":"I think this also relates to the idea of procrastination and some of the stuff we were talking about.","time":1650410162000},{"user":"helper","text":"A lot of times, outcomes are the same, but intention makes all the difference. For example, a while back when I was struggling, I just found myself on the couch watching tv until 2/3 in the morning instead of doing work, and then next morning not being able to wake up to go to my commitments. But now, when i find myself wanting to lean into that, I say, \"its ok if I want to rest and watch tv\" ","time":1650410276000},{"user":"helper","text":"and I think that gives you back some control, as opposed to feeling like things are just happening to you and you are just watching it unfold","time":1650410322000},{"user":"thinker","text":"Ohh, that makes a lot of sense. Do you think I'll be able to get out of the procrastination hole I've dug myself into with a little bit of that kind of thinking and some newfound energy? I'm hoping for it and after the past conversation we've had I do feel that it's much more possible for me to accomplish things than I make it out to be","time":1650410434000},{"user":"helper","text":"that's awesome! I'm can definitely sense more optimism from your end in trying to get out of this temporary hole. ","time":1650410498000},{"user":"helper","text":"I think I have something that can kind of close this conversation out, and help you walk away with something that is logical and concrete to process","time":1650410536000},{"user":"helper","text":"So if you look on the right hand side where I have my notes, you'll see a cheese icon. In there, there are a bunch of what we call 'cheese labels'. Each cheese label describes a type of cheesy thought. Cheesy thoughts are thoughts that we commonly use to frame situations presented to us. They're not inherently good or bad, but they can actually distort how we perceive events that happen, and leaving us feeling stuck or troubled.","time":1650410637000},{"user":"helper","text":"In many cases, there are multiple that can apply, but for now, I've selected this thing called 'control fallacy'. The description sounds a little harsh, but dont mind that. so the thoughts you are having about procrastination such as 'its too late for me to learn how to try' or 'its do or die and I can't really do', end up making you feel really helpless, like you dont have control over what is happening. As a result, your homework is not done, you end up not going out with your friends, and you do nothing. As you mentioned earlier, this becomes a negative cycle that keeps coming back and getting worse, until present day where you simply feel stuck in this whole not sure whether there is even an 'out', or whether you can get out of it.","time":1650410838000},{"user":"helper","text":"Control fallacy thoughts are unfortunately quite common amongst people. But the way to kind of 'break' this thought pattern distortion, is to recognize areas where you DO have control. For example like I said before, watching tv is not inherently bad, if you are the one deciding to do that. Same goes for not socializing. If you are tired or you simply dont want to, this can be a choice you are making, as opposed to something that is 'happening to you'","time":1650410953000},{"user":"helper","text":"and when we start recognizing points where we do have control and choose to take control of those parts, it can create a *positive* cycle where you may feel more intentional (and present) about the things that you are doing, because they are your choices","time":1650411039000},{"user":"helper","text":"hows all that sitting with you?","time":1650411046000},{"user":"helper","text":"I know it was a lot lol","time":1650411059000},{"user":"thinker","text":"Thank you so much honestly I'm not sure what to say, the bit about cheesy thoughts really struck me when I realized how many holes there were in my conclusions. Can't really believe how clear it should've been, but I'm really glad that this is all starting to make more sense now. I really do think I'm going to take control, or at least try to from now on, I'm really surprised and am not sure what to expect- but change is change, and I think that's what I'm looking for lol","time":1650411217000},{"user":"helper","text":"that is awesome!! im so happy to hear that you are feeling empowered to try something different! ","time":1650411238000},{"user":"helper","text":"So to wrap up our session, I would like to suggest that we try to come up with a 'new thought' that you can take with you (in light of everything we've been talking about), so that next time you find yourself being unmotivated to do things, you can remind yourself of the new thought, and try to shift back to a more positive direction","time":1650411314000},{"user":"helper","text":"how does that sound?","time":1650411317000},{"user":"thinker","text":"That sounds great, should I just shoot off an idea I've had sticking around my head for the last few minutes?","time":1650411352000},{"user":"helper","text":"hell yeah","time":1650411356000},{"user":"thinker","text":"Okay so like ","time":1650411374000},{"user":"thinker","text":"even though I feel like I'm in the passenger's seat of myself and just following myself around, I still do have complete control of my own actions and what becomes of them","time":1650411422000},{"user":"thinker","text":"maybe too long","time":1650411425000},{"user":"helper","text":"hmm gimme a sec to see if I can modify this a little","time":1650411450000},{"user":"thinker","text":"ooh yeah of course","time":1650411456000},{"user":"helper","text":"how about something like","time":1650411621000},{"user":"helper","text":"Its ok even if I sometimes feel like I'm in the passenger's seat of myself, because at the end of the day, I am in control of my own actions and what becomes of them. ","time":1650411622000},{"user":"thinker","text":"Ooh yes, that explains what I was trying to say a lot better than I phrased it lol","time":1650411646000},{"user":"helper","text":"yayyy ","time":1650411651000},{"user":"helper","text":"so when you think \"Its ok even if I sometimes feel like I'm in the passenger's seat of myself, because at the end of the day, I am in control of my own actions and what becomes of them\", how are you feeling? ","time":1650411682000},{"user":"thinker","text":"I feel a lot less helpless when it comes to something like a perceived inability to do things, since I realize it's just a choice that needs to be made","time":1650411722000},{"user":"helper","text":"that's awesome!! ","time":1650411735000},{"user":"helper","text":"in the future, whenever you find yourself unmotivated to do things, remember to try to practice this new thought!","time":1650411775000},{"user":"thinker","text":"Yess, thank you- I will! I've taken a screenshot of the notes for future reference, I'm really excited to see how this works out for me. Thank you so much, I really don't know what would've happened otherwise","time":1650411829000},{"user":"helper","text":"this makes me SO happy to hear, and reminds me of why I do this :(","time":1650411850000},{"user":"helper","text":"*:)","time":1650411852000},{"user":"helper","text":"oh and dont worry, you can bookmark or save this link wherever, and can come back to it anytime to read if you need","time":1650411871000},{"user":"helper","text":"and in the future, if you want to talk about anything else, you can always schedule another session","time":1650411893000},{"user":"thinker","text":"Awhh thank you so much. I'll be keeping this link for quite a while I think :) Thanks again, I feel a ton better now.","time":1650411935000},{"user":"helper","text":"no problem! I hope you have a great rest of your day, and take care :)","time":1650411958000},{"user":"thinker","text":"You too!","time":1650411963000},{"user":"thinker","text":"Oh by the way, before I go, I remember seeing this site as an ad on an imageboard, it mentioned only paying if the therapy helped? I'm pretty scared of putting my card info on the internet, but was wondering if there was some PO box I could send to instead lol. Might be silly but I wanna help out lol","time":1650412051000},{"user":"helper","text":"awww I appreciate it alot!","time":1650412059000},{"user":"helper","text":"so right now we are doing this beta thing where we haven't started charging yet. so you're in luck! no payment needed","time":1650412091000},{"user":"helper","text":"but if you're willing, I do have some questions for you about this session (just as sort of like a review), if you can answer those that would be incredibly helpful","time":1650412133000},{"user":"helper","text":"it'll be super quick like 1-2 mins","time":1650412140000},{"user":"thinker","text":"Oh yeah of course! ","time":1650412148000},{"user":"helper","text":"alright give me a moment im just pulling them up","time":1650412169000},{"user":"helper","text":"1. How are you feeling now compared to when we started? ","time":1650412233000},{"user":"thinker","text":"Before we started, I felt pretty helpless and felt like there wasn't much that I could've done other than just sit and wait for the froggy pot (I don't know if this will be confusing to future people reading the review lol) to boil over, but now I feel like I have a lot more energy and confidence that I can change my actions and my own future. A much larger sense of control.","time":1650412352000},{"user":"helper","text":"2. Select all that apply:","time":1650412376000},{"user":"helper","text":"a. I felt heard and understood","time":1650412392000},{"user":"helper","text":"b. I have a better understanding of myself (thoughts, feelings, behavior)","time":1650412397000},{"user":"helper","text":"c. I have a new thought that feels true to me","time":1650412404000},{"user":"helper","text":"d. I would recommend this service to others","time":1650412410000},{"user":"helper","text":"e. I believe this new thought will work and positively change my behavio","time":1650412416000},{"user":"thinker","text":"Ooh, all of them apply! a b c d e. I've already sent the site to a friend of mine just in case they feel they'd need it or would like to send it to someone who needs it","time":1650412468000},{"user":"helper","text":"3. How would you rate your helper? (1 is unhelpful, 5 is great)","time":1650412490000},{"user":"thinker","text":"5, wonderful to bounce my thoughts off of and really helpful :) Also good at rephrasing my words so they make more sense to me","time":1650412525000},{"user":"helper","text":"4. How would you rate the session overall? (1 is unhelpful, 5 is enlightening)","time":1650412535000},{"user":"thinker","text":"5, I really don't know how I didn't see my fallacies and I feel like this really helped me understand a lot better","time":1650412574000},{"user":"helper","text":"Alright this is the last one I promise","time":1650412586000},{"user":"helper","text":"6. How much would you pay for this session?","time":1650412596000},{"user":"helper","text":"^this is just for our own reference btw","time":1650412621000},{"user":"thinker","text":"Ohhh, I'm just a student currently but I'd gladly pay something within the $20-$30 range. CAD btw","time":1650412658000},{"user":"helper","text":"that's totally fine btw! we developed this because we want to make services like this accessible to anyone who wants and needs it","time":1650412694000},{"user":"helper","text":"Ok one quick thing (and this is no pressure at all btw), but would you be open to having this session be viewed by others? Many people may benefit from similar experiences. ","time":1650412745000},{"user":"thinker","text":"Oh yeah of course! I'm glad to. Also, the mention of people having been through the same thing has really made me think so yeah, for sure!","time":1650412790000},{"user":"helper","text":"Great, I dont think there were any personal details disclosed, but we'll definitely make sure annonymity aspect stays in tact","time":1650412818000},{"user":"thinker","text":"awhh thank you so much :)","time":1650412826000},{"user":"helper","text":"of course! Thanks for taking the time to be here today and sharing your experiences with me. Have a great rest of your day, bye now! :)","time":1650412850000},{"user":"thinker","text":"You too, bye!! Have a great day.","time":1650412859000}]}