{"notes":{"event":"Exam on Monday.","behaviors":"Sleep late\ndistract from the task & avoid the task","thought":"I'm behind\n\nI won't be able to cover it all\n\ndistractions don't take away from what I still have to do eventually \n\nI need to not distract myself\n\nI have emptiness in not accomplishing what I know I should be","feelings":"overwhelmed\nhelpless\nunmotivated\nalone","labels":{"control-fallacy":true,"should-statement":true},"new_thought":"It might take a lot of hours and be hard work but I enjoy this material and am capable of studying well during the next few days so that I do the best I can on this test, and any more that come up in the future\""},"messages":[{"user":"helper","text":"Hi, thanks for joining me here at cheese. What’s troubling you today? ","time":1628107309000},{"user":"thinker","text":"I have class in the morning and work from 2-6pm and I come home cook & eat. By the time I am done, I feel like there is not enough time to study and it stresses me out. And then I sleep super late without being actively productive and I get super tired and nap after class before work instead of taking time to maybe review there.","time":1628107396000},{"user":"helper","text":"Thank you for sharing with me, it sounds like you're really busy! ","time":1628107478000},{"user":"helper","text":"When you are feeling stressed out, for example I see you have an exam on monday, what thoughts come up for you that you feel keep you from working?","time":1628107519000},{"user":"thinker","text":"Well I have 3 weeks of material to go over in a only like 3 days in a half and I just feel extremely behind. ","time":1628107596000},{"user":"thinker","text":"I feel like I won't be able to cover it all and that very overwhelming. ","time":1628107617000},{"user":"helper","text":"I can imagine, that sounds like a lot and when we feel there just isn't enough hours in the day it can be hard to decompress and actually focus on the things we want to do","time":1628107671000},{"user":"helper","text":"I'll be taking notes on the right hand side by the way, just let me know if anything feels incorrect :)","time":1628107700000},{"user":"thinker","text":"ok ","time":1628107704000},{"user":"thinker","text":"yes that's exctly it what you said earlier ","time":1628107717000},{"user":"helper","text":"I suffer from this sometimes as well, procrastinating can be so welcome in the moment but when it comes to crunch time it feels very chaotic and stressful","time":1628107762000},{"user":"helper","text":"tell me, what other feelings come up for you when you come home from work and after cooking stay up late without being productive","time":1628107793000},{"user":"thinker","text":"besides feeling helpless I am ussually under-motivated and feel a little alone ","time":1628107819000},{"user":"thinker","text":"i usally try to find other things that will keep me doing things like cleaning or exercising trying to get motivated but also distract myself and to no feel alone I usually try to watch something like a show and it helps calm me but it doesn't take away what I still have to do eventually ","time":1628107928000},{"user":"thinker","text":"the night just gets closer and I lose more time and thats how I sleep late cause I'll try to start studying towards the end and end up going past my bedtime but I also don't do a lot towards the end ","time":1628108004000},{"user":"helper","text":"I can certainly see a pattern forming here... you have a lot of work to cover but you also require some decompressing time, which is natural as a human, but during this time you start thinking and becoming overwhelmed by how much work is still left to do that it becomes difficult to sit down and focus so you end up distracted and only completing a little work before going to bed very late, waking up very late, and the cycle repeats with what seems no time for purposeful rest","time":1628108105000},{"user":"helper","text":"Am I understanding correctly?","time":1628108112000},{"user":"thinker","text":"Yes ","time":1628108114000},{"user":"thinker","text":"thats very ture ","time":1628108120000},{"user":"helper","text":"Good, it's important to recognize these cycles so that we can see how to break them :) ","time":1628108146000},{"user":"helper","text":"Tell me, what is most troubling about this to you? I've included some thoughts on the right that seem to be most prevalent but if their are others please feel free to introduce those now","time":1628108183000},{"user":"thinker","text":"What I see is that I am trying to balance between trying to feeling good and motivated and productive by doing other things but not doing what I need to do which can make me feel that way too. But I feel like also need to not distract myself but like you said have some decompressing time ","time":1628108371000},{"user":"helper","text":"Balance is very important. I can see that you value that, as well as being productive and enjoying that \"Feel good at motivated\" Emotion which can be so rewarding. But you get some doses of it in the distraction from the true task and ultimately this reward comes in a little bit empty, since the big one still lies over your head. Perhaps this is contributing to the lonely feeling you mentioned earlier. A dissatisfaction of sorts. Is that right?","time":1628108471000},{"user":"thinker","text":"yeah that can be it actually, i thought that it was related to living alone for the summer. but I have so much support from family and friends that I didnt really understand why I felt alone but it could be that I have that emptiness in terms of not accomplishing what I know I should be and what I want because its not forced I do like what I am studying ","time":1628108631000},{"user":"helper","text":"That's really interesting. And I'm glad to hear you like what you are studying! It is good to remember that these seemingly impossible tasks are still ultimately something we desire, something we'd like to have accomplished. This is so important when working so hard","time":1628108693000},{"user":"helper","text":"And It is good that you have and recognize a powerful support system. I'm really glad to hear this. ","time":1628108713000},{"user":"helper","text":"I think having these thoughts about feeling unaccomplished and unproductive can definitely aid in a feeling of emptiness and loneliness, even if you are in fact doing quite a lot. It is in how we view ourselves. ","time":1628108784000},{"user":"helper","text":"I think we have a lot to go off of here, and have already begun to start picking apart some of the patterns that have weeded their way into your life. Let's see if we can dig in a little deeper!","time":1628108829000},{"user":"helper","text":"First I'm going to do one more summary of what we have learned so far, if you're ready?","time":1628108842000},{"user":"thinker","text":"i am ready ","time":1628108886000},{"user":"helper","text":"Great :)","time":1628108894000},{"user":"helper","text":"So you are very busy! You have class every morning, a short break, work, and then a significant amount of studying to do because you have an exam coming up on Monday. This exam required about 3 weeks of preparation but unfortunately there is only a few days left and you feel unprepared. In the short hours that you have to study, you think \"I won't be able to cover it all\" .. you sometimes find other methods of productivity, or distractions, but in those times you have thoughts such as \"I need to not distract myself\" And \"I'm not accomplishing what I know I should be.\" These are very stressful thoughts to have. You begin to feel overwhelmed, helpless, unmotivated, and ultimately empty and alone because the lack of satisfaction with yourself. When you feel this way, you continue to distract from the task and avoid the task, you go to bed late, wake up late, and even nap during the day because you are so tired from these exhausting stressful hours. Then it seems there is even less time to study for this big upcoming exam and so the stress cycle continues. ","time":1628109192000},{"user":"helper","text":"Did I miss anything, does this feel true to you?","time":1628109203000},{"user":"thinker","text":"It feels very true to me. ","time":1628109211000},{"user":"helper","text":"I'm glad I'm understanding you","time":1628109234000},{"user":"helper","text":"First, this is all very natural. Having a big task ahead, something we truly want and desire, but choosing distractions and watching the time slip away is an unfortunate human crisis. I'm sorry you're experiencing this and I hope that after the test and some of it will naturally ease, but in the meantime, there are other tools we can use to help kick start your productivity, and ultimately your acceptance of yourself as well","time":1628109329000},{"user":"helper","text":"What I'm going to do now is discern the \"cheese\" In your thoughts","time":1628109355000},{"user":"helper","text":"Cheese is thought patterns that everyone can experience from time to time, but they can be limited in their perception and take us farther from our goals","time":1628109385000},{"user":"helper","text":"if you'd like to see what I'm looking at, you can click the little cheeseburger icon on the right","time":1628109405000},{"user":"helper","text":"Ready? ","time":1628109427000},{"user":"thinker","text":"yes ","time":1628109450000},{"user":"helper","text":"Great! ","time":1628109456000},{"user":"helper","text":"First, I chose control fallacy. This means to see ourselves as a helpless victim rather than recognizing where we have control. I chose this cheese because I see in some of your thinking that your cycle, and this busy lifestyle, have swept you up without your permission or control. (and certainly, some things *are* out of our control) But for example, when you have the thought \"I won't be able to cover it all\" You immediately feel incredibly helpless. In fact, there is probably no point in trying when a task is impossible, when you feel so far behind. So though some things may have to be glossed over, you do still have the ability to believe in yourself and your productivity. When you feel helpless and unmotivated, you won't want to work.. which creates the cycle of the task looming closer and becoming larger and more difficult, strengthening the thoughts that you can't do it. ","time":1628109678000},{"user":"helper","text":"By recognizing what you *can* do, we begin to feel powerful rather than helpless, and ultimately get more done ( even if it isn't everything) Does that make sense?","time":1628109708000},{"user":"thinker","text":"yes that does. I like what you said about \"getting more done even if it isnt everything\" ","time":1628109730000},{"user":"thinker","text":"that seems possible hehe ","time":1628109738000},{"user":"helper","text":"yeah! ","time":1628109745000},{"user":"helper","text":"The other cheese here I think will help you too, this is one of my favorites. It is called \"Should Statements\" ","time":1628109768000},{"user":"helper","text":"This means to use words like \"should\" or \"must\". Expecting something of ourselves regardless of the specific case. Not accepting how the world is. ","time":1628109808000},{"user":"helper","text":"I like to think of it the way David Burns describes it in his book","time":1628109848000},{"user":"helper","text":"imagine a kid is sitting in his very messy room, and just decided \"you know what, I think I'd like to clean my room now.\" And is just about to get up and do it when his mother walks and yells.. \"What is this?? You're living in filth! Get up and clean this minute! Disgusting!\"","time":1628109918000},{"user":"helper","text":"Do you think the kid is going to feel motivated to clean his room after that? Or will he sit back and be resentful.. even though he'd just decide that was what he wanted for himself!","time":1628109948000},{"user":"helper","text":"We all have this mother in our minds occasionally. When you have the thoughts \"I need to not distract myself\" \"I'm not accomplishing what I know I should be\" You playing a taskmaster and actually making it more difficult to achieve what you truly desire, which is studying and being productive and doing well on this exam. You forget that you want that, because you are so busy distracting yourself and then punishing for it. This even leads to emptiness and loneliness because you have become separated from your goals and the true feeling of motivation, which I can see from much of our conversation you value. ","time":1628110068000},{"user":"helper","text":"So in these distractions you go to bed late, wake up late, feel more and more exhausted and the should voice only gets louder and so the cycle continues. ","time":1628110095000},{"user":"helper","text":"This can be helpful to recognize because when we step back and think about what we *want* not what we \"have to do\".. we can sometimes find they are actually one and the same, and productivity becomes much simpler and enjoyable","time":1628110209000},{"user":"helper","text":"What do you think?","time":1628110212000},{"user":"thinker","text":"Thats true. I think \"should\"puts too much pressure even though the task is something I want just like the boy example. ","time":1628110264000},{"user":"helper","text":"exactly!","time":1628110273000},{"user":"helper","text":"You even do things like exercise and clean your room, which I know for myself can be difficult and easy to postpone as well, you enjoy being productive and fulfilled, but there has been a wall of should statements built between you and your goals that make it so undesireable","time":1628110325000},{"user":"helper","text":"do you think that we can drop away some of this control fallacy and should statement thoughts and exchange them for more encouraging and self fulfilling thoughts that will help you reach your goals?","time":1628110380000},{"user":"thinker","text":"Yes definitely! I’d like to do that. ","time":1628110383000},{"user":"helper","text":"Sweet :D","time":1628110388000},{"user":"helper","text":"So let's think about what you *do* value, in studying for this exam, how it may be a little close but you are still incredibly capable and this is something you truly want for yourself. ","time":1628110428000},{"user":"helper","text":"I like the new thought to be patient and kind :) ","time":1628110450000},{"user":"helper","text":"give her a go!","time":1628110454000},{"user":"thinker","text":"I’d like to be kinder to myself when I get back to work. I am looking forward to studying and connecting some of the lecture material that overlap and find the patterns to help me retain the material. ","time":1628110670000},{"user":"helper","text":"Nice, does this feel true to you? That you are looking forward to connecting the lecture material? I just want to be sure because the new thought is understanding of the whole truth, it is \"accepting of how the world is\" ","time":1628110745000},{"user":"helper","text":"For example, \"It might take a lot of hours and be hard work but I enjoy this material and am capable of studying well during the next few days so that I do the best I can on this test, and any more that come up in the future\"","time":1628110785000},{"user":"helper","text":"I think that's great!","time":1628110808000},{"user":"thinker","text":"Oh I see, that makes more sense. I was struggling trying to be patient and kind with myself. But I like that w","time":1628110854000},{"user":"helper","text":"It is hard to learn to be patient with ourselves, but it starts by being honest. You are very busy, and some hours may be hard and consuming, but I think we can help you to feel less overwhelmed and helpless by remembering that you can do it anyway, that you *want* to do it anyway, even if in the moment it feels like a lot. this way it can help to feel more bite sized and worthwhile","time":1628110939000},{"user":"helper","text":"Do you want to use the new thought I just wrote? Does it feel accepting and true?","time":1628110953000},{"user":"thinker","text":"Yes. I like it! ","time":1628110956000},{"user":"helper","text":"Great :)","time":1628110970000},{"user":"helper","text":"What feelings come up for you when you think this new thought \"It might take a lot of hours and be hard work but I enjoy this material and am capable of studying well during the next few days so that I do the best I can on this test, and any more that come up in the future\"?","time":1628110982000},{"user":"thinker","text":"I feel a little more relaxed and calm. I smiled after reading it, which is good! ","time":1628111013000},{"user":"helper","text":"that is good! ","time":1628111018000},{"user":"helper","text":"And how do you feel now, compared to when we started?","time":1628111028000},{"user":"thinker","text":"I can see where I was struggling and how I was a little blind but now I can see myself and what I was doing that could have been contributing  to my sisters. ","time":1628111106000},{"user":"helper","text":"Sisters?","time":1628111118000},{"user":"thinker","text":"stress* ","time":1628111136000},{"user":"helper","text":"aha :)","time":1628111139000},{"user":"thinker","text":"Freudian slip maybe by auto correct ","time":1628111152000},{"user":"helper","text":"hmm.. curiosu","time":1628111154000},{"user":"helper","text":"I'm glad that you have been able to zoom out a little to where you struggling and find ways to reconsider everything. Remember, this new thought works best by repetition so whenever you are thinking to sit down to work and study, consider it with this new thought in mind \"It might take a lot of hours and be hard work but I enjoy this material and am capable of studying well during the next few days so that I do the best I can on this test, and any more that come up in the future\" And I think you will ultimately feel more motivated and fulfilled! Best of luck (and strength/talent/intelligence) on your upcoming test. I'm sure you'll do great!","time":1628111269000},{"user":"thinker","text":"Thank you. I really appreciate your time. This was very helpful. I needed it. ","time":1628111315000},{"user":"helper","text":"You're so welcome :) I enjoyed our conversation! If you'd like to discuss this more, or anything else that may be troubling you, please feel free to return any time","time":1628111351000},{"user":"helper","text":"By the way, as we are building our company we like to ask if we may make this session public? It will remain anonymous of course but I believe the lessons we learned today will be valuable to others as well :)","time":1628111394000},{"user":"thinker","text":"Yes. That’s okay. I am okay with that. ","time":1628111432000},{"user":"helper","text":"Thank you! Have a good day and I hope we see you again soon.","time":1628111443000},{"user":"thinker","text":"Thank you! Have a nice day as well. Until next time. ","time":1628111514000}]}