{"notes":{"event":"I'm stuck and incapable of making decisions even for basic life tasks\n\ngrowing up with an overprotective mother who often would decide things for me\n\nhaving to make a decision of my own","thought":"I'm worthless, I'm incompetent\n\nI'm stuck and incapable of finding help\n\nI'll never accomplish anything I wanted like this because I have to keep distracting myself from those needs which takes up a lot of energy.\n\nUgh why can't this just be easier\nUgh I don't know what to do, whatever let's do nothing","feelings":"hatred\nanger\n\nguilt\npain\nsad\n\nhelpless\nangry\nfrustrated","behaviors":"Giving up easily\nStaying in my room\nthinking \"I'm not worth fighting for\"","labels":{"blaming":true},"new_thought":"Going out into the world is too much for me right now"},"messages":[{"user":"thinker","text":"I feel completely stuck and unable to do anything. I struggle to complete basic tasks like brushing my teeth, and can't ever seem to get myself to do actually hard thing like looking for a therapist or asking my parents to take me to the dentist. I'm paralyzed with fear whenever I even think about doing any of those things. Yet I also feel a lot of guilt for not doing them and this guilt doesn't let me do anything else either, so I can't do anything that would give me some energy or let me relax. This results in me being completely stuck and just spending all my days distracting myself. I don't know what to do at this point, I need help.","time":1675383434000},{"user":"helper","text":"Hi there welcome to cheese!","time":1675461626000},{"user":"helper","text":"thanks for coming","time":1675461629000},{"user":"thinker","text":"Hello!","time":1675461631000},{"user":"helper","text":"sorry to hear you've been so stuck","time":1675461645000},{"user":"helper","text":"and a good action to seek some help!","time":1675461655000},{"user":"thinker","text":"Yeah, I suppose... I don't know if it's going to help much, but hopefully it might be useful.","time":1675461690000},{"user":"helper","text":"sure, I mean in general the reaching out for help","time":1675461704000},{"user":"helper","text":"alright... and so as you're here I hear that you've been quite stuck struggling to take care of yourself ","time":1675461737000},{"user":"thinker","text":"Yeah, pretty much.","time":1675461745000},{"user":"helper","text":"and do you remember when this started?","time":1675461761000},{"user":"thinker","text":"Hmm... I'm not sure, the pattern itself, of being kind of helpless and unable to care for myself has been a thing since I was young, I think. But it got worse this year to the point that it's really debilitating now, I guess.","time":1675461806000},{"user":"helper","text":"and whats a ballpark of your age ?","time":1675461825000},{"user":"thinker","text":"I'm in my mid twenties.","time":1675461829000},{"user":"helper","text":"k thanks","time":1675461832000},{"user":"helper","text":"are there particular things that happen that you notice make you feel this way?","time":1675461853000},{"user":"thinker","text":"Having to make any sort of decision on my own makes me feel really helpless.","time":1675461865000},{"user":"thinker","text":"Even something as simple as picking what food I'm going to eat on a given day can trigger this feeling.","time":1675461881000},{"user":"helper","text":"I can relate to this and how it can wear one down, even basic decisions","time":1675461896000},{"user":"helper","text":"that \"should be\" easy ","time":1675461912000},{"user":"helper","text":"but are not","time":1675461915000},{"user":"thinker","text":"True, I'm not sure how other people can manage so many things.","time":1675461931000},{"user":"helper","text":"yeah... ","time":1675461934000},{"user":"helper","text":"when you notice something like this - you having trouble making decisions of your own - - what do you find yourself thinking?","time":1675461955000},{"user":"thinker","text":"Well my thoughts in such a scenario usually go something like \"Ugh why can't this just be easier\" or \"Ugh I don't know what to do, whatever let's do nothing\".","time":1675461986000},{"user":"helper","text":"and when you think those thoughts what do you feel emotionally?","time":1675462005000},{"user":"thinker","text":"I feel angry and frustrated, usually.","time":1675462012000},{"user":"helper","text":"makes sense","time":1675462017000},{"user":"helper","text":"so you find yourself having to make a decision of your own - you think to yourself - \"ugh why can't this just be easier\" and \"ugh I don't know what to do, whatever... lets do nothing...\" and you then feel angry... frustrated ","time":1675462075000},{"user":"helper","text":"does this feel true?","time":1675462079000},{"user":"thinker","text":"Mostly, I would say it's more accurate to describe it as feeling helpless first and then angry and then having a thought. And often times the thoughts aren't clear like what I wrote down, it might just be \"Ugh\" and that's it.","time":1675462113000},{"user":"helper","text":"yeah","time":1675462121000},{"user":"helper","text":"makes sense","time":1675462123000},{"user":"helper","text":"so the ugh part is already a state of helplessness ","time":1675462139000},{"user":"helper","text":"yes?","time":1675462140000},{"user":"thinker","text":"What do you mean?","time":1675462148000},{"user":"helper","text":"that the moment you notice you have to make a decision or have a decision to make - you immediately feel helpless and think to yourself Ugh","time":1675462179000},{"user":"thinker","text":"Oh, not quite, when I have to make a decision I instantly feel helpless, yes, but the \"Ugh\" or frustration usually comes after a few minutes of deliberating what to do. ","time":1675462199000},{"user":"helper","text":"go ahead...ahhh ok","time":1675462200000},{"user":"helper","text":"so it seems that there is a compressed helplessness when having to make a decision","time":1675462234000},{"user":"thinker","text":"Compressed?","time":1675462241000},{"user":"helper","text":"meaning - events, decisions to make are neutral in themselves - but there's a whole story in there that involves parts of who you are or have learned to be that ","time":1675462286000},{"user":"helper","text":"go ahead","time":1675462289000},{"user":"thinker","text":"I would say so, yes. The events can be anything but they still trigger the same feeling, so I think it's basically like a learned thing for me. And it's not triggered by like a specific type of event or decision or anything.","time":1675462317000},{"user":"helper","text":"aha...do you know where you learned this?","time":1675462325000},{"user":"thinker","text":"I don't really know but I imagine it was from my parents, since my mother was rather overprotective and would often decide things for me.","time":1675462343000},{"user":"helper","text":"ahh ok","time":1675462350000},{"user":"helper","text":"when I read this from you I imagine myself as a kid having someone make decisions for me in an overprotective manner and that yes nurturing a state of helplessness","time":1675462378000},{"user":"thinker","text":"Yeah that makes sense.","time":1675462388000},{"user":"helper","text":"there is a little clarity there and so to get to more clarity are you willing to experiment a bit here with following that as an event","time":1675462422000},{"user":"helper","text":"the event of your mother being overprotective as relating to this piece of how you live having to make decisions?","time":1675462445000},{"user":"thinker","text":"Sure, I suppose.","time":1675462456000},{"user":"helper","text":"is there a particular memory that is cropping up with this theme with your mother?","time":1675462484000},{"user":"helper","text":"or just a general chunk of memories","time":1675462494000},{"user":"thinker","text":"Hmm... I don't have anything in particular popping up, just a general \"theme\".","time":1675462510000},{"user":"helper","text":"thanks for checking","time":1675462539000},{"user":"helper","text":"okay so as you imagine this past of having an overprotective mother deciding things for you - what thoughts come up in relation to that?","time":1675462579000},{"user":"helper","text":"go ahead....","time":1675462596000},{"user":"thinker","text":"Oh well I'm not entirely sure if I have any thoughts coming up... maybe something like \"I wish I had someone to decide things for me again\"?","time":1675462613000},{"user":"helper","text":"okay","time":1675462620000},{"user":"helper","text":"yeah trying thoughts out can be helpful sometimes","time":1675462632000},{"user":"helper","text":"how does that thought \"I wish I had someone to decide things for me again\" feel to you now?","time":1675462647000},{"user":"helper","text":"as you think of that past in relation to your trouble with decisions","time":1675462664000},{"user":"thinker","text":"I guess it feels comforting to me.","time":1675462672000},{"user":"helper","text":"yeah it makes sense","time":1675462689000},{"user":"helper","text":"and good job listening inside you for that thought","time":1675462697000},{"user":"helper","text":"seems to me like you're connecting to a thought that has potential to meet some needs for support that you've been experiencing","time":1675462723000},{"user":"helper","text":"does that feel connected to you?","time":1675462739000},{"user":"thinker","text":"Well I guess I feel a sort of despair when you say that because it's not like I can meet my own needs...","time":1675462764000},{"user":"thinker","text":"So I don't really know...","time":1675462772000},{"user":"helper","text":"so the thought feels a bit comforting but then thinking about trying to make that comfort happen brings up despair because you don't see a way to meet your own needs?","time":1675462804000},{"user":"thinker","text":"Yeah, like if someone came along that would meet that need for me randomly, that would be nice, but I'm incompetent and so I don't think I can find someone like that on  my own. I mean, I've been looking for a therapist for a year and I still haven't found anyone...","time":1675462841000},{"user":"helper","text":"I'm sorry to hear that","time":1675462850000},{"user":"helper","text":"looking for a therapist should not be this hard","time":1675462857000},{"user":"helper","text":"I know of many people who experience that difficulty","time":1675462868000},{"user":"thinker","text":"Yeah, it feels unfair that it's so hard to find one.","time":1675462871000},{"user":"helper","text":"I can imagine","time":1675462879000},{"user":"helper","text":"thanks for sharing","time":1675462884000},{"user":"helper","text":"here at cheese we are trained peers looking to make help more accessible in the world","time":1675462908000},{"user":"helper","text":"and part of that is this space to hopefully feel heard ","time":1675462922000},{"user":"thinker","text":"Yeah, I like your guys' mission statement.","time":1675462930000},{"user":"helper","text":"me too ","time":1675462938000},{"user":"helper","text":"okay so it seems like we touched the crux or an important kind of acupuncture point or block - this part of thinking/experiencing yourself stuck and incapable of finding help","time":1675463002000},{"user":"thinker","text":"Yeah, I guess this is probably the crux of it.","time":1675463015000},{"user":"helper","text":"what do you find yourself thinking when you think of this event \"I'm stuck and incapable of finding help\"","time":1675463053000},{"user":"helper","text":"I heard some before about how it feels unfair","time":1675463077000},{"user":"thinker","text":"Hmm... this doesn't really feel unfair I guess, I just feel sad about it? It's kind of unfortunate.","time":1675463099000},{"user":"helper","text":"sorry I was missing something here","time":1675463140000},{"user":"helper","text":"seems like the event is you being stuck","time":1675463155000},{"user":"helper","text":"and the thought is \"I'm stuck and incapable of finding help\"","time":1675463168000},{"user":"thinker","text":"Oh.","time":1675463174000},{"user":"thinker","text":"Yeah, I guess that seems accurate. ","time":1675463196000},{"user":"helper","text":"glad to hear it","time":1675463225000},{"user":"helper","text":"okay so you notice yourself being stuck and incapable of making decisions even for basic life tasks.... you think to yourself - \"I'm stuck and am incapable of finding help\" and then you feel sad... helplesss.... angry and frustrated","time":1675463277000},{"user":"helper","text":"does that feel true?","time":1675463280000},{"user":"thinker","text":"I suppose so. ","time":1675463299000},{"user":"helper","text":"seems like there is part that feels true","time":1675463308000},{"user":"helper","text":"is there part that is confusing or something else?","time":1675463319000},{"user":"thinker","text":"Well the \"incapable\" part, I know, is logically not true... so I guess that's throwing me off. But emotionally I think I do feel like I'm incapable of it.","time":1675463340000},{"user":"helper","text":"ahhh yeah... that makes sense","time":1675463345000},{"user":"helper","text":"I'm glad to hear you can feel yourself at those different dimensions","time":1675463355000},{"user":"helper","text":"that is a sign of health to me","time":1675463359000},{"user":"helper","text":"that you can sense there is a part of you that is thinking \"I'm incapable\" but that there is a bigger picture you that knows more","time":1675463388000},{"user":"thinker","text":"Yeah that is usually frustrating for me when making decisions because the \"bigger part\" is rarely the one in control. ","time":1675463407000},{"user":"helper","text":"ahhh yes... I can imagine","time":1675463408000},{"user":"helper","text":"so if you could shift the locust of control","time":1675463419000},{"user":"thinker","text":"That would be painful I think, I'd rather not be in control of anything, for some reason.","time":1675463436000},{"user":"helper","text":"ahhh.... thank you for your transparency","time":1675463445000},{"user":"helper","text":"lets stay with this part","time":1675463449000},{"user":"helper","text":"what's painful about having more control?","time":1675463465000},{"user":"helper","text":"sure.. go ahead...","time":1675463487000},{"user":"thinker","text":"Well I'm not sure if this is it or not but what comes up first for me is that if I were in control, I would be responsible for all my mistakes, and that would be very painful. ","time":1675463497000},{"user":"helper","text":"alright... that makes sense logically","time":1675463512000},{"user":"helper","text":"how does it feel emotionally as you write it/look it over","time":1675463527000},{"user":"thinker","text":"I don't know if it really \"clicks\" with me...","time":1675463542000},{"user":"helper","text":"yeah... can you feel the part that experiences pain?","time":1675463555000},{"user":"helper","text":"the pain that came up when imagining taking more control?","time":1675463566000},{"user":"thinker","text":"Yeah I am feeling the pain right now.","time":1675463569000},{"user":"helper","text":"if the pain could speak, what would it say?","time":1675463579000},{"user":"helper","text":"if it has words","time":1675463592000},{"user":"thinker","text":"I don't know... I just want to cry. But I'm not sure what the pain would say, it's not like I can ask it like a person.","time":1675463607000},{"user":"helper","text":"it might be on the other side of the tears/crying","time":1675463621000},{"user":"thinker","text":"I'm on the verge of crying but not quite able to though. ","time":1675463631000},{"user":"helper","text":"I'm familiar with that kind of experience","time":1675463646000},{"user":"thinker","text":"Oh I think the pain is guilt, to be more precise. Like, guilt for not having led a more... authentic? life or something? ","time":1675463669000},{"user":"helper","text":"alright, yeah what do you notice as you write that last part about I feel guilt for not having led a more... authentic/something life?","time":1675463701000},{"user":"thinker","text":"I feel like I betrayed myself in some way, I guess.","time":1675463717000},{"user":"helper","text":"how did you betray yourself?","time":1675463732000},{"user":"thinker","text":"By being too afraid to take responsibility for my inner child's needs and just running away from them with distractions the whole time.","time":1675463754000},{"user":"helper","text":"that brings sense to the words guilt/pain ","time":1675463774000},{"user":"helper","text":"so you notice now that you were too afraid of taking responsibility for your inner child's needs and because of the fear just ran away from them with distractions","time":1675463816000},{"user":"thinker","text":"Yeah. And I'm still afraid.","time":1675463826000},{"user":"helper","text":"okay... lets stay with this part of the fear if you can","time":1675463848000},{"user":"helper","text":"whats scary?","time":1675463853000},{"user":"helper","text":"okay","time":1675463861000},{"user":"thinker","text":"Hmm well actually it's more like hate than fear maybe. I hate my inner child for burdening me with all these needs I can't even meet. ","time":1675463867000},{"user":"helper","text":"aha...okay","time":1675463873000},{"user":"helper","text":"so you feel hate towards your inner child for burdening you with all these needs you can't even meet","time":1675463893000},{"user":"thinker","text":"Yeah. And I'm angry at it too.","time":1675463901000},{"user":"helper","text":"what do you notice as you let yourself feel and express this","time":1675463927000},{"user":"thinker","text":"Hmm.. I think I feel a bit of relief but also a bit of desperation or hopelessness. ","time":1675463960000},{"user":"helper","text":"what is the relief about?","time":1675463968000},{"user":"thinker","text":"The fact that I don't have to care for my inner child's needs, screw that guy.","time":1675463982000},{"user":"helper","text":"aha","time":1675463985000},{"user":"helper","text":"okay","time":1675463986000},{"user":"helper","text":"and then whats the desparation/hopelessness about?","time":1675463994000},{"user":"thinker","text":"I guess I just feel like I'm trapped again. Like I'm never going to get anywhere like this.","time":1675464020000},{"user":"helper","text":"yeah makes sense","time":1675464032000},{"user":"helper","text":"because you get to distance yourself ","time":1675464039000},{"user":"helper","text":"but then he's still there","time":1675464042000},{"user":"helper","text":"yes?","time":1675464046000},{"user":"thinker","text":"Yeah, and it's like, I'll never accomplish anything I wanted like this because I have to keep distracting myself from those needs, which takes up a lot of energy.","time":1675464073000},{"user":"helper","text":"do you see the notes on the right?","time":1675464109000},{"user":"thinker","text":"Yes.","time":1675464113000},{"user":"helper","text":"what do you notice as you read them?","time":1675464121000},{"user":"thinker","text":"I feel like I'm kind of a mess.","time":1675464141000},{"user":"helper","text":"thank you for sharing so closely","time":1675464169000},{"user":"helper","text":"I feel you being real with me","time":1675464177000},{"user":"helper","text":"and I hope to give you a feeling of there's someone real here with you too","time":1675464196000},{"user":"thinker","text":"Thank you, I do feel like I'm being listened to, which is nice.","time":1675464210000},{"user":"helper","text":"I'm glad to hear thanks for sharing that","time":1675464219000},{"user":"helper","text":"okay so it seems like the point of power now as elucidated by what you've shared with your inner child is that you've been stuck with him needing hungry for attention and being afraid of facing that part of you","time":1675464287000},{"user":"helper","text":"so much so that you have been living distracting yourself and that world of distraction its own prison keeping you from being able to accomplish what you wish for","time":1675464326000},{"user":"thinker","text":"Yeah.","time":1675464332000},{"user":"helper","text":"and not just the fear but also the hatred and anger","time":1675464347000},{"user":"thinker","text":"Yeah I have a lot of resentment pent up within me.","time":1675464365000},{"user":"helper","text":"can you let some of it out here?","time":1675464380000},{"user":"helper","text":"by writing it out expressing it to yourself or to whomever its directed to?","time":1675464397000},{"user":"thinker","text":"Maybe? I'm not really sure how to go about it. ","time":1675464408000},{"user":"helper","text":"you can imagine that on the other side of this chat is the part that you're angry at","time":1675464424000},{"user":"helper","text":"resentful towards","time":1675464431000},{"user":"helper","text":"and just let yourself speak it out in free to be innappropriate ways","time":1675464457000},{"user":"thinker","text":"Hmm, I feel like that would be a bit too inappropriate for this chat to be honest... this is the kind of thing I would do in my journal, not sharing it with anyone else...","time":1675464482000},{"user":"helper","text":"thank you for sharing that","time":1675464486000},{"user":"helper","text":"i do think I know what you're talking about","time":1675464497000},{"user":"helper","text":"meaning the level of vulnerability","time":1675464504000},{"user":"helper","text":"and intensity","time":1675464508000},{"user":"helper","text":"I in my life have encountered self hatred towards different parts of myself","time":1675464524000},{"user":"helper","text":"and have experienced how unexpressed it can be a walll that keeps things how they are","time":1675464544000},{"user":"helper","text":"and I've had the blessing of a coulple, two times in my life where I was able to express this kind of pent up energy with someone and that it provided a different kind of relief than writing in my journal","time":1675464579000},{"user":"helper","text":"I'm not saying that you should do this here","time":1675464586000},{"user":"helper","text":"just sharing from my life what I've experienced","time":1675464595000},{"user":"thinker","text":"Yeah... I know it can be quite helpful to express things like this to other people. I don't have anyone to say things like that to though. So maybe I should do it here... but I'm scared for some reason.","time":1675464618000},{"user":"helper","text":"whats scary about it?","time":1675464622000},{"user":"thinker","text":"I feel like I would say something so horrible that you would be unable to help yourself and judge me for it. ","time":1675464640000},{"user":"helper","text":"I really appreciate how direct you're being with me","time":1675464655000},{"user":"helper","text":"I personally am not concerned about that","time":1675464672000},{"user":"helper","text":"I happen to have a past of dealing with parts of human experience that are very dark","time":1675464693000},{"user":"helper","text":":)","time":1675464722000},{"user":"thinker","text":"I see. I mean, I don't think it has anything to do with you, though. This is an anonymous chat anyways, it doesn't r eally matter if you judge me or not. But I'm still scared of it.","time":1675464724000},{"user":"helper","text":"thanks for sharing","time":1675464732000},{"user":"helper","text":"scared of me being unable t help myself","time":1675464747000},{"user":"helper","text":"maybe that part is reduced","time":1675464750000},{"user":"helper","text":"but that I would judge you?","time":1675464758000},{"user":"thinker","text":"Yeah, I meant that it's inevitable that you would judge me. Even though I don't actually think it is, but it feels like that.","time":1675464776000},{"user":"helper","text":"yeah","time":1675464778000},{"user":"helper","text":"do you think that you judge yourself about this?","time":1675464784000},{"user":"thinker","text":"Yeah, definitely.","time":1675464788000},{"user":"helper","text":"would you be open to sharing those?","time":1675464795000},{"user":"thinker","text":"Yeah, I hate how I hate myself if that makes sense.","time":1675464805000},{"user":"helper","text":"yes","time":1675464808000},{"user":"thinker","text":"I know it's not very helpful and I should just stop, but I guess I either don't care enough about becoming functional or I'm scared of something else and so I keep hating myself and hating the fact that I hate myself. ","time":1675464836000},{"user":"helper","text":"I feel how there is a part of you here that cares about the impact you have on life","time":1675464856000},{"user":"thinker","text":"Maybe.","time":1675464863000},{"user":"helper","text":"maybe a little","time":1675464866000},{"user":"helper","text":"and so you hate how you hate yourself","time":1675464887000},{"user":"helper","text":"how you can't stop yourself from hating yourself","time":1675464900000},{"user":"helper","text":"or haven't found a way to","time":1675464913000},{"user":"helper","text":"to want it enough or be able enough","time":1675464923000},{"user":"thinker","text":"Yeah, that. I feel like I'm just not being serious enough about this. Like I don't really want to be helped.","time":1675464945000},{"user":"helper","text":"direct honest thoughts like this is the only way I have found my way out of my prisons","time":1675464967000},{"user":"helper","text":"so why don't you want to be helped?","time":1675465012000},{"user":"thinker","text":"Because I have to keep hating myself, otherwise I'll be \"forced\" to acknowledge the inner child's needs, and I'm too afraid of doing that because having to meet those needs is a burden I can't handle. ","time":1675465047000},{"user":"helper","text":"okay... so hating yourself is prefered than the burden of having to meet the needs of your inner child","time":1675465081000},{"user":"thinker","text":"Yeah.","time":1675465084000},{"user":"helper","text":"what is that burden?","time":1675465088000},{"user":"thinker","text":"It's hard to say, I try to ignore listening to my needs as much as possible so I'm not even sure what they are. I would imagine it's something that involves socializing because that's something I'm very afraid of.","time":1675465120000},{"user":"helper","text":"so you have inferred that its a burden you can't handle","time":1675465139000},{"user":"helper","text":"and you think it could be because of fears of socializing ","time":1675465157000},{"user":"thinker","text":"Oh wait, I think it's not necessarily socializing, I think it's just doing anything that would be \"visible\" to my parents. Like, anything in the real world that they would find out about me doing. Because for some reason I'm really ashamed of them seeing me do anything.","time":1675465202000},{"user":"helper","text":"aha...ahhh okay","time":1675465203000},{"user":"helper","text":"thats the or a part of the burden ","time":1675465214000},{"user":"helper","text":"If I go out into the world and its seen by my parents I'll expeirence this horrible shame and so I'd prefer to hate myself","time":1675465245000},{"user":"thinker","text":"Yeah, exactly. And I'm afraid that some of my needs require me to go out into the world.","time":1675465251000},{"user":"helper","text":"yeah that makes sense","time":1675465254000},{"user":"helper","text":"I imagine that they do","time":1675465261000},{"user":"helper","text":"I'm so sorry whatever happened that landed you with so much shame in relation to your parents","time":1675465297000},{"user":"helper","text":"I know shame and how dehumanizing it can be","time":1675465314000},{"user":"helper","text":"actually more poisonous and difficult than dealing with hatred in some ways","time":1675465332000},{"user":"thinker","text":"Yeah, that sounds true.","time":1675465340000},{"user":"helper","text":"okay so... a pressure cooker has been happening... you are human... you have needs like everyone else... some of those needs challenge you to go out into the world... that means you have the risk of being seen by your parents.... and that is an overwhelming experience you are willing to avoid at intense costs including living in a stuck state of self hatred","time":1675465415000},{"user":"thinker","text":"Yes, precisely. ","time":1675465421000},{"user":"helper","text":"what creates the shame part? What happened with your parents?","time":1675465444000},{"user":"thinker","text":"I don't think it's any one event really, just constant shaming from my parents about every little thing. And like, not letting me do things on my own without constantly looking over me and providing criticism.","time":1675465474000},{"user":"helper","text":"aha... ohhhh... I'm sorry.... yeah the overprotective there","time":1675465484000},{"user":"helper","text":"I'm so sorry","time":1675465487000},{"user":"thinker","text":"Thanks...","time":1675465494000},{"user":"helper","text":"the least I can do fellow human","time":1675465504000},{"user":"helper","text":"so it sounds like your parents drilled shame into you","time":1675465539000},{"user":"helper","text":"and you now find yourself with the challenge of coming out into your life but then with that ceiling or that seed of shame present","time":1675465572000},{"user":"thinker","text":"Yeah, I just want to hide myself away.","time":1675465582000},{"user":"helper","text":"that makes sense","time":1675465601000},{"user":"helper","text":"when I've been shamed I've also wanted to hide away","time":1675465613000},{"user":"helper","text":"that seems like a healthy response to being shamed","time":1675465623000},{"user":"thinker","text":"Seems to be, yeah.","time":1675465631000},{"user":"helper","text":"I've found there is usually a criminalization in our pasts to parts of ourselves, diffferent responses like hiding away ","time":1675465664000},{"user":"helper","text":"and its in the process where we get to see the hiding away or whatever other parts/ reactions that we're struggling with that we can start to release ourselves from the bindings of stuckness","time":1675465695000},{"user":"helper","text":"does that feel connected here?","time":1675465702000},{"user":"thinker","text":"What do you mean by \"connected\", exactly? I'm not sure if I'm understanding right.","time":1675465720000},{"user":"helper","text":"do you feel connected with what i wrote?","time":1675465735000},{"user":"thinker","text":"Uhhh no? I don't think so?","time":1675465751000},{"user":"thinker","text":"I mean... what you're saying makes sense, but I have zero faith in being able to release myself from the stuckness, is what I mean.","time":1675465777000},{"user":"helper","text":"aha... thats makes sense","time":1675465783000},{"user":"helper","text":"yeah I talked I think about a process that is a big picture belief I hold but thank you for stating your experience ","time":1675465809000},{"user":"thinker","text":"Yeah... it's hard for me to see that far into the future.","time":1675465825000},{"user":"helper","text":"yeah","time":1675465825000},{"user":"helper","text":"makse sense","time":1675465830000},{"user":"helper","text":"so you were sharing about how there is this hiding away response to the shaming and in this case to the current adult life decisions ","time":1675465874000},{"user":"thinker","text":"Yeah, that's why I hide in my room most of the day.","time":1675465898000},{"user":"helper","text":"do you see yourself similar to how your parents saw you?","time":1675465944000},{"user":"thinker","text":"I'm not sure, I don't really know what they saw me as. And they probably see me differently now. ","time":1675465964000},{"user":"helper","text":"aha... there is this response like a strong echo of the shame they put on you","time":1675465988000},{"user":"thinker","text":"It would make sense for me to see myself the way they saw me when they raised me, I do imagine.","time":1675466011000},{"user":"helper","text":"yeah I've found that in me","time":1675466017000},{"user":"helper","text":"with my parents","time":1675466021000},{"user":"helper","text":"what does that perspective say about who you are?","time":1675466051000},{"user":"thinker","text":"A product of my circumstances?","time":1675466066000},{"user":"helper","text":"yeah and more specifically what is the belief that you learned to believe in yourself as a response to the shaming from your parents","time":1675466107000},{"user":"helper","text":"?","time":1675466111000},{"user":"thinker","text":"\"I'm worthless\" or \"I'm incompetent\"?","time":1675466120000},{"user":"helper","text":"makes sense","time":1675466128000},{"user":"helper","text":"I'm sorry that they gave that to you","time":1675466145000},{"user":"helper","text":"when you think the thought I'm worthless/incompetent\" what do you feel?","time":1675466175000},{"user":"thinker","text":"Hmm... I don't really know.","time":1675466197000},{"user":"helper","text":"some of the feelings already listed?","time":1675466215000},{"user":"thinker","text":"I guess I just feel sad, or that it's unfortunate. ","time":1675466226000},{"user":"helper","text":"yeah","time":1675466227000},{"user":"helper","text":"and what do you find yourself doing or not doing in reaction or response?","time":1675466244000},{"user":"thinker","text":"Giving up easily, I guess.","time":1675466255000},{"user":"helper","text":"and that part connects with the hiding away","time":1675466309000},{"user":"thinker","text":"A little bit, I suppose.","time":1675466336000},{"user":"thinker","text":"Like, I feel like I'm not worth fighting for. ","time":1675466354000},{"user":"helper","text":"as I follow the story you've shared I see - you find yourself in this time of your life stuck incapable of making decisions - you notice how this connects to how you prefer to hate yourself than to meet the needs of your inner child like going out in the world. And you prefer that because of the shaming and overprotectiveness that you grew up around. You notice all of that and thoughts that come up like I'm worthless, I'm incompetent\" in relation to your parents - and I'll never accomplish anything I wanted like this  - in relation to your inner child - and \"why can't this just be easier or I don't know what to do\" in relation to your current life decisions - and after thinking those thoughts you feeling a diversity of feelings from hatred  to anger, guilt, frustration, pain sadness helplessness.... from those feelings you then reasonably to me.... you end up giving up easily, you stay in your room and you assert that you're not worth fighting for.   ","time":1675466652000},{"user":"helper","text":"Does this make sense?","time":1675466659000},{"user":"thinker","text":"Yeah, that's a good summary of what it's like.","time":1675466667000},{"user":"helper","text":"how does it make you feel to be with me here?","time":1675466690000},{"user":"thinker","text":"It feels validating, like it makes sense why I've struggled so much now.","time":1675466706000},{"user":"helper","text":"I'm glad... yeah I hear words from people like \"I can't make deicions or take care of myself and I know there are complex layers often that are the reason for the struggle","time":1675466740000},{"user":"helper","text":"I'm glad you and I here have found some validation of whats going on","time":1675466757000},{"user":"thinker","text":"Yeah...","time":1675466771000},{"user":"helper","text":"and all those thoughts that you have shared - they make so much sense to me - that in relation to your parents - they were like a bulldozer that made you believe those thoughts and then in relation to your inner child you've been alone not being able to deal with the shame and other parts and all of this has snowballed into it being hard to make decisions in the present...A lot of blaming yourself as a means of trying to experience relief","time":1675466868000},{"user":"thinker","text":"Yup... it's been hard...","time":1675466908000},{"user":"helper","text":"when you see yourself in relation to making decisions do you have a sense of thoughts you might prefer to think to yourself instead of the ones written in the notes?","time":1675466947000},{"user":"thinker","text":"Hmm... not really?","time":1675466964000},{"user":"helper","text":"can I try to make one?","time":1675466970000},{"user":"thinker","text":"Sure, go ahead.","time":1675466976000},{"user":"helper","text":"it may take a few tries","time":1675466978000},{"user":"helper","text":"it usually does to hone in for a useful new thought","time":1675466988000},{"user":"thinker","text":"That makes sense.","time":1675466996000},{"user":"helper","text":"I am at a point in my life where I'm not just trying to make a life of my own or having to... but I'm also facing some of the shadow of my past.... and so it makes sense that I might have some resistance to going out into the world.. or to making decisions","time":1675467064000},{"user":"helper","text":"I can soften my attitude toward myself when its hard to make decisions or when I don't want to go out into the world","time":1675467090000},{"user":"thinker","text":"Mm... I don't really like these thoughts because they feel kind of self-compassionate to me...","time":1675467112000},{"user":"helper","text":"aha","time":1675467119000},{"user":"helper","text":"a little further away maybe something like:","time":1675467134000},{"user":"helper","text":"Going out into the world is too much for me","time":1675467207000},{"user":"helper","text":"the other thought felt too far away as I wrote it","time":1675467229000},{"user":"helper","text":"how is this part?","time":1675467242000},{"user":"thinker","text":"I think this sounds fine to me.","time":1675467253000},{"user":"helper","text":"and is there something like... there are people out there who I can connect to?","time":1675467315000},{"user":"thinker","text":"Is there something like that, where? In my thoughts? I'm not sure what you're asking.","time":1675467336000},{"user":"helper","text":"in your perspective now","time":1675467355000},{"user":"thinker","text":"Oh, sure, I do believe there are people out there I could connect with.","time":1675467369000},{"user":"helper","text":"so the \"going out into the world is too much for me\" that feels fine to you. Is there something we could change in it to help it feel better?","time":1675467417000},{"user":"thinker","text":"I'm not sure. I mean I guess this thought just makes me feel a bit sad and hopeless, but I don't know how to make it better.","time":1675467440000},{"user":"helper","text":"yeah I'm seeing the boudaries of feeling uncomfotable with the self compassion","time":1675467476000},{"user":"helper","text":"and then also the current challenge with going out into the world","time":1675467503000},{"user":"thinker","text":"Yeah, if it's something too self-compassionate I would just get angry at myself for thinking something like that when I 'deserve' to hate myself.","time":1675467529000},{"user":"helper","text":"there's a part of me that needs to hate myself","time":1675467564000},{"user":"helper","text":"how is that one?","time":1675467571000},{"user":"thinker","text":"Mm yeah I think this sounds good as well.","time":1675467588000},{"user":"thinker","text":"Or at least it rings true for me.","time":1675467599000},{"user":"helper","text":"yeah","time":1675467600000},{"user":"helper","text":"that's important","time":1675467603000},{"user":"helper","text":"if not its all fluff :)","time":1675467608000},{"user":"helper","text":"that's the trickiness of new thoughts","time":1675467620000},{"user":"helper","text":"they have to be close enough to the present","time":1675467625000},{"user":"thinker","text":"Makes sense.","time":1675467630000},{"user":"helper","text":"and also opening a way for a slightly better or improved experience","time":1675467641000},{"user":"helper","text":"in this case it seems like the acknowledgement of \"going out into the world is too much for me right now\" and \"there's a part of me that needs to hate myself\" are closer to the present","time":1675467693000},{"user":"helper","text":"how about adding something like - \"There's a part of me that needs to hate myself, and I'm learning about how to be with this\" feel?","time":1675467730000},{"user":"thinker","text":"I'm not really sure what \"I'm learning how to be with this\" means...","time":1675467754000},{"user":"helper","text":"is there something you feel you're gaining from this session or that you're learning in relation to this all?","time":1675467788000},{"user":"helper","text":"a general theme?","time":1675467796000},{"user":"thinker","text":"Oh, I see, in that case yeah I think this thought is okay with me.","time":1675467809000},{"user":"helper","text":"okay.... lets try that one on.... if you imagine yourself in your life in a moment when you feel the need to potentially go out into the world and decide something..... and you were to then think \"there's a part of me that needs to hate myself and I'm learning to be with this\" and \"Going out into the world is too much for me right now\"  how does that make you feel?","time":1675467898000},{"user":"thinker","text":"How would I \"think\" that to myself? Like, just say it in my internal monologue?","time":1675467920000},{"user":"helper","text":"yes say it yes","time":1675467925000},{"user":"thinker","text":"hmm...","time":1675467928000},{"user":"thinker","text":"I guess it would feel kind of silly and like I'm a clown?","time":1675467947000},{"user":"thinker","text":"For the first one.","time":1675467955000},{"user":"thinker","text":"The second one I guess I might feel a bit of relief, maybe?","time":1675467972000},{"user":"helper","text":"and for the first one the clown bit does that come with some relief or not and not useful?","time":1675467993000},{"user":"thinker","text":"No, it makes me feel more useless. ","time":1675468006000},{"user":"helper","text":"okay","time":1675468010000},{"user":"thinker","text":"Also makes me feel like I'm lying to myself, because I'm not really learning anything.","time":1675468022000},{"user":"helper","text":"thanks for letting me know","time":1675468028000},{"user":"helper","text":"so the one of \"Going out into the world is too much for me right now\" that one brings a little relief?","time":1675468051000},{"user":"thinker","text":"Yeah, I think it does. I don't know if that's really a good thing... ","time":1675468069000},{"user":"helper","text":"well, i thought that it might be a good thing because it seems more self compassionate than why can't this just be easier or lets do nothing","time":1675468108000},{"user":"helper","text":"maybe theres a bit more that we can add to it that makes it a bit more helpful","time":1675468125000},{"user":"helper","text":"at the least that's important","time":1675468147000},{"user":"thinker","text":"I guess it's better than the old thoughts, yeah. I don't nkow what else to add to it though...","time":1675468153000},{"user":"helper","text":"some kind of encouragement that is digestible","time":1675468159000},{"user":"thinker","text":"I don't really know how to encourage myself, that's very difficult.","time":1675468181000},{"user":"helper","text":"its sounds like the difficutly is partly because of the need to hide and the fear of shame","time":1675468208000},{"user":"helper","text":"how about a thought like \"I have shame from my childhoood.... and self hatred I developed to protect myself from shame.... I need help to heal these pieces\"","time":1675468280000},{"user":"thinker","text":"That sounds accurate, I suppose.","time":1675468297000},{"user":"helper","text":"how about - \"I'm going to reach out for help in diverse ways that keep possibilities for contact open\"","time":1675468386000},{"user":"thinker","text":"Well that doesn't sound accurate because I think I'll probably succumb to my fear and not reach out for help for a long time again.","time":1675468417000},{"user":"helper","text":"I'm thinking","time":1675468444000},{"user":"helper","text":"I think we've reached the end of the \"help\" I am able to provide today and so would like to conclude with the thought that feels best out of the ones we tried or have","time":1675468495000},{"user":"helper","text":"do you have a sense of which one you'd prefer?","time":1675468505000},{"user":"thinker","text":"Oh, okay... Let me look back at the thoughts...","time":1675468513000},{"user":"helper","text":"I have another commitment in about 5-10 mins is why I say","time":1675468542000},{"user":"thinker","text":"I see. Well I'm not sure which thought is best for me but maybe \"\"Going out into the world is too much for me right now\"","time":1675468587000},{"user":"thinker","text":"I don't really know how I'd use this thought but I guess I could say it to myself whenever I have trouble making a decision?","time":1675468608000},{"user":"helper","text":"yes","time":1675468610000},{"user":"helper","text":"what I imagine is that there are a few sharp edges here to tend to","time":1675468622000},{"user":"helper","text":"and one of them is the moment you need to make a decision","time":1675468635000},{"user":"helper","text":"and that if you could at least name the challenge of it being too much and needing space ","time":1675468658000},{"user":"helper","text":"that that is an improvement over self effacing thoughts","time":1675468669000},{"user":"thinker","text":"Okay... I guess that makes sense.","time":1675468691000},{"user":"helper","text":"and that right now thoughts that encourage you to move more are too much which is why this thought doesn't encourage you to move more","time":1675468717000},{"user":"thinker","text":"I see... yeah, that makes sense in the long term.","time":1675468737000},{"user":"thinker","text":"It's probably too soon to push myself or encourage myself too much right now.","time":1675468753000},{"user":"helper","text":"that's what it felt like to me given what you shared","time":1675468763000},{"user":"thinker","text":"Yeah, I think you're right. I would just get angry at myself if I tried to push myself too hard.","time":1675468774000},{"user":"helper","text":"maybe thought when you said that part of the anger ","time":1675468779000},{"user":"helper","text":"maybe you can make a little advancement there by acknowledging that its too much to go out into the world that you're going to practice every once in a while to encourage yourself and that you can then practice hearing the part that's angry and learning to just listen and stop the reactivity","time":1675468853000},{"user":"helper","text":"even a little","time":1675468858000},{"user":"thinker","text":"Yeah, that sounds like it might be helpful. ","time":1675468884000},{"user":"thinker","text":"I guess I'll try doing that.","time":1675468893000},{"user":"helper","text":"I can practice listening to my emotions and not reacting in a way that is harmful to me","time":1675468916000},{"user":"helper","text":"or something like that?","time":1675468923000},{"user":"thinker","text":"You mean that I would \"upgrade\" the thought to this eventually? ","time":1675468954000},{"user":"helper","text":"whenever that seems like a risk that you want to try","time":1675468972000},{"user":"helper","text":"if that is sooner then that can be the thought you take with yourself","time":1675468991000},{"user":"helper","text":"and it can be as simple as I have a decision to make - I'm going to sit and write and just listen to what is here rather than push myself to have to go out or to hide","time":1675469033000},{"user":"helper","text":"some middle path there","time":1675469037000},{"user":"thinker","text":"I see.. I think I've tried someting like that before, just sitting with my feelings. I don't think I'm really ready for that yet but maybe one day I can try it when I feel courageous. ","time":1675469067000},{"user":"helper","text":"you may need more help and that would be natural to me","time":1675469084000},{"user":"helper","text":"so good for you to go little by littlle with it","time":1675469096000},{"user":"helper","text":"and also with wishes for you to be able to find contact that feels human and helpful as soon as possible","time":1675469120000},{"user":"helper","text":"as we move toward an end of this session - theres an opportunity for you to leave a review of this service and that if you found it helpful that you can leave a payment.","time":1675469163000},{"user":"thinker","text":"Okay, sorry for holding you back if you had to go","time":1675469175000},{"user":"helper","text":"oh not at all","time":1675469176000},{"user":"helper","text":"I'm not late to anything","time":1675469180000},{"user":"helper","text":"I set the time boundary when I needed :)","time":1675469187000},{"user":"thinker","text":"Okay, I see... Thank you for listening to me in this session, I think it elucidated for me a lot of things that are holding me back.","time":1675469211000},{"user":"thinker","text":"Hopefully I can make some progress with the new thought here...","time":1675469221000},{"user":"helper","text":"I hope so and know you can come back to these notes or this session any time with the same link","time":1675469240000},{"user":"thinker","text":"Alright, I'll keep the link saved. And I'll check out the review and payment section thing, as well.","time":1675469260000},{"user":"thinker","text":"Oh yeah, I read a few of those.","time":1675469314000},{"user":"helper","text":"thanks for coming and if the session feels anonymous enough for you that I don't think it has any identifying markers of location or names or anything - you can choose to make it \"public\" if you noticed the public sessions on our home page its full of people who generously offer their sessions so others can learn and feel connected to different stories.... if you come to a point that you wish to do that all you need to do is write in this chat that you wish to do so and we will in the background do that","time":1675469355000},{"user":"thinker","text":"Oh yeah I think I don't mind if you make it public, I haven't shared anything here that I would feel is too much to be publicized. ","time":1675469371000},{"user":"helper","text":"thank you for that","time":1675469378000},{"user":"helper","text":"and if for some reason you were to change your mind you can always come back to this link and say so and it will be changed back","time":1675469394000},{"user":"thinker","text":"Okay, that makes sense. THank you!","time":1675469403000},{"user":"helper","text":"of course... leaving here ... but sending wishes for you to be able to access the help you need when you need it... in the spirit of what we're trying to build here at cheese :)","time":1675469439000},{"user":"thinker","text":"Thank you so much! That's very kind of you, I'll try to hold on to that thought of you wishing me well. I hope you have a good day!","time":1675469460000},{"user":"helper","text":"thank you!","time":1675469464000},{"user":"helper","text":"likewise :)","time":1675469467000},{"user":"helper","text":"until next time","time":1675469470000},{"user":"helper","text":"you're welcome to come back any time","time":1675469480000},{"user":"thinker","text":"Alright! Bye-bye!","time":1675469489000},{"user":"helper","text":"bye bye!","time":1675469489000}]}