{"notes":{"thought":"I don't want people to make fun of me for anything\n\nI could have prevented it if I controlled my emotions properly\n\n**I don't know how to talk to people**\n\n","event":"Had a big fight with a friend, after a fight with parents and a sad week. I snapped and said mean things. They ex-communicated, until I apologized and they accepted","behaviors":"impulsive\nvoilent\nrude to friends","feelings":"Sad\nextreme emotions\nanger\nself hate","labels":{"control-fallacy":true,"labeling":true},"new_thought":"\"I might not always know what to say, but my friends love me, as is evident by their choice to connect again. I can keep trying and experimenting with social courage as I figure it out\""},"messages":[{"user":"thinker","text":"Recently I've been turning away close friends, some whom I've just become friends with, others who I've been with for years. I'm having a hard time choosing the right words to tell people what I want to say, and I worry too much about saying the wrong thing. I also have trouble trying to control my emotions, and I end up doing very impulsive and violent things when I'm angry, but I always regret and attempt to apologize afterwards. After a recent issue with one of my friends, they decided to cut off the friendship and refused to speak with me. This is something that could've been prevented if I controlled my emotions properly, but I was too angry at the moment to realize it. Hope this helps describe my situation, sorry if it seems repetitive or lengthy. ","time":1659570606000},{"user":"helper","text":"Hi, thank you for joining me here. I see you're struggling to maintain connections with your friends, and feeling confident in your communications and control of you emotions. I know how challenging that can be, and don't worry at all about being verbose here. I find this really helps me understand what you're going through! And this space is for you","time":1659992484000},{"user":"helper","text":"Before we begin, a session with me takes typically 60-90 minutes. Does this time frame work for you today?","time":1659992512000},{"user":"thinker","text":"Yes, I have time for the session.","time":1659992526000},{"user":"helper","text":"Great, and is there anything you'd like to do to help settle in, mentally, physically, whatever you need","time":1659992571000},{"user":"helper","text":"I just put on a little music :)","time":1659992595000},{"user":"thinker","text":"Yeah, I usually have music playing in the background. It helps keep me focused. ","time":1659992615000},{"user":"helper","text":"wonderful. ","time":1659992626000},{"user":"helper","text":"okay, I see you wrote the above paragraph a little while ago, and I know sometimes what is most troubling to us can evolve over time. Would you like to expand a little on how you are feeling today, and what you would like to address?","time":1659992668000},{"user":"thinker","text":"Today I'm feeling pretty good. I was sad earlier since my friends weren't answering, but eventually they started talking again and I felt better. I usually go to them for advice, but I felt like I needed something a little better for now. ","time":1659992749000},{"user":"helper","text":"oh, I'm so glad you've been able to re-establish communication with them! And it's also good to go to an outside source sometimes, one that isn't all in the mix, I'm happy to be here for you","time":1659992792000},{"user":"helper","text":"Would you like to talk about what happened with one of your friends, where they refused to speak to you because you had difficulty controlling your emotions, and how now you have uncertainty in what to say, or if you'll say the wrong thing?","time":1659992839000},{"user":"thinker","text":"Well, I got in to a big fight with one of my friends over something, I sorta forget what happened. A few days after, though, I apologized to them and they accepted it. Since then I'm very cautious about what I want to say and I don't want people to make fun of me for anything. ","time":1659992928000},{"user":"helper","text":"Hm, I can understand wanting to be a little more cautious after something like that, but at the same time I imagine it's hard to be so careful when you're with friends, because that's when we typically 'let loose' ","time":1659992971000},{"user":"helper","text":"What makes you think they may make fun of you? That's a hard thing to worry about","time":1659992984000},{"user":"thinker","text":"I'm not really sure. It probably has to do with something from my childhood where people would laugh at me at school. None of my friends do that anymore, but it's sort of a PTSD thing, and I can never really get over it.","time":1659993041000},{"user":"helper","text":"oh I see :( yeah I know some experiences that happen in childhood can stay with us for a long time","time":1659993072000},{"user":"helper","text":"so this fear of them making fun of you and also the fear of saying the wrong thing are both making it so you try to be very careful when speaking around your friends?","time":1659993103000},{"user":"thinker","text":"Yes ","time":1659993116000},{"user":"helper","text":"I See","time":1659993121000},{"user":"helper","text":"So, I'd like to ask what is most troubling to you today, in all of this? I know you mentioned a recent fight that has been resolved, and that seems to have a happy ending :) you've also mentioned being hesitant to speak out when with friends, and how you fear impulsivity, or saying the wrong thing. Is it something in here that feels present in you now, or perhaps something else?","time":1659993196000},{"user":"thinker","text":"I think the most troubling in this situation is my impulsivity, because sometimes it just happens out of nowhere and I start getting physically violent, or being rude to my friends when it has nothing to do with them. ","time":1659993253000},{"user":"helper","text":"oh yeah, I can see how it would be really hard to look back on occasions like that and feel apologetic, but still worry it could happen again.. ","time":1659993283000},{"user":"helper","text":"Is it this pattern that is concerning you?","time":1659993298000},{"user":"helper","text":"it seems especially since you don't know why, sort of out of nowhere when they don't actually have to do with it at all","time":1659993323000},{"user":"helper","text":"Maybe we can examine this recent fight, I know you don't remember exactly what is was about (isn't it funny how that happens? But let's take a look at the order of events and see if we can pick it apart to have establish more control next time","time":1659993381000},{"user":"thinker","text":"Well firstly, I was having a really bad week and it seemed like everyone was angry with me. And one day I just snapped after a fight with my parents and I started to threaten one of my friends with a bunch of slurs and mean words. They decided that they didn't want to talk to me anymore, which makes sense. But I did apologize after thinking about  it for a few days.","time":1659993472000},{"user":"helper","text":"It sounds like it built up for a while, and then spilled over. I know that feeling too.. ","time":1659993511000},{"user":"helper","text":"Do you remember some of the thoughts you had, about yourself or the situation, in the moments before the emotional explosion?","time":1659993538000},{"user":"thinker","text":"I remember being really sad that week,  but at times I was also very confident in myself. It was a mix of emotions, very extreme emotions too. I think one day I just couldn't hold it in anymore and started to freak out. ","time":1659993592000},{"user":"helper","text":"You mentioned you had just had a fight with your parents too, I Can see how that would put you right over the edge","time":1659993614000},{"user":"helper","text":"Do you know what kind of thoughts you were having while feeling this heavy emotional turmoil? I know it can be difficult sometimes, to tease them apart this way, but when we recognize the distinctions between our thoughts and emotions it can be really helpful in regaining control","time":1659993663000},{"user":"helper","text":"So I imagine in this week, you were sad... it was building up, you fought with your parents and were swimming in a heightened emotional field. Do you know what you were thinking, about yourself and your ability to control you emotions, or about the people around you, that happened just before or during the 'freak out'?","time":1659993726000},{"user":"thinker","text":"At the time I had really hated myself because I found it really difficult to speak to others, even my parents and close friends. It's kind of hard to remember the details, but I was very mad at the time. Right after the fight though, it seemed like I went back to normal.","time":1659993801000},{"user":"helper","text":"a calm between storms..","time":1659993815000},{"user":"helper","text":"I think I'm starting to see some of the connections here, and thank you for being so open with me and your willingness to explore this","time":1659993842000},{"user":"helper","text":"I can sense that you have this struggle to speak with people, to choose your words and feel easily communicative with them. This has been going on for a while, perhaps since being bullied in childhood. Now you try to restrain yourself, you hate yourself because of this difficulty, and then the emotions build and build until you go from being so hyper careful to all kinds of things you don't mean come out, and hurt the people around you. Is that right?","time":1659993935000},{"user":"thinker","text":"Yes, that is right. ","time":1659993958000},{"user":"helper","text":"So it seems to me, this most troubling aspect is 'I don't know how to talk to people\" because on one hand you wish you could be more freely communicative and you're always afraid of saying the wrong thing, but on the other hand sometimes you blow over and actually *do* say the wrong thing, which probably unfortunately only affirms these negative beliefs you have about yourself :(","time":1659994043000},{"user":"helper","text":"Does that feel like the worst part at the heart of it all?","time":1659994067000},{"user":"thinker","text":"Yes. I have trouble saying what I want to say, and when I get angry I say the things I don't mean. ","time":1659994093000},{"user":"helper","text":"It's clear that you already recognize some of the negative cycle that is happening, and that is a huge first step towards change! I can see you value integrity and being real with your friends, and kindness in how you aim to interact with them. I think we can help bring you closer to these goals","time":1659994188000},{"user":"helper","text":"I'm going to take a moment to summarize and make sure we're on the same page, before we dig into the tool box and find some new perspectives :)","time":1659994231000},{"user":"helper","text":"You recently had a big fight with a friend, and unfortunately this is the most recent time in a string of similar incidents. You were feeling a building sadness, and emotional turmoil. You had a fight with your parents, and then soon after had a fight with your friends. You said some things you didn't mean, and hurt them. After this, you thought to yourself \"I could have prevented it if I could control my feelings\" And \"I don't know how to talk to people\" these thoughts trigger a sort of helplessness, where you feel more sadness, anger, regret. In that state (this carries on) the emotions boil over and you find yourself being impulsive, and violent, triggering more fights and hard beliefs about yourself. ","time":1659994431000},{"user":"helper","text":"Does that feel true to you, is anything missing? ","time":1659994437000},{"user":"thinker","text":"Yes, that feels right. ","time":1659994460000},{"user":"helper","text":"how are you feeling now, looking at this pattern unfolded? ","time":1659994472000},{"user":"thinker","text":"I think it really helps me understand the cycle, because talking to another person is better, to me, than going over my thoughts with myself.","time":1659994513000},{"user":"helper","text":"I agree, it can be so easy to start spinning in circles when doing it by yourself.. that happens to me anyway","time":1659994539000},{"user":"helper","text":"I get the feeling you've worked with us before?","time":1659994547000},{"user":"thinker","text":"I haven't used Cheeseburger Therapy before, but I have read some of the \"documentation\" and thought it seemed like a cool idea. ","time":1659994585000},{"user":"helper","text":"oh sweet! I'm glad you're giving it a try. Okay, I'll explain this cheesy step here, and if you'd like you can take a moment to explore the menu (under the cheese icon)","time":1659994616000},{"user":"helper","text":"I'm just going to take a speedy bio break, brb","time":1659994628000},{"user":"helper","text":"back, thank you for your patience :)","time":1659994721000},{"user":"helper","text":"So, cheese is our way of externalizing some of the thought patterns that we fall into, as shortcuts to understand ourselves and the world, that actually have a negative outcome on our feelings and therefore our behaviors","time":1659994772000},{"user":"helper","text":"It is very difficult to change the way we feel, and our actions are intimately connected to our emotions, as you've been experiencing with your friends","time":1659994796000},{"user":"helper","text":"luckily, we do have power over our thoughts, and from there we can change the entire track ","time":1659994814000},{"user":"helper","text":"do you see any cheesy fallacies that seem interesting to you in how you've been thinking about yourself and your friendships?","time":1659994836000},{"user":"thinker","text":"I think that Control Fallacy might relate to my situation, because I feel like I have little or no control a lot of the time, even when I have a lot of control of the situation. ","time":1659994911000},{"user":"helper","text":"aw, yeah good eye. I like where you're going with that. Control fallacy is a really easy one to slip into.. I suffer with it quite a bit. It's easy to look at a situation and feel like you're getting tugged about, by the emotions, by the situations, and to feel powerless to them. But by looking at the very careful way you watch your words with your friends, it's apparent to me that you actually have a lot of control! It's just by trying so hard all the time, and believing that you lack control even while having it, that emotional bandwidth eventually snaps and leaves you in this sort of emotional hurricane","time":1659995056000},{"user":"helper","text":"but I know it can be hard to swallow control fallacy all on it's own, and I think I have a couple things that might help you remember how and where you have control","time":1659995087000},{"user":"helper","text":"Another think I noticed in your experience is labeling","time":1659995104000},{"user":"helper","text":"You've labeled yourself as a \"a person who doesn't know how to talk\" that you never know the right thing to say, even as a kid, that people will make fun of you or be hurt by you because that's just the way you are. But of course, they have chose to be your friends, and have stuck by you even through these challenging times. That means they must value your integrity and friendship. But when you believe that you don't know how to talk to people, you feel deeply sad and angry, you button up until it all comes pouring out, and then you tell yourself again \"See, I don't know how to talk to people\" And so it repeats... ","time":1659995222000},{"user":"helper","text":"I can see how this would brew frustration and self hatred, but the fact is that you are a whole person, who sometimes doesn't always know what to say (like, me, and everyone else I've ever known) and that's okay. The control you exhibit is actually really hard, for anyone, and by remember that you have so much to offer perhaps the words you are looking for will come out more naturally, and with time you will begin to see the ease of your conversation. We all still have fights sometimes, of course... but the cycle will be broken and you can have independence over your actions :)","time":1659995332000},{"user":"helper","text":"How does it feel to read this over and recognize the large part that control fallacy and labeling have been playing in your story?","time":1659995421000},{"user":"thinker","text":"It feels good to finally have a way to identify my situation, and it will definitely help me get more help.","time":1659995492000},{"user":"helper","text":"yes! yay!","time":1659995498000},{"user":"helper","text":":D","time":1659995500000},{"user":"helper","text":"It is really useful to look at this details and pull out the cheese from your thoughts. Now that we've done that, we can solidify this new mindset in your life and actions by writing a new thought that you can think to yourself instead","time":1659995566000},{"user":"helper","text":"So for example, next time you maybe say something you didn't mean to say (which really does happen to the best of us) What can you think to yourself instead of that can encourage patience within and help create a new and different outcome moving forward?","time":1659995623000},{"user":"helper","text":"How does it feel to try this out?","time":1659995769000},{"user":"thinker","text":"Maybe you could write one for me, I'm not exactly sure where to move from this. ","time":1659995799000},{"user":"helper","text":"No problem, I'm happy to help","time":1659995809000},{"user":"helper","text":"This is something I thought might connect with you.. let me know if it feels true","time":1659995832000},{"user":"helper","text":"\"I might not always know what to say, but my friends love me, as is evident by their choice to connect again. I can keep trying and experimenting with social courage as I figure it out\"","time":1659995842000},{"user":"thinker","text":"Yes, that seems correct ","time":1659995883000},{"user":"helper","text":"I want to encourage a little play and adventure :)","time":1659995887000},{"user":"helper","text":"It's hard to move forward from bullying and such, to trust your voice. I know this well. But I think remembering that you love your friends and they continue to love you shows that this connection is stronger than misstepping with words occasionally, and hopefully by bottling up less, it won't all come out too fast when you least expect it :)","time":1659995946000},{"user":"helper","text":"What feelings come up for you when you think this new thought, \"I might not always know what to say, but my friends love me, as is evident by their choice to connect again. I can keep trying and experimenting with social courage as I figure it out\"?","time":1659995971000},{"user":"thinker","text":"I feel confident in my future and I hope to remember this statement and make good decisions. ","time":1659996016000},{"user":"helper","text":"oh that's wonderful, I'm so glad to hear it","time":1659996025000},{"user":"helper","text":"sometimes it helps to put it in your phone or something!","time":1659996034000},{"user":"helper","text":"And how do you feel now, compared to when we started?","time":1659996042000},{"user":"thinker","text":"When we started I felt kinda sad, but now that we've come to this conclusion, I'm feeling a lot better. ","time":1659996081000},{"user":"helper","text":":)","time":1659996085000},{"user":"helper","text":"Remember, it can take some time to really forge these new paths, so practice patience with yourself. It is worthwhile and can definitely help in the long run. ","time":1659996130000},{"user":"helper","text":"I'm wondering if you would be willing to share this session with the public? I know connecting with friends and feeling self doubt is something many people struggle with, and so it could benefit them even if they don't have a session on this topic themselves. It will remain anonymous, and of course is completely up to you ","time":1659996187000},{"user":"thinker","text":"Sure! I was planning on sharing screenshots with friends so that we could discuss it individually. I feel like this chat could really help people since this feels like a common thing to happen to others. ","time":1659996237000},{"user":"helper","text":"Totally! And hey that's a great idea. It is vulnerable, and that vulnerability really opens space for more love and connection. I admire that!","time":1659996268000},{"user":"helper","text":"I appreciate your willingness","time":1659996276000},{"user":"helper","text":"With that, we are done. On the right hand side you'll see an opportunity for reflection. We appreciate any notes you might have. The payment is also optional, in pay what you want/pay if it helps. Thank you for being here with me today <3","time":1659996329000},{"user":"helper","text":"until next time","time":1659996333000},{"user":"thinker","text":"Thanks for everything! I would love to pay but my income is limited at the moment. ","time":1659996351000},{"user":"helper","text":"Sure, I understand. Maybe another day then. ","time":1659996364000},{"user":"helper","text":"I'm just glad I could help","time":1659996373000},{"user":"helper","text":"The review also goes a long way in supporting us. Thank you!","time":1659996404000}]}