{"notes":{"event":"Seeing time go by without clear focus, goals, or progress.","thought":"I won't be able to accomplish my goals\nI lose track and focus \nDo I set too many goals?\nDo I set new goals because I lose focus? \nI'm not setting my life to have a fallback--- I'm going all or nothing","feelings_behaviors":"Anxiety, fear, worry\n\nFurther distract myself --- youtube","new_thought":"It's time to make new engagements with reality. User tests & sales."},"messages":[{"user":"thinker","text":"I'm worried that I won't be able to accomplish my goals.","time":1545777061000},{"user":"thinker","text":"One fear is that I lose track and focus. Perhaps because I set too many of them. Or perhaps I set new goals *because* I lose focus.","time":1545777122000},{"user":"helper","text":"Hey there, welcome back!","time":1545777141000},{"user":"thinker","text":"Oh hi, thank you. You are awake. :P","time":1545777145000},{"user":"helper","text":"I see you've already shared quite a bit of information, so im going to start taking notes in the summary box on the right hand side","time":1545777175000},{"user":"thinker","text":"Ok, thank you.","time":1545777177000},{"user":"helper","text":"Ok, so you have shared that you have the worry that you won't be able to accomplish your goals. A fear you have is that you're losing track and focus to accomplish these goals. Thinking about the possibility of losing track and focus has lead you to having the thought that maybe you create new goals for yourself in the process of losing focus from your previous goals, and you've thought that maybe you have set too many goals to begin with","time":1545777337000},{"user":"helper","text":"Is this correct? ","time":1545777343000},{"user":"thinker","text":"Yeah, and that makes me think that maybe overall I'm afraid that I've been too ambitious, and am setting myself up for a failure where I don't achieve any of the ambitious things... like, perhaps I am not setting up my life to have a fallback. I'm going all-or-nothing. Man, maybe this is more black-or-white thinking.","time":1545777387000},{"user":"thinker","text":"(It's crazy how useful this is for my thought, just to have another person there, and summarize and highlight things like this.)","time":1545777409000},{"user":"helper","text":"(Thats great, lets see what else we find!) ","time":1545777461000},{"user":"thinker","text":"It seems like there might be some use in setting up interim goals, so that I slowly build instead of going all-or-nothing.","time":1545777477000},{"user":"helper","text":"Ok we can dig deeper into that later. First, I'd like to know what event has lead you to forming these thoughts of \"I won't be able to accomplish my goals\" , \"Do I set too many goals?\", etc","time":1545777535000},{"user":"thinker","text":"Ok good question, thank you.","time":1545777538000},{"user":"thinker","text":"I am afraid of not accomplishing goals when I see time going by without clear progress on them, and when I notice myself not focused. Like, this morning, I wasn't focused.","time":1545777577000},{"user":"thinker","text":"That makes me think I might lose track and focus, and get too diverse in what I do, and that I won't accomplish goals.","time":1545777597000},{"user":"helper","text":"How do you feel when you find yourself \"not focused\"? ","time":1545777666000},{"user":"thinker","text":"I feel a background anxiety, a fear, a worry. And sometimes that leads me to distract myself further into some really low-grade activities like watching youtubes.","time":1545777705000},{"user":"helper","text":"Ok I have a better image of your situation. I'm going to summarize again to stay on the same page ","time":1545777756000},{"user":"thinker","text":"Ok, I'm having an idea of something to add. Please continue and I'm going to try to make sense of this thought on the side if that's ok?","time":1545777773000},{"user":"helper","text":"You've seen time go by without clear progress and have also found yourself not focused, such as this morning. When this happened you have had the thought that you won't be able to accomplish your goals because of the loss of focus. This combined has lead you to question your focus all together and lead yo to wonder if you're setting achievable goals for yourself. Not being certain if you are has further deepened your thoughts into thinking that you may not be setting your life to have a fall back, and you're currently in an \"all or nothing\" situation. While analyzing all of this you have experienced anxiety, fear, worry and have used youtube as a distraction from the troubling thoughts, which has only further distracted you leading you back into this cycle of questioning your productivity. ","time":1545777981000},{"user":"thinker","text":"Yeah.","time":1545777988000},{"user":"thinker","text":"I'm seeing that this is a cycle.","time":1545778007000},{"user":"thinker","text":"I think the B&Wness of \"accomplishing\" or \"not accomplishing\" the goals is a problem.","time":1545778073000},{"user":"thinker","text":"As the black fear of \"not accomplishing\" becomes a strong thought that derails me into anxiety when I see time go by without clear progress.","time":1545778122000},{"user":"thinker","text":"On the other hand, I think the white part of that thought — of \"accomplishing\" — is quite motivating for a period. But it has this dark side-effect.","time":1545778164000},{"user":"helper","text":"I completely agree ","time":1545778203000},{"user":"thinker","text":"Thank you for helping me with this.","time":1545778215000},{"user":"helper","text":"How do you feel when you break down your thoughts this way? Into the motivating part of the thought vs unproductive ","time":1545778236000},{"user":"helper","text":"or not unproductive but anxiety inducing ","time":1545778254000},{"user":"thinker","text":"Well, I immediately question whether it's a good way to think. And I'm not sure if it's good or bad. I see pros and cons.","time":1545778331000},{"user":"thinker","text":"But I feel some space in looking at this thought from a distance, and being able to evaluate it.","time":1545778358000},{"user":"helper","text":"Does the space mean wiggle room to see where change can be made? ","time":1545778397000},{"user":"thinker","text":"Yes, I feel emotionally at peace looking at it like this, and like I can choose.","time":1545778409000},{"user":"thinker","text":"Yes I think I want to focus on \"I won't be able to accomplish my goals.\"","time":1545778452000},{"user":"helper","text":"Thats great. For the rest of the session we want to focus on a specific thought. You already brought up the \"all or nothing\" mindset. Is this the most torubling aspect? ","time":1545778454000},{"user":"thinker","text":"Because it's B&W.","time":1545778463000},{"user":"helper","text":"Ok lets focus on that ","time":1545778466000},{"user":"thinker","text":"Oh yeah, that one is good too.","time":1545778486000},{"user":"thinker","text":"How is labeling applied here?","time":1545778492000},{"user":"helper","text":"Maybe this is stretch, but I see you labeling yourself as a potential failure without knowing what the future will bring ","time":1545778518000},{"user":"thinker","text":"Yeah, as a failure or success. It feels binary.","time":1545778534000},{"user":"helper","text":"The main overarching cheese is black and white thinking, but along with that you're fortune telling and labeling the black side of your thinking, you're not bringing much attention to the white or the gray in between","time":1545778585000},{"user":"thinker","text":"That's a good point.","time":1545778586000},{"user":"thinker","text":"I think the black-or-white thinking is how I am evaluating the future. The present seems to be a bunch of shades.","time":1545778615000},{"user":"helper","text":"Ideally, would the future look like a bunch of shades as well? ","time":1545778642000},{"user":"thinker","text":"Yeah.","time":1545778647000},{"user":"helper","text":"Ok. What would the present have to look like and continue to look like for your future to also include these shades: ","time":1545778685000},{"user":"helper","text":"? ","time":1545778686000},{"user":"thinker","text":"I am thinking that when I notice myself scared about progress, I can look at the present moment and see what I can get done, what the closest real result is, that produces some amount of real tangible success. Rather than thinking about something off in the future.","time":1545778705000},{"user":"thinker","text":"I think there are a lot of real steps of accomplishment. I tend to work on long-term projects, where the result is in the future, but I can try to find smaller shades of accomplishments, and focus on those in the present. Perhaps?","time":1545778833000},{"user":"thinker","text":"Your question feels challenging to answer directly.","time":1545778845000},{"user":"thinker","text":"But it is interesting.","time":1545778850000},{"user":"helper","text":"Thats good. theres no right or wrong answer","time":1545778858000},{"user":"helper","text":"just something to get the wheels spinning ","time":1545778865000},{"user":"helper","text":"You mentioned wanting to have smaller shades of accomplishments, would this relief stress from the future? ","time":1545778887000},{"user":"thinker","text":"Yeah, I think that stress of the future is also about losing focus, which I think is about losing touch with reality. It's like, I have these projects in my head, and a lot of them, and I have to keep them all straight myself and remind myself because I have no boss and I have few other people holding me accountable. So it's quite a challenge. And I am concerned of living up to that challenge. Of keeping the right focus. And if I had smaller shades of accomplishment, and more touches with reality, then the world would be like a memory, holding me accountable.","time":1545778968000},{"user":"thinker","text":"And reminding me and guiding me to focus, and also showing accomplishment along the way, so that I'm not scared of not accomplishing in a black-or-white way.","time":1545778995000},{"user":"helper","text":"Ok. Once again im going to summarize ","time":1545779064000},{"user":"helper","text":"I think you've shared a lot that we can continue expanding. I dont want to get my facts mixed up ","time":1545779080000},{"user":"thinker","text":"Thank you.","time":1545779097000},{"user":"helper","text":"Starting from the top... Youve seen time go by without clear progress and you've found yourself not being focused. When this occurred, you have had the thoughts that you wont be able to accomplish your goals, you're losing track/focus, and you've questioned if you've set too many goals for yourself and you've maybe even created even more goals to divert from the previous ones. These are worrisome thoughts because you also think you've invested yourself in an all or nothing kind of way, which leaves very little room for error. We've established that this way of thinking is black and white, because a) you don't know the future and b) you know theres wiggle room for your accomplishments, it's just hard to see when you're feeling overwhelmed by the anxiety, fear, and worry. We've continued to expand on all of this and you've noted that part of the stress is keeping yourself accountable because no one will push you, you have to be your own motivator, and this has proven to be a difficult task. Part of the stress induced by thinking about the future is also about losing touvh with reality (a thought I think we can work with to come up with a new thought) and when this happens you lose touch with the potential you truly have ","time":1545779382000},{"user":"thinker","text":"What do you mean I lose touch with the potential I truly have?","time":1545779399000},{"user":"thinker","text":"I also think I see a new way this connects: (1) I have many long-term projects, and it's hard to keep the goals in mind, so I simplify them in my mind into something black-and-white. (2) Now that I have this black-and-white goal, when I find myself with challenges, I get afraid of the whole thing unraveling.","time":1545779483000},{"user":"helper","text":"Losing touch with your potential would be losing the ability to see the gray in the black and white thinking ","time":1545779489000},{"user":"helper","text":"Ah, so the black and white thinking is a way to organize your goals but when things don't work out as black and white its difficult to unravel because it feels like you're taking steps backwards. Did i interpret that correctly? ","time":1545779554000},{"user":"thinker","text":"Yeah I think so. The \"steps backwards\" isn't 100% accurate but the rest is right.","time":1545779568000},{"user":"thinker","text":"I'd say it just feels like failure haha.","time":1545779583000},{"user":"thinker","text":"I like how you described it as a way to organize my goals. But then when it doesn't work out, it's failure. The organization is brittle.","time":1545779604000},{"user":"thinker","text":"I think a solution is to use more of the outside world to organize my goals. More interactions with people: customers, users of the software, etc.","time":1545779643000},{"user":"thinker","text":"Like, they will be reminders, and be little points of accomplishment.","time":1545779670000},{"user":"helper","text":"Is this something we should use for your new thought? ","time":1545779720000},{"user":"thinker","text":"Yeah I think so.","time":1545779723000},{"user":"thinker","text":"Like, how about this... When I see time go by without clear progress, I can look for some more little indicators of progress that I could find and incorporate into my world.","time":1545779750000},{"user":"helper","text":"Thats great ","time":1545779783000},{"user":"helper","text":"When you think this thought, does it remove some of the stress caused by seeing time go by without clear progress or does this thought remind you that there is progress that you may not always be able to see? ","time":1545779827000},{"user":"thinker","text":"Hmm..","time":1545779829000},{"user":"thinker","text":"I think it removes some of the stress— but not exactly the stress that is caused by seeing time go by, but the underlying stress of fearing I'm not as good as I want to be. Perhaps this is the failure label that you were anticipating.","time":1545779963000},{"user":"thinker","text":"That stress of being a failure, with ideas and dreams that were never realized, who is distracting himself with youtube into an internal gaze, goes away when I get more reality contact.","time":1545780025000},{"user":"thinker","text":"As for \"progress that I may not always be able to see\", I'm not sure how to apply that.","time":1545780049000},{"user":"helper","text":"Ok so the new thought \"When I see time go by without clear progress, I can look for some more little indicators of progress that I could find and incorporate into my world.\" helps with part of the stress being caused, so we can continue to elaborate it ton fit your needs better ","time":1545780112000},{"user":"helper","text":"When I said progress you may not be able to see I was refering to the \"small indicators of progress\", indicators that you cannot see without clearly looking for them ","time":1545780156000},{"user":"thinker","text":"Oh, thank you. I think instead of \"small indicators of progress\", I should have said \"small ways to make progress with reality\" like talking to a person.","time":1545780183000},{"user":"thinker","text":"Like, I think I need to start setting up some talks at meetups. That is feeling clearer.","time":1545780242000},{"user":"helper","text":"Well if its feeling clearer then its something worth giving attention to ","time":1545780307000},{"user":"helper","text":"How do you feel when you think \"When I see time go by without clear progress, I can look for some small ways to make progress with reality that I could find and incorporate into my world.\" ","time":1545780323000},{"user":"helper","text":"what is left that this doesnt touch on? ","time":1545780330000},{"user":"thinker","text":"I'm feeling more focused and energized and connected to reality and life and the world and society.","time":1545780338000},{"user":"thinker","text":"I want to try wording that better, though...","time":1545780353000},{"user":"thinker","text":"\"It's time to engage with reality.\"","time":1545780398000},{"user":"thinker","text":"...in new ways","time":1545780427000},{"user":"thinker","text":"I think this touches on everything. For example, the \"setting too many goals\" part doesn't matter really, because those are abstract goals in the future... they aren't as real as setting real goals in the present, or the next week.","time":1545780493000},{"user":"thinker","text":"So I think this is good.","time":1545780507000},{"user":"helper","text":"Ok awesome ","time":1545780533000},{"user":"helper","text":"I see it ","time":1545780542000},{"user":"helper","text":"Well, next time you see time go by without clear progress remember to practice the thought, \"It's time to make new engagements with reality\" ","time":1545780585000},{"user":"helper","text":"How do you feel now compared to when we started? ","time":1545780598000},{"user":"thinker","text":"Well, I'm letting this soak in. I think this might be a pretty deep behavior change. Because I often deal with focus, progress, goals, procrastination, and fears of failure. So let me think for a moment longer and see where it soaks too if you don't mind.","time":1545780655000},{"user":"thinker","text":"Yes I think this is a frequent issue, actually. I've been seeing echoes of it in the past as well... like the last month or two.","time":1545780708000},{"user":"helper","text":"Hmm ok","time":1545780755000},{"user":"helper","text":"Are you satisfied with this new thought or should we tweek it","time":1545780774000},{"user":"thinker","text":"I think it's good. I just don't totally understand its impacts in my life yet because I think they might be vast.","time":1545780783000},{"user":"thinker","text":"Cheeseburger is cool.","time":1545780800000},{"user":"thinker","text":"Thank you very much for your help.","time":1545780803000},{"user":"thinker","text":"I don't know anywhere else in life I can get this kind of help with important things in my life, and be able to give back and help reciprocally.","time":1545780825000},{"user":"helper","text":"Me neither. I really love this project ","time":1545780844000},{"user":"thinker","text":":)","time":1545780848000},{"user":"helper","text":"Ok well, I think you're done! ","time":1545780854000},{"user":"thinker","text":"I think this is good. I can sit on it","time":1545780856000},{"user":"thinker","text":"I'll text you with any conclusions I have.","time":1545780861000},{"user":"helper","text":"Great let me know ","time":1545780865000},{"user":"helper","text":"Merry Christmas! ","time":1545780869000},{"user":"thinker","text":"Thank you luana. Good work. Merry chrimstas to you too! Thank you for this xmas gift!","time":1545780874000},{"user":"helper","text":":) ","time":1545780877000},{"user":"thinker","text":"What a way to spread cheer.","time":1545780885000}]}