{"notes":{"event":"Moved somewhere new with challenges to support partner, even though I had previously planned on New York and would still like to. \n\nShe is switching roles again and we have another opportunity to move there","thought":"I should be supportive of her pursuit for a good fit\n\nThis chance is slipping away\n\nI'm being irrational\n\nIt's like I'm asking her to trade career growth for something I want -- this isn't fair\n\nShe knows how I feel\n\n","feelings":"conflicted\ndisappointed\nresigned\n","behaviors":"remain passive\ndon't bring it up\n\n","labels":{"should-statement":true,"black-or-white-thinking":true,"mind-reading":true},"new_thought":"I can be more direct expressing my thoughts/feelings regarding the change, and can still be supportive. Even if it’s not a explicitly a “win win”, we will have gotten there through an understanding of how we both feel.  "},"messages":[{"user":"helper","text":"Hello, unfortunately I am not available for this session. My apologies! Would you be willing to reschedule for the following day, same time?","time":1664866539000},{"user":"thinker","text":"Yes, no worries! ","time":1664866987000},{"user":"helper","text":"hello again!","time":1664992853000},{"user":"helper","text":"If I may have one moment.. my keyboard needs to be plugged in, I must find the charger","time":1664992870000},{"user":"helper","text":"thank you :)","time":1664992873000},{"user":"thinker","text":"No worries","time":1664992874000},{"user":"helper","text":"okay... I think I got it up and going. Thank you for your patience! How are you today?","time":1664992921000},{"user":"thinker","text":"Things are generally going well! ","time":1664992978000},{"user":"thinker","text":"I wanted to talk through something I feel conflicted about regarding my partner and moving","time":1664993102000},{"user":"helper","text":"I'm glad to hear you're feeling well for the most part :) but happy to discuss this challenge in moving with your partner. What is bringing out this conflict in you?","time":1664993150000},{"user":"helper","text":"(sorry for the delayed response by the way! i had to refresh)","time":1664993175000},{"user":"thinker","text":"No worries! ","time":1664993180000},{"user":"thinker","text":"For a bit of context, after college I was planning on moving to New York, which was something I was really looking forward to, but my partner end up choosing to take a job somewhere else, so we ended up deciding to live in the same spot","time":1664993259000},{"user":"thinker","text":"I ended up changing roles to make this happen, and I struggled a lot to adjust to the new role, and also didn’t have a ton of friends where we ended up.","time":1664993304000},{"user":"thinker","text":"Recently my partner had started to look for new roles, so there is an opportunity for us to potentially move","time":1664993346000},{"user":"helper","text":"I'm sorry, If I may quickly interrupt, when you say role are you talking about your job/career/position in a company?","time":1664993374000},{"user":"thinker","text":"Yup!","time":1664993379000},{"user":"helper","text":"which one haha","time":1664993384000},{"user":"thinker","text":"It’s a small startup, still under the radar ","time":1664993409000},{"user":"helper","text":"oh interesting, but I more meant to ask if you were switching within the same company, or changing careers entirely","time":1664993447000},{"user":"thinker","text":"Ah yes, within the same company","time":1664993453000},{"user":"helper","text":"okay thank you for clarifying! please continue :)","time":1664993460000},{"user":"thinker","text":"Moving from a more customer facing business role to a more technical one ","time":1664993486000},{"user":"helper","text":"I See, I can see how that would be a difficult adjustment! this helps me understand your situation. thank you","time":1664993503000},{"user":"thinker","text":"Anyways, we had spent some time out in NY over the summer, and my partner ended up enjoying it, so I was hopeful that she would be intrested in perusing a role out there","time":1664993591000},{"user":"thinker","text":"But it seems that while she’s intrested, it’s not a big consideration  ","time":1664993635000},{"user":"thinker","text":"I know i should be supportive in her persuit to find a good fit, and don’t want to pressure them to do anythin ","time":1664993701000},{"user":"thinker","text":"but at the same time it is one of my dreams to live out there for a bit, and it reminds me of the time when I was really unhappy","time":1664993751000},{"user":"helper","text":"I can see how supportive you are, and want to be, by making such large life choices for their happiness","time":1664993786000},{"user":"helper","text":"but it seems at times, in sacrifice of your own","time":1664993795000},{"user":"helper","text":"What reminds you of a time when you were unhappy, living in this new place in a difficult role with less friends?","time":1664993816000},{"user":"thinker","text":"ah, that was when I made the switch in roles, most of my close friends ended up in the city, and I felt that my partner didn’t recognize ","time":1664993894000},{"user":"thinker","text":"what I was sacrificing to make the move","time":1664993917000},{"user":"thinker","text":"In a sense this seems like a chance to do something that I’ve wanted to do for a while, but at the same time it’s slipping away ","time":1664993949000},{"user":"helper","text":"I see, so it feels like you're doing so much to support your partner, but they may not totally understand just how much it is to you, or be able/willing to do the same in return. Is that right?","time":1664993996000},{"user":"helper","text":"you say \"This seems like a chance\" I'm sorry, what is 'this' that you're referring to as an opportunity for change you may be missing?","time":1664994043000},{"user":"thinker","text":"Hmm, regarding your first comment, I think that’s partially it, I feel more internally conflicted if I should ","time":1664994088000},{"user":"thinker","text":"encourage my partner to find something that would give us the chance to move versus finding something","time":1664994129000},{"user":"thinker","text":"that is a really strong fit for them","time":1664994139000},{"user":"thinker","text":"By ‘this’, I was referring to how they are switching jobs and this would allow us to move, ","time":1664994183000},{"user":"thinker","text":"The company I work for is flexible with where I am geographically located ","time":1664994210000},{"user":"helper","text":"ahh, okay. And I'm remembering now how you said when you visited, she enjoyed it but didn't seem to really consider it as a moving possibility. ","time":1664994238000},{"user":"helper","text":"So you're conflicted on how much to sway her decision process.. on one hand, it would mean a lot to you to explore this opportunity in new york, but on the other hand you moved elsewhere for her once, and would possibly do it again, in order to best ensure her chance at finding the right fit","time":1664994295000},{"user":"thinker","text":"Yeah, I think that more or less describes it, I would be happy to put aside moving if she’s happy ","time":1664994355000},{"user":"helper","text":"I can see you do a lot for her :)","time":1664994367000},{"user":"thinker","text":"But at the same time would like to get acknowledgment that there are things that I’m personally","time":1664994396000},{"user":"thinker","text":"sacrificing","time":1664994413000},{"user":"thinker","text":"this also ties back to when we initially moved, I didn’t communicate how much it meant to me, but we have","time":1664994456000},{"user":"thinker","text":"since discussed that and gotten on the same page","time":1664994472000},{"user":"thinker","text":"It just feels like a repeat of what previously happened, and I want to both avoid the mistakes that I made","time":1664994525000},{"user":"thinker","text":"Before not communicating how much it meant to me, but also be supportive of what she ends up deciding","time":1664994552000},{"user":"helper","text":"I can see you've gained some wisdom, from witnessing what happened last time, and coming back again full circle wanting to avoid the same mistakes. I was going to ask how your communication was with her.. so she knows last time how much it meant to you, but you've mentioned perhaps this time she doesn't. What have you done in means of communicating your desires while also prioritizing your support, thus far?","time":1664994625000},{"user":"thinker","text":"We’ve had discussions where we have talked about what each of us wants as they change jobs, ","time":1664994677000},{"user":"thinker","text":"She is open to trying to trying to find a role that would let us move, but isn’t a huge priority ","time":1664994737000},{"user":"thinker","text":"i understand her perspective and it makes sense given that the opportunities where we currently are","time":1664994770000},{"user":"thinker","text":"Are more available, in that sense it all logically makes sense, I largely feel irrational about this which ","time":1664994823000},{"user":"thinker","text":"Makes me feel conflicted ","time":1664994850000},{"user":"thinker","text":"I’ve talked with them about how it’s something I’ve really wanted to do, and they understand that","time":1664994899000},{"user":"thinker","text":"But it ultimately feels like I’m asking her to potentially trade career growth for something I would like to have","time":1664994939000},{"user":"helper","text":"It all makes so much sense","time":1664994994000},{"user":"helper","text":"It really is a challenging situation you're in, making career decisions, life decisions, and as a couple where you ultimately will want different things sometimes","time":1664995024000},{"user":"thinker","text":"To be clear, I do think that she should try and persue the best opportunity that comes up","time":1664995055000},{"user":"helper","text":"yes :) understand. I understand too how difficult that might be too communicate, to have both sides of you.. one that is excited about this slim chance of moving, and the other that above everything else wants the best for her","time":1664995088000},{"user":"helper","text":"You mentioned that you feel irrational, that is isn't 'fair' to ask this of her, and so you aren't. What thoughts come up for you when you feel that conflict?","time":1664995124000},{"user":"thinker","text":"Hmm, I would say that it’s mainly disappointment/resignation","time":1664995152000},{"user":"thinker","text":"like something that I’ve wanted for a long time is just within grasp but won’t happen ","time":1664995185000},{"user":"helper","text":"oh man. .yeah that is an uncomfortable thing to sit with","time":1664995209000},{"user":"helper","text":"you have this thought \"This chance is slipping away\" And then feel conflicted, disappointed, resigned. Is this what is most troubling to you today? ","time":1664995251000},{"user":"thinker","text":"I would say so,","time":1664995260000},{"user":"thinker","text":"I tend not to worry about things outside of my control, but I feel that there might be something ","time":1664995290000},{"user":"thinker","text":"I’m not doing to effectively communicate how much it means to me, or that there is something that ","time":1664995323000},{"user":"thinker","text":"I could do so that it’s a win win","time":1664995334000},{"user":"helper","text":"yeah I sense that too.. ","time":1664995337000},{"user":"helper","text":"I can hear in the way you talk about how you should be ultimately supportive of her, and how you feel like it's irrational and unfair to express your desires, that it would be difficult to really feel like you've done all you can to communicate both sides you have within.","time":1664995397000},{"user":"helper","text":"When you think I should be supportive, because what I'm asking is unfair, what feelings come up for you then?","time":1664995422000},{"user":"helper","text":"If they are any different from what we have listed","time":1664995434000},{"user":"thinker","text":"hmm, I don’t think they are any different ","time":1664995459000},{"user":"helper","text":"That makes sense... so when you feel conflicted, disappointed, and resigned, what actions do you take or not take?","time":1664995495000},{"user":"thinker","text":"I would say I’m mostly passive","time":1664995516000},{"user":"thinker","text":"i haven’t brought it up recently because I know they are stressed around finding a new role, but perhaps I","time":1664995554000},{"user":"thinker","text":"should try and communicate how I’ve felt conflicted recently ","time":1664995613000},{"user":"helper","text":"perhaps.. ultimately it is a very difficult situation, and the 'win-win' you are hoping for is not always attainable. However, I sense this feeling of not wanting to repeat what happened last time, to be sure you've really communicated everything you feel, so that whatever decision is made is made upon knowledge of the whole situation and not some reticence to share. ","time":1664995685000},{"user":"helper","text":"If we can examine some of these thoughts you've have and how they affect your feelings and your ability to communicate, perhaps we will open the door to more talk. I know just from this short conversation how much you do care about her career, and what's best for her.. you also just want to be sure your voice is heard and considered. This is completely fair. ","time":1664995760000},{"user":"thinker","text":"Yeah, I think that hits the nail on the head, i think what is the most important to me is the acknowledgment ","time":1664995810000},{"user":"thinker","text":"That there is a compromise, even if I’m more than happy to make it","time":1664995835000},{"user":"helper","text":"Yes! compromise is so important in any working relationship. Sometimes that may mean that one person comes first for a while, to further their career, support family.. etc.. so many reasons. But ultimately balance is key, I believe. ","time":1664995881000},{"user":"helper","text":"That brings me to the cheese I think is fitting for your thoughts here. Are you familiar with cheese?","time":1664995896000},{"user":"thinker","text":"not entirely ","time":1664995901000},{"user":"helper","text":"Ok great, Cheese is simply the way we define some thought patterns we have, everyone, that are easy to fall into but may be shortcuts that actually limit our perception and cause difficult feelings. The concept here is that it may be hard to change our feelings (conflicted, disappointed) but we do have control of our thoughts - which affect our feelings - and then even our behaviors","time":1664995984000},{"user":"helper","text":"so! If you'd like to peruse with me, I have some idea here of what is fitting for your situation but I'm curious to see if anything stands out to you. Would you like to look at the cheese drop down menu with me? It's in the thought section on the right","time":1664996026000},{"user":"thinker","text":"let me take a look","time":1664996032000},{"user":"helper","text":"great, and actually I'll be back in a flash. one moment","time":1664996049000},{"user":"thinker","text":"No worries","time":1664996084000},{"user":"thinker","text":"I think mind reading/should statement seems to apply here","time":1664996137000},{"user":"helper","text":"oh yeah, I can see both of those","time":1664996146000},{"user":"helper","text":"Should statement stood out to me as well, should statements means to be expecting something of ourselves regardless of the situation.. here, you think to yourself \"I should be supportive of her (no matter what)\" And even though you really want to move to new york, you stuff those desires down in order for her to know that above all you want whats best for her, but this can create resentment and inner conflict. Then suddenly you may find yourself repeating something which happened last time, leading to unhappiness and tears in the relationship. This isn't what's best for at all","time":1664996284000},{"user":"helper","text":"Mind reading, we didn't talk about much in this session, so I don't want to put any words in your mouth but I would be curios to hear how you connected to it?","time":1664996308000},{"user":"thinker","text":"I don’t think it’s as connected, more so I have an unreasonable expectation for her to understand how","time":1664996347000},{"user":"thinker","text":"i feel without communicating explicitly","time":1664996362000},{"user":"helper","text":"oh wow! yeah, ","time":1664996368000},{"user":"helper","text":"You may have talked briefly, but if you have never expressed how important it is to you, you can't assume that she knows. Then you won't want to bother her while she is stressed, and the decision will be made without you partaking","time":1664996419000},{"user":"thinker","text":"absolutely ","time":1664996433000},{"user":"helper","text":"I think that's a great observation","time":1664996442000},{"user":"helper","text":"I have one more cheese I Think you may find interesting","time":1664996452000},{"user":"helper","text":"Black and white thinking. I've noticed that because moving is such a huge decision, there are some black and white patters in your approach to it. For example, the thought \"I'm asking her to trade career for something I want\" Is really hindering your ability to feel like you can communicate clearly about it. Like, it's her or me. It's fair or unfair. ","time":1664996541000},{"user":"helper","text":"But you are in a dynamic relationship, always changing, shifting, the goals and prioritizations will change. You are able to want to go to new york, while also wanting her to have the best opportunity, and this is the Grey. ","time":1664996598000},{"user":"helper","text":"When it is black and white, when you think you are being unfair .. or even irrational! to want and express things for yourself, then you push yourself farther away from the possibility of meeting in the middle because it doesn't fulfill you 'should statement' of being perfect and solely supportive. ","time":1664996666000},{"user":"helper","text":"This makes the chance of expressing perfectly reasonable desires in a way where all opinions can be examined near impossible.. so you feel resigned.. so you don't bring it up :( and then she may never know until it is too late","time":1664996733000},{"user":"thinker","text":"That makes sense","time":1664996758000},{"user":"helper","text":"I'm glad it connects with you. What thoughts and feelings come up for you as you examine these cheeses with me?","time":1664996791000},{"user":"thinker","text":"There is a sense of relief, that there are things that I can do to make sure I’m heard,  but at the same time there ","time":1664996836000},{"user":"thinker","text":"are aspects that our out of my control, but ultimately while the outcome might not be exactly what I wanted","time":1664996902000},{"user":"thinker","text":"that is ok, and as long as there is a mutual understanding, things will generally be pretty good","time":1664996968000},{"user":"helper","text":"Yeah :) I can see how much you value this relationship and your partner, to prioritize it, to accept it's challenges. It must be a truly beautiful thing. ","time":1664997010000},{"user":"helper","text":"And I can see also from how we've been talking that it won't be difficult for you to express that as well, even when bringing up your own needs, even with discussing difficult perspectives on your big upcoming decisions. ","time":1664997081000},{"user":"helper","text":"So, the next step here is to come up with a new thought to have as you navigate this role changing process and potential move with your partner","time":1664997124000},{"user":"helper","text":"This thought will directly combat the should statements, mind reading, and black and white thinking. By widening your perspective this way, hopefully it will be easier to feel a little better about the situation, and communicate clearly if you choose to do so. ","time":1664997170000},{"user":"thinker","text":"Hmm","time":1664997195000},{"user":"thinker","text":"I can be more direct expressing my thoughts/feelings regarding the change, and can still be supportive ","time":1664997253000},{"user":"thinker","text":"even if it","time":1664997262000},{"user":"thinker","text":"It’s not an explicitly a “win win”, we will have gotten there through an understanding of how we both ","time":1664997346000},{"user":"thinker","text":"Feel","time":1664997349000},{"user":"helper","text":"Yes! I love that. And great instinct in changing 'should' to 'can' I see how you're already shifting your mental habits to a more compassionate path","time":1664997386000},{"user":"helper","text":"Sometimes, when I think about 'win-win's it also helps me to remember sometimes it can be a winnow-winlater, haha if that makes sense.. for example, you have this fear that this is your last chance to move to New York and so if you miss it, is it a full loss. But life is full of opportunity and you never know what will happen in the future. It may help you to feel naturally more glad and supportive of a decision not to go if you consider the possibility that your turn may come later","time":1664997498000},{"user":"helper","text":"Just a last little thought I had","time":1664997506000},{"user":"thinker","text":"that makes a ton of sense! ","time":1664997538000},{"user":"helper","text":"Yeah! I can see you are both young and exploring and the path is long before you","time":1664997603000},{"user":"helper","text":"What feelings come up for you when you think this new thought \"I can be more direct expressing my thoughts/feelings regarding the change, and can still be supportive even if it’s not a explicitly a “win win”, we will have gotten there through an understanding of how we both feel\"?","time":1664997622000},{"user":"thinker","text":"I think it’s similar to the relief I talked about before","time":1664997668000},{"user":"helper","text":"That's really great to hear. This new thought can help you then in the upcoming weeks and months","time":1664997694000},{"user":"helper","text":"And then, last question, and it's okay if it's the same answer! But how do you feel now, compared to when we started? ","time":1664997714000},{"user":"thinker","text":"Definitely more relaxed, I don’t feel conflicted about what to do moving forward ","time":1664997787000},{"user":"helper","text":"<3 wonderful, I'm excited for you and your upcoming adventures, with the strong foundation of this relationship and your ability to really examine decisions from every angle it will be a wise and fun couple of years to develop :)","time":1664997901000},{"user":"helper","text":"Remember to practice your new thought, sometimes it helps to write it down somewhere visible, or in your phone. Forging new paths in the brain can take some time and patience but it is worthwhile","time":1664997946000},{"user":"helper","text":"with that we are done! The payment and review button is beneath your new thought. 25 is a suggested amount, but you're welcome to do as much or little as you're able, and the review is infinitely helpful as well! ","time":1664997997000},{"user":"thinker","text":"Thank you, really appreciate your time!","time":1664998001000},{"user":"helper","text":"Before we part, would you be interested in making this session public? We find that many people experience similar troubles and it can be helpful to see how others found relief. It is entirely optional and anonymous if you choose to do so","time":1664998052000},{"user":"thinker","text":"Yup, happy to ","time":1664998058000},{"user":"helper","text":"Thanks :D","time":1664998062000},{"user":"helper","text":"best of luck to you friend! ","time":1664998067000},{"user":"helper","text":"until next time","time":1664998070000},{"user":"thinker","text":"Thank you! ","time":1664998075000}]}