{"notes":{"feelings":"Anxiety\nFear of failure","event":"Applying for an apartment yesterday","thought":"I feel like I'm going to fall in depression if I move out\n\nI don't want to be a burden to my cousin","behaviors":"Work to avoid\n\nAvoid touchy topics","labels":{"fortune-telling":true},"new_thought":"Change is coming and I am not alone\n"},"messages":[{"user":"helper","text":"Hi there, welcome to Cheeseburger. My name is Nathan.","time":1628117963000},{"user":"helper","text":"What is troubling you?","time":1628117974000},{"user":"thinker","text":"Hi nathan","time":1628117977000},{"user":"thinker","text":"Ok so I lost my mom in apr of 2019 and I did a big step by applying for an apartment and I’m kind of anxious ","time":1628118028000},{"user":"helper","text":"ohhh, I'm so sorry for your loss :/","time":1628118047000},{"user":"thinker","text":"It’s ok","time":1628118068000},{"user":"helper","text":"losing someone can bring about change in our lives","time":1628118084000},{"user":"helper","text":"Did you recently apply for the apartment?","time":1628118124000},{"user":"thinker","text":"Yes today and yes I had to experience change when I graduated on her birthday last month . It wasn’t until the next day when the Emontions came ","time":1628118188000},{"user":"helper","text":"Congrats on graduating! That is a wonderful achievement. I imagine it must have been tough to graduate on her birthday. It makes sense that you wouldn't feel it till afterwards. Sometimes our bodies do that as a way to help us ","time":1628118271000},{"user":"helper","text":"So now you have another change coming up. Moving out to an apartment. Tell me about this anxiety that seems to be coming up.","time":1628118308000},{"user":"helper","text":"What thoughts are you having?","time":1628118312000},{"user":"thinker","text":"I just feel like I’m going to fall in depression. I was living in my mom house until January and now I’m staying with my cousin be her children although I love them I do neeed my own space. But it help me feel a void when they’re around and when I move in i afraid that I’ll going to fall back into that. Like I know I’m able to visit but I just feel it rounding be the same ","time":1628118462000},{"user":"helper","text":"Thank you for sharing. I hear you. When you have a place of safety with family it is hard to leave even when you feel the need to go.","time":1628118527000},{"user":"helper","text":"I am hearing this deep need you have of autonomy, independence and freedom ","time":1628118565000},{"user":"helper","text":"But I also hear this fear you have","time":1628118578000},{"user":"thinker","text":"Yes. Like o feel that I don’t want to be an burden on my cousin cause she has a house full on her own. Ok that note I recently got a job now I able to afford a place to live. It’s just that I don’t want to make my self feel a burden but at the same time grow into my adult hood with the fear of failing ","time":1628118718000},{"user":"helper","text":"Can you explain this fear of failing? What thoughts are coming up? What does that 'fear of failing' feel like?","time":1628118769000},{"user":"thinker","text":"Like having my life together ","time":1628118788000},{"user":"thinker","text":"I just have this by that stuff like that . Even though my mom pass I had to take care of her being the only child now that she’s gone I really don’t want know what to do ","time":1628118841000},{"user":"thinker","text":"So o find myself busy in work to avoid feelings . That’s what I did when I knew she was passing ","time":1628118893000},{"user":"helper","text":"Not having your mom around and about to make a step into adulthood, it makes sense that you would be feeling these feelings","time":1628118986000},{"user":"thinker","text":"Yes and another thing . I have a spiritual mom and she  avails  herself to me but I just think it’s not the same ","time":1628119152000},{"user":"helper","text":"I don't know if anyone will be able to take the place of our moms. Moms are special. But it is wonderful that you have someone that is willing to step in and help with the role of 'spiritual mother'. ","time":1628119210000},{"user":"thinker","text":"Yeah maybe I should tell her hope I feel so she can navigate on nurturing me ","time":1628119256000},{"user":"helper","text":"What do you mean by 'navigating on nurturing me?\"","time":1628119280000},{"user":"thinker","text":"I always go around touchy topics to not cry (heal) so if I’m honest will show her the areas that are needed","time":1628119397000},{"user":"thinker","text":"To build a relationship with one another ","time":1628119417000},{"user":"helper","text":"Vulnerability can be scary but it sounds like you are wanting to give it a try because you value a relationship with her","time":1628119452000},{"user":"helper","text":"Tell me, how does this anxiety and fear around getting an apartment relate to how you feel the need to avoid touchy topics, crying (healing)? Are you afraid that if you get approved for this apartment you are going to be forced to face these emotions? ","time":1628119595000},{"user":"helper","text":"Don't worry about any spelling errors :)","time":1628119741000},{"user":"helper","text":"If I can't understand something I will just ask for clarification","time":1628119757000},{"user":"thinker","text":"It keeps moving forward i refreshed 5 times","time":1628119817000},{"user":"thinker","text":"But not the apartment fear of responsibility ","time":1628119830000},{"user":"helper","text":"I think I understand","time":1628119855000},{"user":"thinker","text":"But even it comes her death anniversary or birthday fear of reaching out ","time":1628119863000},{"user":"helper","text":"Thank you for sharing. I know this part of being vulnerable is not easy. You are doing good work here by opening up.","time":1628119889000},{"user":"helper","text":"Right now I am going to go through and put together a summary of what we've talked about before we move on okay?","time":1628119909000},{"user":"thinker","text":"Ok!","time":1628119920000},{"user":"helper","text":"During this time, I recommend you to spend a minute or two to focus on your breath. If that means closing your eyes and putting your hands on your chest then do it. If it looks like opening a window or stepping outside for a second, do it.","time":1628119976000},{"user":"helper","text":"I will be putting together your summary and we can go over it afterwards okay? :)","time":1628120001000},{"user":"thinker","text":"Ok","time":1628120006000},{"user":"thinker","text":"Thanks so much Nathan !","time":1628120023000},{"user":"helper","text":"For the last couple years you have been living in a place of transition. After losing your mom you moved in with your cousin as you attended school and worked. You are having a need for independence now that you have graduated and make enough money to move out. Today you applied for an apartment! But you are filled with anxiety and fear. These questions of \"what if this happens, what if I fail and can't make it on my won? What will I do on my Mother's death anniversary or her birthday if I am living by myself?\" In the past you have avoided being alone too much by working or navigating around touch topics that might make you cry because it could be overwhelming. You have a value of independence that you want to honor by getting an apartment but you also have this battling fear that puts your need of independence at risk. ","time":1628120287000},{"user":"helper","text":"Is there anything missing?","time":1628120309000},{"user":"thinker","text":"No that’s about it ","time":1628120319000},{"user":"thinker","text":"Thanks for letting me realize ","time":1628120341000},{"user":"helper","text":"Of course! We need to talk to others in order to see ourselves more fully. We all need it :)","time":1628120370000},{"user":"helper","text":"How was your time focusing on your breath? How is your breathing right now?","time":1628120398000},{"user":"thinker","text":"Well I’m crying right now ","time":1628120419000},{"user":"thinker","text":"But it has went back to normal speed ","time":1628120459000},{"user":"helper","text":"mmmm its okay to cry. 😢 ","time":1628120467000},{"user":"helper","text":"Are you alright? ","time":1628120479000},{"user":"thinker","text":"Yes ","time":1628120490000},{"user":"helper","text":"Take your time. It's okay","time":1628120527000},{"user":"helper","text":"Let me know when and if you are wanting to move forward with this service. Or if you need to cry and stay in this moment longer than that is completely okay too! Listen to your needs","time":1628120569000},{"user":"thinker","text":"Ok I think I’m ready now ","time":1628120762000},{"user":"helper","text":"okay","time":1628120775000},{"user":"helper","text":"This time is yours, so whatever you need :)","time":1628120787000},{"user":"helper","text":"If at anytime you need to stop to process something or to just cry, let me know and we will honor that space okay?","time":1628120821000},{"user":"thinker","text":"Ok","time":1628120855000},{"user":"helper","text":"Let's focus on the troubling thought you brought up that has led us here. The thought of \"I feel like I'm going to fall in depression\" (concerning if you move out) ","time":1628120911000},{"user":"helper","text":"Our brains and our bodies are wired to give us signals to try and protect us","time":1628120943000},{"user":"helper","text":"We try to interpret the world in hopes to make sense of it so that way we know what to do or not do next","time":1628120981000},{"user":"helper","text":"Our Thoughts follow patterns. We all follow those patterns as people. Here, we call them 'Cheesy Thoughts' lol","time":1628121023000},{"user":"helper","text":"It is a thought that is causing feelings that then affect our behaviors","time":1628121063000},{"user":"helper","text":"We find it helpful to take a step back and observe this thought and then to recognize what type of pattern is happening so we can address it","time":1628121093000},{"user":"helper","text":"We are going to identify what type of pattern this thought of \"I feel like I'm going to fall in depression if I move out\" is falling into.","time":1628121133000},{"user":"helper","text":"Does this make sense? ","time":1628121140000},{"user":"thinker","text":"Yes ","time":1628121163000},{"user":"helper","text":"Do you have any questions?","time":1628121173000},{"user":"thinker","text":"No ","time":1628121193000},{"user":"helper","text":"okay, lets focus quickly before we do that on your breathing again. I want you to take 3 big deep breaths in and out before we move on okay?","time":1628121228000},{"user":"helper","text":"Let me know when you are feeling ready to move on","time":1628121239000},{"user":"thinker","text":"Ok I’m ready now","time":1628121296000},{"user":"helper","text":"Wonderful :)","time":1628121326000},{"user":"helper","text":"The main 'Cheesy' thought I am seeing happen is Fortune Telling","time":1628121359000},{"user":"helper","text":"This is when our brain is trying to run through future scenarios of what is going to happen","time":1628121383000},{"user":"helper","text":"The goal is great, our brain is trying to get our bodies ready for change but sometimes our thoughts become our realities even though they have not happened yet","time":1628121428000},{"user":"helper","text":"In your case, your brain is saying, \"if you move out and seek independence you are going to fall into depression, especially on special days that remind you of your mother.\"","time":1628121482000},{"user":"helper","text":"When we listen to this thought and recognize it as 'truth' we are only considering one possibility and this possibility is rooted in anxiety and fear. When this thought takes root in our bodies we continually feel it and then we behave in ways to avoid it such as working more and more to avoid these feelings or finding ways not to talk about touchy topics because it might trigger us. And your brain is saying \"you might not be able to handle this.\" Living alone could be \"too hard.\" ","time":1628121622000},{"user":"helper","text":"When you are done reading this, I'd love to hear from you about your thoughts on this :)","time":1628121660000},{"user":"thinker","text":"I do this to prepare my self of what might happen in the future ","time":1628121815000},{"user":"helper","text":"That makes sense. And when the brain tries to prepare us, in this case, it is recognizing mainly one possible future outcome, instead of the many many unknown could be wonderful outcomes :)","time":1628121914000},{"user":"thinker","text":"Yeah that’s true ","time":1628121940000},{"user":"helper","text":"How do you feel now that we've recognized this thought? ","time":1628121969000},{"user":"thinker","text":"Need to do a lot of applying ","time":1628121987000},{"user":"helper","text":"Are you feeling your need for independence and wanting to honor it? ","time":1628122015000},{"user":"thinker","text":"It’s a risk but I’m willing to do it ","time":1628122029000},{"user":"helper","text":"I love it! Risk comes with reward. It is not easy but if you do something that will honor what you value then it seems to be worth it.","time":1628122062000},{"user":"thinker","text":"Correct ","time":1628122073000},{"user":"helper","text":"We still have one trick up our sleeves to address this 'troubling thought'","time":1628122105000},{"user":"helper","text":"A tool that will break into this thought and maybe help ease the anxiety and fear","time":1628122133000},{"user":"helper","text":"and that is to create a New Thought. ","time":1628122148000},{"user":"helper","text":"A new thought will help address this event and this previous thought. If we purposely think new thoughts we can rewire our brains in some incredible ways! We can root ourselves in our values.","time":1628122214000},{"user":"thinker","text":"Makes sense","time":1628122225000},{"user":"helper","text":"great!","time":1628122233000},{"user":"helper","text":"What might a New Thought be that you can start thinking?","time":1628122251000},{"user":"thinker","text":"That this new journey fir me waking into adult hoof will be a new change but a good change ","time":1628122331000},{"user":"helper","text":"how does it feel to think that thought?","time":1628122362000},{"user":"thinker","text":"Better than thinking the worst outcome ","time":1628122395000},{"user":"helper","text":"That's good!","time":1628122401000},{"user":"helper","text":"I think we can define this thought even more to create a sense of joy if that is what you want","time":1628122428000},{"user":"thinker","text":"Yes ","time":1628122450000},{"user":"helper","text":":)","time":1628122453000},{"user":"helper","text":"Let's use some stronger language (not swearing haha) just something more powerful","time":1628122486000},{"user":"helper","text":"maybe something like \"Change is coming and I am not alone\" ","time":1628122539000},{"user":"thinker","text":"Sounds good ","time":1628122557000},{"user":"helper","text":"I think this might also address the fear and anxiety of dealing with any feelings of depression when you have your own apartment. Like you said, you have a spiritual mother and also a cousin that seem to be there for you :)","time":1628122596000},{"user":"thinker","text":"Yeah they are","time":1628122613000},{"user":"helper","text":":)","time":1628122616000},{"user":"helper","text":"What feelings come up when you think \"change is coming and I am not alone\"","time":1628122638000},{"user":"thinker","text":"Excited and appreciated🥰","time":1628122663000},{"user":"helper","text":"Awesome!","time":1628122669000},{"user":"helper","text":"Let's go with that then :)","time":1628122674000},{"user":"helper","text":"How is your breathing right now? ","time":1628122696000},{"user":"thinker","text":"Relax","time":1628122706000},{"user":"helper","text":"Wonderful!","time":1628122714000},{"user":"helper","text":"That is our service and our time :) ","time":1628122728000},{"user":"helper","text":"Remember to use this New Thought as a tool.","time":1628122737000},{"user":"helper","text":"When your brain says this unhelpful fortune telling thing, take a second, thank your brain for trying to look out for you but then remind yourself of this New Thought.","time":1628122782000},{"user":"helper","text":"It will take some repetition and practice and at first feel awkward but after a while it becomes natural :) ","time":1628122831000},{"user":"thinker","text":"Ok sounds great thank you so much Nathan. I’ll give this a try even it comes up","time":1628122834000},{"user":"thinker","text":"I’s there a way to save this conversation?","time":1628122853000},{"user":"helper","text":"You can copy the URL and bookmark it and come back any time to look at it","time":1628122877000},{"user":"helper","text":":)","time":1628122879000},{"user":"thinker","text":"Ok","time":1628122891000},{"user":"helper","text":"Would it be okay for us to share an anonymized version of this session to possibly use on our website? ","time":1628122910000},{"user":"thinker","text":"Sure","time":1628122917000},{"user":"helper","text":"Great, thank you!","time":1628122925000},{"user":"helper","text":"I will check back in a few weeks if you would like :) ","time":1628122941000},{"user":"helper","text":"Just to see how you are doing. I will message you on this same URL. Would that be alright? ","time":1628122961000},{"user":"thinker","text":"Sure that sounds great ","time":1628122983000},{"user":"helper","text":"alright, well you are all done here :) I look forward to hearing about how the apartment hunting goes :)","time":1628123007000},{"user":"helper","text":"You got this! ","time":1628123010000},{"user":"thinker","text":"Sounds good hope you have a great day ","time":1628123025000},{"user":"helper","text":"you too! Good night :)","time":1628123033000},{"user":"thinker","text":"Goodnight ","time":1628123039000},{"user":"helper","text":"Hey there! This is Nathan. I just wanted to check in with you. Have you been able to use your New Thought since we last spoke? How are you? Did you end up moving into that apartment? Hope all is well! ","time":1630020415000},{"user":"thinker","text":"Hi Nathan yes I have using the thought to be more aware of change and expect it instead of reject ir","time":1630022381000},{"user":"thinker","text":"About the apartment she was not doing her job well","time":1630022583000},{"user":"thinker","text":"Story short I experience racial discrimination ","time":1630022606000},{"user":"thinker","text":" I replied ","time":1630022741000},{"user":"thinker","text":"And I’m more opening to speak about touchy topics and aloud healing to step in ","time":1630022820000}]}