{"notes":{"feelings":"Loneliness\nDespair","event":"waking up in the morning knowing I will not talk to anyone other than landlord, colleagues etc.","thought":"My youth is passing me by and when I'm old I will have nothing to look back on.\n\nloneliness kills people & combined with my medical history it will contribute to the shortening of my life\n\nI'm worthless","behaviors":"Stopping eating\nFinding basic care impossible or requiring huge effort\nGetting drunk and high with weed\nSleep in place of being with life","labels":{"fortune-telling":true},"new_thought":"the only thing that can upset us is our own thoughts, and we can determine which of these we allow into our mind"},"messages":[{"user":"thinker","text":"I'm having extreme difficulty handling loneliness, not having any close relationships, and how it affects my self esteem and wellbeing","time":1666645971000},{"user":"helper","text":"Hi there, welcome to Cheese!","time":1666897262000},{"user":"helper","text":"sorry to hear about the difficulty with handling loneliness","time":1666897282000},{"user":"helper","text":"and the challenge of not having close relationships","time":1666897297000},{"user":"thinker","text":"thanks, it's pretty hard on me","time":1666897325000},{"user":"helper","text":"Yeah I'm getting that from what you wrote","time":1666897336000},{"user":"helper","text":"to begin the time container for this session is that I'm available for about one hour so we'll plan on closing at the end of the hour","time":1666897362000},{"user":"helper","text":"how does that sound to you?","time":1666897365000},{"user":"thinker","text":"sounds fine to me","time":1666897373000},{"user":"helper","text":"alright","time":1666897375000},{"user":"helper","text":"So it makes sense to me that you'd feel lonely if you don","time":1666897395000},{"user":"helper","text":"don't have close relationships","time":1666897403000},{"user":"helper","text":"as humans we need close relationships as far as I know","time":1666897416000},{"user":"thinker","text":"we definitely do","time":1666897428000},{"user":"helper","text":"go ahead...","time":1666897436000},{"user":"thinker","text":"I found this out not long ago","time":1666897454000},{"user":"thinker","text":"Loneliness kills people faster than obesity and smoking more than 20 cigarettes per day","time":1666897468000},{"user":"helper","text":"wow","time":1666897473000},{"user":"thinker","text":"and the way it does that is by causing the brain to redirect all it's energy towards areas of the brain that deal with threat detection and so on","time":1666897497000},{"user":"helper","text":"wow","time":1666897509000},{"user":"thinker","text":"causing the brain to eventually die from starvation or something like that","time":1666897516000},{"user":"helper","text":"well good to know this as if we don't know of that threat we can be asleep to it","time":1666897535000},{"user":"thinker","text":"I guess so","time":1666897546000},{"user":"helper","text":"so there is a strong need for connection in you I imagine","time":1666897566000},{"user":"helper","text":"do you feel something like that?","time":1666897573000},{"user":"thinker","text":"oh god yes","time":1666897578000},{"user":"thinker","text":"I have spent literally (I did the maths) 99% of my time alone for the past 3 years","time":1666897597000},{"user":"helper","text":"wow","time":1666897602000},{"user":"helper","text":"trying to get to know more of how and where you live, not specifically but if you live in a city or in the woods etc.","time":1666897639000},{"user":"thinker","text":"I live in a relatively small city in the UK, but it's quite well known","time":1666897655000},{"user":"helper","text":"ahh ok...","time":1666897658000},{"user":"thinker","text":"200k people approx","time":1666897673000},{"user":"helper","text":"oh yeah, small city...and do you have a sense of what keeps you from these realtionships?","time":1666897685000},{"user":"thinker","text":"Well, I do, and I think it's multiple things","time":1666897706000},{"user":"thinker","text":"before i elaborate, I'd like to explain that whilst I do have friends, they don't live anywhere close to me and so I only get to see them 2x a year or so","time":1666897735000},{"user":"helper","text":"ahhh ok.","time":1666897737000},{"user":"thinker","text":"I think it's a combination of: me having a \"lazy eye\", being somewhat on the autism spectrum (but quite high functioning), and general social awkwardness","time":1666897795000},{"user":"helper","text":"okay...","time":1666897805000},{"user":"thinker","text":"perhaps to an extent people don't like my personality, I tend to be more true to myself than most people I'd say","time":1666897815000},{"user":"helper","text":"the truth can be so useful and sometimes abrasive in relationships","time":1666897832000},{"user":"thinker","text":"very true","time":1666897838000},{"user":"thinker","text":"but my opinion is that by being who I really am, and not changing myself too much for the tastes of other people, when I do find people that like me, they'll like me for who I really ","time":1666897868000},{"user":"thinker","text":"am","time":1666897869000},{"user":"helper","text":"yes I can relate to this","time":1666897875000},{"user":"thinker","text":"not for the persona I put on","time":1666897876000},{"user":"helper","text":"yeah the persona may create some sense of temporary but more superficial connection","time":1666897895000},{"user":"thinker","text":"I guess superficial beats nothing","time":1666897914000},{"user":"helper","text":"it can but its also to me like mediocrity and how that kind of staleness can be quite challenging in contrast to the sharper or more intense trouble","time":1666897967000},{"user":"helper","text":"sometimes easier to deal with a stronger trouble than a dulling experience","time":1666897989000},{"user":"helper","text":"anyways... when you look at this trouble in your life...what would you say is most troubling for you? The loneliness?","time":1666898034000},{"user":"thinker","text":"That's my biggest issue right now yes","time":1666898048000},{"user":"thinker","text":"I can go up to 2 weeks without hearing a friend's voice, they're always so busy these days","time":1666898063000},{"user":"thinker","text":"and it's so soul draining to know when you wake up in the morning that you will not have anyone to talk to other than your landlord, your colleagues, etc","time":1666898107000},{"user":"thinker","text":"it's been like this for roughly 3 years now, and although I do see friends and family a few times a year, it's just so hard to deal with outside of those times","time":1666898148000},{"user":"thinker","text":"I'm a relatively young guy, just about to turn 22 in December, and when I see people having the time of their lives in Uni, going to festivals, making memories/friends for life/getting into relationships it crushes me that my youth has been wasted by having no one to share it with","time":1666898211000},{"user":"helper","text":"I'm sorry to hear this...","time":1666898219000},{"user":"helper","text":"and I have the context of what you shared that comprises the \"awkwardness\" and challenges to connect. Makes so much sense to me and I feel similar about how much I feel what satiates me is connection that is meaningful and deep","time":1666898273000},{"user":"helper","text":"When you think of this contrast of seeing the people at Uni and seeing yourself waking up without any hope of connecting with anyone aside from your landlord and colleagues. What do you think to yourself, or what would you say is the most troubling thought you have regarding this","time":1666898355000},{"user":"thinker","text":"I've always had a keen awareness of the shortness of life","time":1666898366000},{"user":"thinker","text":"I had 2 close family members die when I was about 11, within a year or so of each other","time":1666898380000},{"user":"helper","text":"yeah that will give us a sense of the shortness","time":1666898409000},{"user":"thinker","text":"to answer your question, I think of how my youth is passing me by and when I'm old I will have nothing to look back on. I'm close to finishing uni, and soon I'll have to put on the suit and tie and work my 40 hours like everyone else. At least before that moment came, these other people had the time of their lives. I had nothing ","time":1666898442000},{"user":"thinker","text":"I also then think about how loneliness kills people, and how that combined with my medical history will contribute to the shortening of my life","time":1666898478000},{"user":"helper","text":"I can imagine","time":1666898513000},{"user":"thinker","text":"it tends to make one feel totally worthless when everyone around you have people to do stuff with, and you have no one","time":1666898518000},{"user":"helper","text":"Sorry to hear this","time":1666898523000},{"user":"helper","text":"I think of what you're sharing with me and feeling the openness with which you're sharing and I believe noone should have to carry such a burden and that we as a society with the structures we create and play are making this happen sadly","time":1666898577000},{"user":"thinker","text":"yep that's the disease of the 21st century","time":1666898606000},{"user":"thinker","text":"more connected but more isolated than ever","time":1666898615000},{"user":"helper","text":"well put","time":1666898620000},{"user":"helper","text":"as you may have noticed I started taking some notes on the right hand side","time":1666898637000},{"user":"helper","text":"let me know if any of it feels untrue or you'd like to adjust anything","time":1666898653000},{"user":"thinker","text":"seems bang on to me","time":1666898664000},{"user":"helper","text":"alright","time":1666898669000},{"user":"helper","text":"which thought is most troubling to you at this time?","time":1666898688000},{"user":"thinker","text":"probably the one about my youth","time":1666898701000},{"user":"helper","text":"okay","time":1666898707000},{"user":"helper","text":"and when you think this thought what feelings come up for you?","time":1666898719000},{"user":"helper","text":"I hear the loneliness","time":1666898724000},{"user":"thinker","text":"I'm not quite sure how to put it into words, or even if words for those particular feelings exist","time":1666898744000},{"user":"thinker","text":"I mostly just think about how every second that passes I get closer to death, and the need to spend my one existence wisely and such","time":1666898768000},{"user":"helper","text":"sounds like maybe some despair","time":1666898781000},{"user":"thinker","text":"I'd have to look through a thesaurus, but that's close enough","time":1666898797000},{"user":"helper","text":"sure","time":1666898797000},{"user":"helper","text":"fear?","time":1666898805000},{"user":"helper","text":"is it scary?","time":1666898812000},{"user":"thinker","text":"the idea of dying unfulfilled is, yes","time":1666898824000},{"user":"thinker","text":"by unfulfilled, that to me means not having close personal relationships, people to make memories with, etc","time":1666898843000},{"user":"helper","text":"yeah","time":1666898868000},{"user":"helper","text":"thanks for explaining","time":1666898875000},{"user":"helper","text":"so you find yourself in this particular moment of your life - waking up to that aloneness and lack of connection - you think to yourself \"My youth is passing me by and when I'm old I will have nothing to look back on, I'll be unfulfilled.\" And you feel loneliness you feel feelings you don't know words for maybe despair...","time":1666898994000},{"user":"thinker","text":"that's it","time":1666898999000},{"user":"helper","text":"and when you are in this place what do you find yourself doing or not doing in reaction or response?","time":1666899020000},{"user":"thinker","text":"These feelings recently caused my 1st depressive episode in 18 months","time":1666899036000},{"user":"thinker","text":"I stopped eating","time":1666899039000},{"user":"thinker","text":"I found the smallest task like getting out of bed, making breakfast nearly impossible or requiring huge amounts of effort","time":1666899069000},{"user":"thinker","text":"I got drunk and high basically every day, and any moment I could get away with it I would sleep. I spent nearly an entire day sleeping just so I wouldn't have to think and suffer","time":1666899104000},{"user":"thinker","text":"Not \"basically\" everyday, I DID get high *every* day","time":1666899135000},{"user":"thinker","text":"Weed is one of the only things that helps. I get told it's unhealthy to smoke everyday as if I don't know that, but when it's all you have what else are you going to do","time":1666899171000},{"user":"helper","text":"makes sense","time":1666899175000},{"user":"helper","text":"I appreciate that you're being so open with me","time":1666899184000},{"user":"helper","text":"I hope you feel respected here","time":1666899188000},{"user":"thinker","text":"I do","time":1666899193000},{"user":"helper","text":"I'm glad","time":1666899199000},{"user":"helper","text":"So, you find yourself in this cycle, waking up to an alone life... you think to yourself my youth is passing me by and I'll have nothing when I die... you feel constricting feelings such as loneliness and despair... and then you become depressed stopping eating and sleeping in place of being with life as well as giving yourself some relief getting high","time":1666899308000},{"user":"thinker","text":"that's what my past 2 weeks looked like yeah","time":1666899324000},{"user":"helper","text":":( sorry to hear this","time":1666899330000},{"user":"thinker","text":"well I did get a fair bit of good news all at once this week which fortunately broke me out of my depressive episode which otherwise could've gone on for months","time":1666899363000},{"user":"helper","text":"that sounds helpful","time":1666899370000},{"user":"thinker","text":"one of my friends who lives several hours away has a free house, so I'm going to his city for the weekend. I also have a rare party coming up because it's halloween soon, and I'm getting my lazy eye corrected a week from now","time":1666899412000},{"user":"helper","text":"wow, those sounds like potentially powerful actions","time":1666899425000},{"user":"helper","text":"in this context","time":1666899430000},{"user":"thinker","text":"the last one especially","time":1666899434000},{"user":"helper","text":"I can imagine","time":1666899439000},{"user":"thinker","text":"It's really tough on you - every time you look in the mirror you see how your face/eyes are just abnormal","time":1666899480000},{"user":"thinker","text":"and you know everyone else can see it as well, you can't hide it unless you're wearing mirrored sunglasses","time":1666899501000},{"user":"thinker","text":"which doesn't happen much in the uk haha","time":1666899509000},{"user":"helper","text":"I can imagine","time":1666899537000},{"user":"helper","text":"faces are such powerful symbols ","time":1666899566000},{"user":"thinker","text":"And the eyes especially so","time":1666899577000},{"user":"helper","text":"yeah","time":1666899579000},{"user":"thinker","text":"Fun fact: humans are the only great ape to have whites in their eyes, because of how advantageous it was to be able to read someone's facial expressions through their eyes","time":1666899604000},{"user":"helper","text":"thank you for sharing","time":1666899609000},{"user":"helper","text":"makes sense","time":1666899615000},{"user":"thinker","text":"They did studies on kids as young as 3 months old I think, and they found that even kids that young have an in-built bias towards people with lazy eyes","time":1666899646000},{"user":"helper","text":"makes sense","time":1666899650000},{"user":"thinker","text":"Although my friends disagree, I think this is probably a major factor in my loneliness","time":1666899662000},{"user":"helper","text":"have you had the lazy eye since you were young?","time":1666899675000},{"user":"thinker","text":"Age 3 I think it first showed up","time":1666899682000},{"user":"helper","text":"wow so yes","time":1666899689000},{"user":"helper","text":"I can see, I know from being close to infants how wired we are for eye contact","time":1666899706000},{"user":"thinker","text":"I've always had trouble with eye contact as I'm sure you can imagine haha","time":1666899723000},{"user":"helper","text":"yeah I can ","time":1666899726000},{"user":"helper","text":"I hope with intensity in my gut that your procedure will work out with ease","time":1666899761000},{"user":"helper","text":"I'm glad to hear that","time":1666899788000},{"user":"thinker","text":"Thanks, it should. It's a relatively short and non-invasive surgery, and I've been tested plenty to make sure to minise the risk of adverse outcomes","time":1666899794000},{"user":"helper","text":"coming back to the flow of the cheese method... at cheese we try to help people acknowledge thoughts that don't work and create and have thoughts that help to influence improvements in life through new behaviors","time":1666899845000},{"user":"thinker","text":"so CBT basically?","time":1666899858000},{"user":"helper","text":"yes","time":1666899860000},{"user":"thinker","text":"ah of course","time":1666899864000},{"user":"helper","text":"when looking at your thought \"my youth is passing me by and when I'm old I will have nothing to look back on\"... I see the sense of alarm from the very real loneliness you have been experiencing and the effects leading to depression... I also see this part of looking into the future and saying \"I will have nothing to look back on\"","time":1666899963000},{"user":"helper","text":"I hear this and sense the alarm but also can imagine that it paints a bleak picture that lands you in those feelings or loneliness and despair ","time":1666899999000},{"user":"helper","text":"does this feel right?","time":1666900005000},{"user":"thinker","text":"Yes","time":1666900023000},{"user":"helper","text":"go ahead...","time":1666900032000},{"user":"thinker","text":"Although I am \"fortune telling\" to an extent, and I know why that's a bad thing, this thought of my youth passing me at least seems to be quite objective","time":1666900063000},{"user":"helper","text":"yes","time":1666900064000},{"user":"helper","text":"that makes sense to me","time":1666900069000},{"user":"helper","text":"what's tricky about thoughts that seem objective is finding the balance of being able to tell what's happening clearly but then not giving ourselves up in the process concluding a negative life is to happen","time":1666900114000},{"user":"thinker","text":"There is an element of learnt helplessness to my psyche for sure","time":1666900148000},{"user":"helper","text":"and mine","time":1666900154000},{"user":"helper","text":"when looking at this event, of how you wake up.. and the thought of life passing and seeing the depressive behaviors that come after it... makes sense and seems human to me to be in that loop","time":1666900243000},{"user":"helper","text":"I hope that by suggesting an opportunity for a shift of perspective that you don't live me as criminalizing your experience","time":1666900276000},{"user":"thinker","text":"certainly not, if anything I need people to counter me so I don't allow myself to get stuck in my own head","time":1666900309000},{"user":"helper","text":"I'm happy to support","time":1666900318000},{"user":"helper","text":"so these behaviors make sense with this chain of event thought and feelings","time":1666900343000},{"user":"helper","text":"when you think of this event, this place in life and the contrast with those with connection... what thought might you prefer to take with you instead of the one of life passing by?","time":1666900379000},{"user":"helper","text":"I'm happy to cocreate one with you","time":1666900392000},{"user":"thinker","text":"I quite like the teachings of the stoic philosophers, and try to use them in my daily life with varying results","time":1666900411000},{"user":"thinker","text":"one such teaching is that of amor fati, or the love of your own life and what the universe grants you (or doesn't)","time":1666900446000},{"user":"thinker","text":"because no one who ever lived before has exactly the same life as you, and no on after you will either. Your life, your history, the obstacles you face have in a sense been tailor made to you, as challenges for you to overcome","time":1666900496000},{"user":"thinker","text":"another way of seeing it is that if you align your will to the world, you will live in harmony with it. If you moan, complain, despair at the state of the world, your life will be not only miserable, but out of harmony with the world/universe","time":1666900542000},{"user":"helper","text":"Seems like rich philosophy to me","time":1666900547000},{"user":"thinker","text":"It has helped me a lot","time":1666900552000},{"user":"helper","text":"great :) and so if we were to craft a thought in line with this philosophy that feels useful to you now in relationship to this trouble","time":1666900580000},{"user":"helper","text":"anything come up for you?","time":1666900589000},{"user":"thinker","text":"hmmm","time":1666900593000},{"user":"thinker","text":"I'm not great at thinking on my feet aha","time":1666900659000},{"user":"helper","text":"no worries ","time":1666900661000},{"user":"helper","text":"I was sensing this strong voice in what you were writing","time":1666900676000},{"user":"helper","text":"I'm imagining a thought that might feel helpful might be on that feeds a sense of determination and hope towards the life you want and all that entails","time":1666900721000},{"user":"helper","text":"like the actions you've taken to get the surgery for your eye","time":1666900734000},{"user":"helper","text":"like what you're doing to visit with your friend","time":1666900745000},{"user":"helper","text":"and the party","time":1666900749000},{"user":"thinker","text":"right","time":1666900755000},{"user":"thinker","text":"The stoic philosophy helps me most when it is about issues/problems that I myself can solve, or are unsolveable entirely ","time":1666900788000},{"user":"thinker","text":"but when it comes to loneliness/other people, that's where it becomes a lot harder","time":1666900801000},{"user":"helper","text":"much more dynamic","time":1666900806000},{"user":"thinker","text":"it's simply one of those things that human beings are primed to hate, but it also relies heavily on other people helping us not be lonely, which requires you to be influential with people, which is it's own issue","time":1666900837000},{"user":"thinker","text":"but being more stoic generally would help","time":1666900848000},{"user":"thinker","text":"I just need to remind myself more often","time":1666900856000},{"user":"helper","text":"okay","time":1666900858000},{"user":"helper","text":"when I saw you write the piece about the stoic philosophy helping you with issues you can solve yourself I noticed that I use that perspective when I approach relationships with fellow humans","time":1666900910000},{"user":"helper","text":"I take the moving pieces of relationship, of what seems to create closeness and these moving pieces such as how true I am in the connection and I adjust them","time":1666900950000},{"user":"helper","text":"I may need to be more emotionally affective in one way or another or less","time":1666900965000},{"user":"helper","text":"I may need to be more direct about what my desires/needs are","time":1666900981000},{"user":"helper","text":"etc.","time":1666900984000},{"user":"helper","text":"I mention this incase it feels useful as you think about a thought that will help you feel better","time":1666901008000},{"user":"thinker","text":"so it's about the details?","time":1666901034000},{"user":"thinker","text":"analysing things closely and seeing where things work, and where things don't?","time":1666901051000},{"user":"helper","text":"I think so, that's what increases my sense of trust when I embark on some adventure","time":1666901061000},{"user":"helper","text":"attention to details","time":1666901065000},{"user":"helper","text":"noticing the uniqueness","time":1666901084000},{"user":"thinker","text":"I've been told that I \"miss the forest for the trees\" quite a lot throughout my life and I have to agree","time":1666901101000},{"user":"helper","text":"you get so focused on details and lose a sense of the whole person?","time":1666901129000},{"user":"thinker","text":"yep","time":1666901132000},{"user":"helper","text":"okay, so I'm imagining a thought that helps you remember to or learn how to see a whole person more might help?","time":1666901158000},{"user":"thinker","text":"Sure, I think that would help","time":1666901171000},{"user":"helper","text":"I want to learn how to see people more wholly","time":1666901202000},{"user":"helper","text":"if I learn how to see people more whole, I can get closer to my goal of deeper more meaningful connections in my life","time":1666901235000},{"user":"thinker","text":"mmm","time":1666901250000},{"user":"helper","text":"what are you noticing?","time":1666901303000},{"user":"thinker","text":"That I have definitely been only paying attention to specific aspects of people's personality/character instead of trying to see them wholly","time":1666901367000},{"user":"helper","text":"perhaps both","time":1666901392000},{"user":"thinker","text":"I'm not sure to what extent this is a consequence of my loneliness or a cause of it (perhaps both), but it can't hurt to evaluate people more holistically","time":1666901413000},{"user":"thinker","text":"this isn't something I'd really thought about before","time":1666901428000},{"user":"helper","text":"oh I hope its useful... when I think about connecting more wholly with people what I do is that i find in me an interest in the unfolding diversity that is a person with varying degrees of qualities that interest me but knowing that showing an equanimousness towards them with interest creates the possibility of greater connection!","time":1666901519000},{"user":"helper","text":"practicing unconditional positive regard so long as it doesn't harm anyone","time":1666901554000},{"user":"thinker","text":"I have become a bit jaded and cynical over the years, unconditional positive regard is a great idea actually, but may take some practice","time":1666901595000},{"user":"helper","text":"absolutely takes practice","time":1666901606000},{"user":"helper","text":"did for me","time":1666901608000},{"user":"helper","text":"but diverse exposure to different people","time":1666901619000},{"user":"helper","text":"different ages, cultures etc.","time":1666901626000},{"user":"helper","text":"can help a lot","time":1666901632000},{"user":"helper","text":"I have worked in different places with people in very different life circumstances and that helped me a lot with this","time":1666901657000},{"user":"helper","text":"showing curiosity towards what they value","time":1666901671000},{"user":"helper","text":"being interested in \"them\"","time":1666901691000},{"user":"helper","text":"with the parts that stand out as helpful to you here, what is a thought you'd like to take with you when thinking about the challenge of current life","time":1666901755000},{"user":"thinker","text":"ah, I remember a good one","time":1666901770000},{"user":"thinker","text":"\"the only thing that can upset us is our own thoughts, and we can determine which of these we allow into our mind\"","time":1666901804000},{"user":"helper","text":"thats powerful!","time":1666901808000},{"user":"helper","text":"how does it make you feel when you think that thought?","time":1666901833000},{"user":"thinker","text":"hopeful actually, and that isn't a word I use lightly","time":1666901847000},{"user":"thinker","text":"it's a lot easier said than done, but it can be done","time":1666901859000},{"user":"helper","text":":)","time":1666901863000},{"user":"thinker","text":"I got more out of this session than I was expecting actually","time":1666901887000},{"user":"helper","text":"I'm glad :)","time":1666901889000},{"user":"helper","text":"its simple but we try to make sure its real","time":1666901899000},{"user":"helper","text":"no worries","time":1666901922000},{"user":"thinker","text":"Well, I won't keep you any longer especially as we're over-time. But thanks for everything and I hope you have a good day/night wherever you are","time":1666901934000},{"user":"helper","text":"of course...likewise :).. well wishes for your adventures with the surgery as well as connecting with friend and potential new friends","time":1666901957000},{"user":"helper","text":"they'll be a possibiility for a review if you wish and also a possibility for a donation if you wish to","time":1666901985000},{"user":"thinker","text":"I'll do both","time":1666901991000},{"user":"helper","text":"lastly if you wish to make this session \"public\" it means someone interested will be able to learn from reading what's there. I don't think you shared any identifying info.","time":1666902035000},{"user":"thinker","text":"Sure, no problem, the public chats are what convinced me to try this","time":1666902041000},{"user":"helper","text":"excellent","time":1666902045000},{"user":"helper","text":"know you're welcome to come back any time!","time":1666902056000},{"user":"helper","text":"until next time!","time":1666902065000},{"user":"thinker","text":"I will should I need it, and thanks again!","time":1666902067000}]}