{"notes":{"feelings":"-concerned\n-exhausted\n-apathetic\n-tired\n-lonely\n-resistance\n-confused","behaviors":"-distancing self from group","thought":"-People think I'm aloof\n-People think I don't understand the joke\n-Perhaps my hearing loss has shaped my personality and my experience in school in ways that are outside of my natural make-up\n-It's not worth it\n-I'm not feeling like I have the option to choose whether or not I want to be social right now because I am feeling isolated\n***I want companionship but it's too much work***\n\nValue: Meaningful Connection","event":"I've been intentionally putting more space between myself and others while in a group to avoid conversation, even though I am desiring companionship","labels":{"black-or-white-thinking":true},"new_thought":"I can't be friendly all the time, and maybe less than some. That's not the end of the world.  I kind of like to be lonely sometimes actually"},"messages":[{"user":"helper","text":"Good morning! :)","time":1674293561000},{"user":"thinker","text":"Heyy sorry one second I went out to book another night ","time":1674293572000},{"user":"helper","text":"(okay, just let me know when you're settled :) )","time":1674293580000},{"user":"thinker","text":"It's so beautiful out right now, I decided to stay in bed for this session haha but when I went out I saw it had snowed all night","time":1674293681000},{"user":"thinker","text":"Snow in Prague <3","time":1674293689000},{"user":"helper","text":"Ohhh how lovely!  That sounds gorgeous.  No snow here haha, but it's also a beautiful morning.  My family left last night and we're in a sunny air bnb.  Prague!  Wow!","time":1674293743000},{"user":"thinker","text":"That sounds lovely too! I hope it was a good visit and I'm sure it's nice to return to your little trio too","time":1674293770000},{"user":"helper","text":"So nice <3 And thank you.  Do you need to grab some water or tea or anything?  Or feeling cozy and ready to jump in?","time":1674293798000},{"user":"thinker","text":"I think I feel cozy and ready :) I was half a mind to set up out there but turns out today bed > snow","time":1674293822000},{"user":"helper","text":"Hahahah","time":1674293826000},{"user":"helper","text":"Sounds like a smart move","time":1674293833000},{"user":"helper","text":"Have you had a chance to think about what you'd like to explore today?","time":1674293844000},{"user":"thinker","text":"Yeah, just a little.. it's to do with my hearing loss I think ","time":1674293855000},{"user":"thinker","text":"the challenges are more apparent when I'm traveling this way","time":1674293881000},{"user":"helper","text":"Oh, okay, of course.  I would be glad to hold space and listen to what's been coming up for you around noticing more challenges with hearing loss while traveling.  I understand how traveling can definitely make aspects of ourselves feel more vulnerable.","time":1674293957000},{"user":"thinker","text":"Yeah, there are some vulnerabilities that push us and I think that is good, I'm concerned because I'm noticing myself kind of shut down and give up a lot. I'm traveling alone now, and I can feel a need for companionship, but when I'm in groups it's so exhausting to try to hear that I can feel myself distancing and becoming unavailable/unfriendly","time":1674294054000},{"user":"thinker","text":"because it's easier than struggling over and over again to catch someone's name/where they're from/how long they've been traveling... maybe part of it is an apathy to the same conversations over and over again, but I Think I'd be more open to them, and more interested in evolving that past their inane beginnings, if it wasn't so hard to hear","time":1674294117000},{"user":"thinker","text":"The reason it's harder now I think is partly because groups are always more difficult, but also the accents just keep me struggling :(","time":1674294156000},{"user":"thinker","text":"plus we're often in loud spaces","time":1674294162000},{"user":"helper","text":"Thanks for your trust <3  I can hear how this is bringing up  conflicting feelings within you....the desire to connect and also the desire to perhaps save your energy.  From what you've described, I can understand how a group can feel tiring (and having some introverted tendencies myself at times, know how it can already be a little more effort to begin with in a group).... I imagine that maybe you end up feeling a little alone since you're just getting to know folks so they don't understand what you're going through...","time":1674294302000},{"user":"thinker","text":"Right,  I think I naturally lean towards introverted as well, but I still enjoy good people and good conversations and I know I have to do a little work in the group to find those. And yes, people don't know what I'm going through, I feel like it would be easy to make assumptions about me base on my lack of responsiveness in conversations that I'm aloof, or worse don't get the joke. ","time":1674294404000},{"user":"thinker","text":"But When I tell people it doesn't necessarily make it better","time":1674294414000},{"user":"thinker","text":"sometimes it comes from a good place but they'll try harder to include me, and so I have to pay even closer attention, when really all I want is just for it to be alright that I don't catch it all and for them to know why","time":1674294458000},{"user":"helper","text":"That all makes a lot of sense the way you described it....I hear so much self awareness around what you're experiencing as well as how others try to approach it...but it sounds like even with all of that awareness, the path forward to something that is comfortable for you isn't always apparent, and i imagine that feels really hard","time":1674294543000},{"user":"thinker","text":"I wonder sometimes if the reason I'm introverted, or find myself actually kind of disliking the hostels and the parties, isn't because of my internal make up but because I can't hear/can't connect with everyone. Like that was probably the reason I Was bad in school, I thought it was my own decision to stop caring but the percentage of kids with hearing loss that consequently don't do well in school is so high .. it makes sense. I can hear if I really try but it's just so much work","time":1674294661000},{"user":"thinker","text":"and now it's the same with these hostels and I find as I get older the work just isn't worth it","time":1674294678000},{"user":"thinker","text":"so I go about and do stuff myself and feel lonely and feel longing to talk to everybody I meet,  and then on the chance I do.. it's too much work","time":1674294706000},{"user":"thinker","text":"I actually did make some friends last night and there were moments of one on one conversation that were much easier but I still felt kind of bad when she introduced me to a group and I didn't really try to make conversation with anyone ","time":1674294749000},{"user":"helper","text":"I hear you...  It sounds like you're having some realizations, or pondering more upon thoughts you've had in the past...about how this aspect of yourself has shaped how you experience the world and other people.  It sounds like you've had a lot of strength and have pushed yourself to experience the world and others despite vulnerabilities that arise sometimes...but when you talk about your natural internal make-up, it sounds like you wonder if your adaptations have changed you in a way that is maybe not who you truly are, but how you've needed to adapt to survive...  am i understanding okay?","time":1674295000000},{"user":"thinker","text":"Yes I think it's like.. introverts are happy to be alone, I am choosing to be alone, but am I happy there? Does it fit? ","time":1674295049000},{"user":"thinker","text":"or am I just not up to the task of company ","time":1674295071000},{"user":"helper","text":"mmm, that makes sense","time":1674295089000},{"user":"helper","text":"What is most troubling when you think about that?","time":1674295097000},{"user":"thinker","text":"hmm.. it","time":1674295120000},{"user":"thinker","text":"'s interesting because what feels most troubling in this case is more like the feelings and especially the behaviors","time":1674295146000},{"user":"thinker","text":"I'm troubled by my aloofness because it contradicts with my need for companionship","time":1674295163000},{"user":"thinker","text":"so I'm trying to think about what thoughts are causing my apathy and tiredness, lonliness... one sec","time":1674295194000},{"user":"helper","text":"ofc","time":1674295200000},{"user":"thinker","text":"I'm trying to think what I'm thinking that's separating me","time":1674295235000},{"user":"thinker","text":"it's just a hard situation","time":1674295247000},{"user":"thinker","text":"maybe","time":1674295255000},{"user":"helper","text":"yes","time":1674295257000},{"user":"thinker","text":"'it isn't worth it'?","time":1674295263000},{"user":"helper","text":"it sounds like you're trying to work backwards and do some digging and exploration work to try to understand what's been causing those hard feelings.  that is a brave thing to do!  and i can understand how thinking that it isn't worth it could cause some of these harder feelings to arise.  on the other hand, i also want to honor your experience and say that i can understand how maybe when you're thinking it isn't worth it, you are preserving yourself and your energy...  i can hear how much you value good connection and conversation and it sounds like you're trying to sift through everything to find the gold, so to speak...i can understand how if it takes a lot of energy to sift through what's not so interesting, maybe it would feel like you don't have enough leftover to give to the connections taht actually matter to you","time":1674295449000},{"user":"thinker","text":"hm, energy reserves... I guess it's interesting, I don't really think of it in those terms too much because I feel like my cup is full, if it is worthwhile, and if the challenges aren't too severe (like an accent.) But as soon as the conversations are .. for lack of a better word, boring, I just feel this resistance come up and I know a lot of people experience that of course. Maybe especially introverts. The difference is that for me hearing is a choice, I have to constantly choose and pay attention if I want to catch what's going on....","time":1674295592000},{"user":"thinker","text":"so to your comment, there are times, like recently we spent all day with an australian and actually at the end of the day I told my sister I needed to be alone for a bit because I Was completely depleted and that's a good example of what you're talking about","time":1674295631000},{"user":"thinker","text":"so maybe subconsciously that's what's going on ","time":1674295650000},{"user":"thinker","text":"but it feels more like I just don't want to put out the energy even when I have plenty of it, and just distance myself while I feel lonely ","time":1674295686000},{"user":"thinker","text":"I don't like I've given up on the ratio of interesting to frustrating being worth my time... ","time":1674295711000},{"user":"thinker","text":"I feel a little weird putting it in these terms of worth it, I feel kind of rude or something... but it's a bit of a catch 22 that meeting someone cool could refill my excitement for people but I'm too tired and aloof to try","time":1674295781000},{"user":"thinker","text":"woah that was a lot sorry","time":1674295791000},{"user":"helper","text":"no sorry's :)","time":1674295797000},{"user":"helper","text":"and just to try to get a fuller picture for a moment, i know you've described a couple situations, but was there a particular event that prompted these thoughts?","time":1674295828000},{"user":"thinker","text":"Hm, I think it is something kind of recurring but I can give you an example that made me kind of start thinking about","time":1674295867000},{"user":"thinker","text":"it","time":1674295868000},{"user":"thinker","text":"I joined a 'social' hostel which is a little different than a party one I guess but not by much, on high reccomendation from a kid in Vienna","time":1674295898000},{"user":"thinker","text":"And when we were walking to the bar people were grouping up and chatting and I was purposefully giving enough space between myself and other people so that no one would feel the need to include me in the conversation","time":1674295947000},{"user":"thinker","text":"even though I'd been alone on a train all day","time":1674295954000},{"user":"thinker","text":"Then I kind of intentionally lost them at the bar, and eventually went to a different place I'd seen with a pink floyd tribute band mostly because that sounded awesome but I didn't want to tell anyone I Was leaving or invite them. ","time":1674296009000},{"user":"thinker","text":"It just got me wondering why I'm so distant if I'm also seeking connection. ","time":1674296030000},{"user":"helper","text":"sure, that makes a lot of sense.  i know sometimes when reality doesn't match our expectations, that can be really internally jarring.  i imagine that being in a 'social' hostel and then finding yourself feeling not that way, could cause some inner tension.  i also am hearing how it's not black and white...it sounds like you're putting yourself near to groups and also social events (the concert) but maybe what's hard is that you're noticing yourself putting space there...  it sounds like you're desiring closeness and connection from a place that is meaningful and could fill your cup and putting yourself in situations where you hope to find it...but sometimes it all feels a bit exhausting and you're being intentional with thinking about why that is","time":1674296212000},{"user":"thinker","text":"yeah I think that's a really good way to put it","time":1674296227000},{"user":"thinker","text":"And I have recognized myself as a person who likes to be alone but surrounded by people before, and it didn't feel bad then","time":1674296258000},{"user":"helper","text":"do you know what's changed now?  why it's feeling worse?","time":1674296289000},{"user":"thinker","text":"hmm... I think I like that as an option, when I also have friends and such in my life, it isn't every hour. Now it feels worse because I'm lonely and I'm looking for the connection that would fill my cup as you say, ","time":1674296363000},{"user":"thinker","text":"It's interesting because last night was actually really good, so I'm a little less troubled than this than I was yesterday for example, but it's soemthing that comes back consistently, even just on this trip. The wanting but not wanting to talk to people. the longing combined with the apathy. It's confusing. It's different than sitting in a bar with a book after a long shift when I know exactly what I want. ","time":1674296450000},{"user":"helper","text":"yeah, of course.  agency feels empowering.  loneliness just feels...well, lonely.  ","time":1674296479000},{"user":"helper","text":"and also, i'm glad to hear that there have been bright spots too.  i hear the strength that comes from wanting to look at this.  it's so natural to desire close connection and i think it's brave to explore what holds us back from that.","time":1674296536000},{"user":"thinker","text":"right, yeah, is it me not wanting repeated conversations in which case, maybe change what you talk about or recognize the kind of scene I do and don't want to be in","time":1674296590000},{"user":"thinker","text":"or is it my hearing, and if it is, does that mean work harder? smarter? ","time":1674296611000},{"user":"thinker","text":"It'd be kinda funny if I'm just more introverted than I thought and I'm all woe is me, my ears","time":1674296633000},{"user":"thinker","text":":)","time":1674296664000},{"user":"helper","text":"haha, the way you phrased the last sentence made me smile :)  so this  the heart of it, it sounds like.  a deeper understanding of the self. the question of if you need more spaciousness than you thought or if the aspect of yourself that is affected by your hearing is changing who you really are?  i think we have a pretty good understanding of what's been going on so far...  are there any last musings you'd like to share before we move towards considering if any cheese might be playing a role and a path forward?","time":1674296804000},{"user":"thinker","text":"umm hmm.. sorry I think it's interesting to think about but I feel like the most troubling is this seesaw of 'I want companionship but it's too much work, like I want it no I don't I wan't no leave me be, I","time":1674296889000},{"user":"thinker","text":"I","time":1674296891000},{"user":"thinker","text":"I","time":1674296892000},{"user":"thinker","text":"I","time":1674296896000},{"user":"thinker","text":"omg lol","time":1674296898000},{"user":"thinker","text":"I","time":1674296900000},{"user":"thinker","text":"I'm tired. sorry","time":1674296904000},{"user":"thinker","text":"I'm confused by my conflict of both wanting to talk to people and then putting off vibes of leave me alone","time":1674296942000},{"user":"thinker","text":"and I wish I could just get on with people better or be more interested/interesting","time":1674296963000},{"user":"thinker","text":"yeah, that bottom one I think","time":1674296989000},{"user":"thinker","text":"it's close :/","time":1674296996000},{"user":"thinker","text":"it's like why don't I act according to what I say I want. Why am I so aloof. is it just hearing? Well that sucks. Is that a troubling thought? ","time":1674297029000},{"user":"helper","text":"sure, sure.  sorry, i'm just pausing to think for a moment...","time":1674297053000},{"user":"thinker","text":"sure sure :)","time":1674297062000},{"user":"helper","text":"yeah, i mean, it sounds like it's both.  like, there's this part of it that i think is universal in a lot of ways, the sort of wanting closeness but struggling to figure out where you belong or how to find that...  and then there's the aspect of it that is unique to your experience, which is that sometimes the extra effort needed in a social situation that already require extra effort (new people, accents, traveling, being alone) due to your hearing loss makes it feel harder.  does that feel true to you?","time":1674297216000},{"user":"thinker","text":"yes ","time":1674297227000},{"user":"thinker","text":"yeah it's good, I'd be curious to see what's cheesy","time":1674297246000},{"user":"thinker","text":"thanks for putting up with my meandering mind it's a little extra wonky today the lack of sleep I geuss","time":1674297282000},{"user":"helper","text":"no, it's okay!  it feels like the wavelength i'm on too, i think, spending lots of time around family and them being out of there comfort zone as well..hosting and noticing the unique needs and challenges and vulnerabilities each individual has while traveling.  i think it's been on my mind in a way, and i'm grateful for your sharing because it gives me a better understanding.  ","time":1674297376000},{"user":"helper","text":"and happy to move towards cheese-land :)","time":1674297383000},{"user":"thinker","text":"hm that sounds like the sign of a very good host :)","time":1674297395000},{"user":"thinker","text":"np","time":1674297416000},{"user":"helper","text":"haha thanks :)  okay... so cheese... feel free to ponder too and see if any come to mind for you","time":1674297480000},{"user":"thinker","text":"Maybe blaming is jumping out at me actually","time":1674297523000},{"user":"helper","text":"oh ok!  i'd love to hear your thoughts","time":1674297536000},{"user":"thinker","text":"oh just b and w cool, yeah I thought that might happen","time":1674297558000},{"user":"thinker","text":"I feel like I'm blaming my hearing a little bit, does that fit as cheesy? Because it takes the attention away from how I can thrive in my own way by pointing fingers and saying this sucks","time":1674297610000},{"user":"thinker","text":"I'm also maybe blaming myself for being tired when I can't hear well, and distancing myself, like mad that I'm not taking actions towards what I want but maybe I can't hold myself to too high a standard of constant but shallow socializing because sometimes it's hard and it sucks and I need distance","time":1674297686000},{"user":"helper","text":"oh, yes, that is clever, the first part it sounds like maybe you're concerned that your hearing is a bit of a scapegoat for not wanting to put effort in..  (it's interesting to think about but also want to again honor your experience...it sounds like there are real challenges in it too)  one second, going to re-read the second part..","time":1674297769000},{"user":"thinker","text":"a scapegoat.. yeah, actually the two parts conflict a little haha","time":1674297796000},{"user":"thinker","text":"because one doesn't honor my experience much as you say and the other focuses on it","time":1674297813000},{"user":"helper","text":"yes, exactly...  hmm, that's a little tricky.  so maybe blaming doesn't quite fit here?","time":1674297863000},{"user":"helper","text":"i don't think it quite is able to hold both parts of the experience...","time":1674297883000},{"user":"thinker","text":"maybe so, what are your thoughts on bw?","time":1674297893000},{"user":"helper","text":"well...maybe you are in need of a more nuanced thought in order to direct your energy in the direction you're wanting it to go and avoid exacerbating these feelings of exhaustion and depletion.   maybe getting hung up on the -i want this but it's too hard/too much work- leads you down a path of shutdown and keeps you in this loop.  it sounds like, yes, it is a lot of work, and yes, you do want companionship.  it also sounds like you are creative and resourceful...putting yourself in situations where you might find what you're looking for.  and sort of slipping away and going to the show...it sounds like maybe you weren't really wanting to go with anyone you were with and that's okay.  it's still bold and brave what you're doing...exploring solo in an unfamiliar place and putting yourself in social situations.  it's something a lot of people wouldn't do or wouldn't be brave enough to do.  so i think the thought of this is too much work is sort of discounting all the work and effort you are already doing to meet people and seek connection.","time":1674298176000},{"user":"thinker","text":"oh that's sweet :)","time":1674298193000},{"user":"thinker","text":"yeah and even the companionship part aside, just traveling is work, even alone, but carrying a backpack and finding places to go and do etc ","time":1674298238000},{"user":"thinker","text":"so maybe I'm expecting to have more want and attention than I actually have?","time":1674298273000},{"user":"thinker","text":"like I think my cup is fuller than it is... not just with people but with everything","time":1674298307000},{"user":"thinker","text":"wait how is this B and W though, what are the poles? Maybe I lost it","time":1674298328000},{"user":"thinker","text":"oh wait, it's too much work simplifies it too much","time":1674298348000},{"user":"thinker","text":"okay I'm with it. ","time":1674298354000},{"user":"helper","text":"yeah, i think it just feels a little either/or...  maybe takes you away from that gratitude you just expressed of noticing where you do feel full.  it's okay to want more, it's great to seek deep connection.  everything you're feeling is totally valid.  but you've described feelings and behaviors that sort of seem like shutting down, or feeling hard on yourself and therefore shutting down.  i think maybe just focusing on a thought that has a little more nuance and compassion might help you better navigate the challenges of your situation (both those that are unique to you and those that are universal)","time":1674298496000},{"user":"thinker","text":"Yeah I think I'm understanding more how the event that I described is not so bad, that it's okay to listen to when I feel full and take social rest so that I can offer from a fuller cup when the opportunity arises","time":1674298609000},{"user":"thinker","text":"I have a tendency to not really listen to my body needs or emotions and just trop on ","time":1674298642000},{"user":"thinker","text":"so this is a good reminder that maybe if I'm distancing myself it's for a reason","time":1674298661000},{"user":"thinker","text":"I don't always shut down, like last night I didn't, but I'm not giving myself credit for that as much as it deserves","time":1674298710000},{"user":"thinker","text":"I can't be friendly all the time, and maybe less than some. That's not the end of the world :) I kind of like to be lonely sometimes actually","time":1674298742000},{"user":"helper","text":"it sounds like more both/and....  it sounds great to acknowledge what's been hard and also great to see where you do notice your strengths and positive experiences.  slowing down to talk about it sounds like listening to your needs and emotions.  and it sound like the beginnings of a new thought direction....","time":1674298837000},{"user":"thinker","text":"I feel like that last line could be my new thought. I know it's a little unorthodox but it makes me feel bette","time":1674298853000},{"user":"helper","text":"haha that's totally okay.  i hear a lot of honoring of your experience in this thought and maybe that's exactly what you need right now :)","time":1674298915000},{"user":"thinker","text":"yes yay :)","time":1674298921000},{"user":"helper","text":"it's been nice to explore this with you and hear some of your experience!  how does this new thought feel to you ?","time":1674298950000},{"user":"thinker","text":"I feel more patient","time":1674298972000},{"user":"thinker","text":"And I remember times in my life that I've been lonely with a fond light","time":1674298988000},{"user":"helper","text":"mmm...that's nice :)","time":1674299004000},{"user":"thinker","text":"Like maybe I'll go for a long walk in the snow :)","time":1674299011000},{"user":"helper","text":"ohhhh","time":1674299015000},{"user":"helper","text":"that sounds glorious and completely luxurious","time":1674299025000},{"user":"thinker","text":"hehe yes","time":1674299030000},{"user":"thinker","text":"wonderful to connect with you as always, I haven't done this in a while but down to make this session public if you are?","time":1674299061000},{"user":"helper","text":"so good to connect with you as well!","time":1674299070000},{"user":"helper","text":"and yes, i'm completely okay with that.","time":1674299077000},{"user":"thinker","text":"great :)","time":1674299093000},{"user":"helper","text":"i hope this new thought brings you some good energy throughout your travels and beyond.  enjoy your snowy afternoon! :)","time":1674299109000},{"user":"thinker","text":"Enjoy your sunny one <3","time":1674299118000}]}