{"notes":{"thought":"I can't do it (internship/workload) even though I want to\n\nI'm not prepared\n\nI don't know enough to help others \n\nI don't belong","feelings":"Fear of failure\nStressed\nSad \nLonely\nSelf- doubt\nInsecurity ","event":"New Internship","behaviors":"Choking during presentations\n\nLacking confidence","labels":{"black-or-white-thinking":true,"control-fallacy":true,"labeling":true},"new_thought":"I care about what I am doing and I am excited to continually grow and learn"},"messages":[{"user":"helper","text":"Hey there, Welcome to Cheeseburger! ","time":1628798534000},{"user":"thinker","text":"A lot of worry about internship and fear of workload and not meeting expectations. Stress. Feeling lonely. And sad during the evenings. Family is out of the country temporarily. Crying often. ","time":1628798609000},{"user":"helper","text":"Thank you for opening up and being vulnerable. I know it is not always the easiest thing to do.","time":1628798638000},{"user":"helper","text":"I hear you and feel that sadness and fear. I=","time":1628798667000},{"user":"helper","text":"It sounds like you are juggling multiple things that are troubling you right now","time":1628798680000},{"user":"helper","text":"Can you tell me about one that might be bothering you the most right now?","time":1628798698000},{"user":"thinker","text":"Right now the thing that is stressing me out the most is my internship and managing workload and feeling like I can’t do it even though I want to. Fear of failure ","time":1628798807000},{"user":"helper","text":"That fear of failure... what does that feel like? What thoughts (self talk) is coming up when you feel that stress and fear","time":1628798916000},{"user":"thinker","text":"Thoughts like I’m not prepared. Like I don’t know enough to be able to help others. Not being competent enough. Choking during presentations. Dreading the high workload to come. Worry about not being able to manage internship, school, and life for when school comes into the picture in September. Fear is speaking up for fear of how it will sound or come out.  ","time":1628799207000},{"user":"thinker","text":"fear of speaking out or fear of how it will come out or sound","time":1628799252000},{"user":"helper","text":"I can resonate with this fear. You are not alone. A lot of us struggle when starting new things with ideas of 'self doubt' or 'not belonging' or 'not knowing enough'. ","time":1628799300000},{"user":"helper","text":"It's a tough place to be in when you are in a new place or trying new things and there is this nagging fear at the back of your mind the whole time.","time":1628799327000},{"user":"helper","text":"Have you started this new internship yet?","time":1628799361000},{"user":"thinker","text":"Yes I feel a lot of self doubt and not belonging.","time":1628799394000},{"user":"thinker","text":"I officially started this month.","time":1628799414000},{"user":"helper","text":"Congratulations on the internship by the way!","time":1628799443000},{"user":"helper","text":"Can you tell me why you started an internship? What was the reason you wanted to intern there?","time":1628799473000},{"user":"thinker","text":"Thank you! Yeah, I started an internship because it’s a requirement to graduate, but I really wanted to work there in order to help children survivors of trauma and sexual exploitation in any way that I could.","time":1628799697000},{"user":"helper","text":"wow! that is such an honorable profession to pursue. This would needs more people doing that good work.","time":1628799712000},{"user":"helper","text":"Why did you want to work with children that have been exploited? What values do you think you honored of yours by going down that path?","time":1628799755000},{"user":"thinker","text":"I think that theure one of the most vulnerable populations and my dad was sexually abused as a child sp","time":1628799924000},{"user":"thinker","text":"So I want to be there for children who experienced something similar to my dad and give back and be there for when no one was there ","time":1628799995000},{"user":"helper","text":"Wow that is incredible! It sounds like you really value helping others and even a sense of justice and care","time":1628800044000},{"user":"helper","text":"Thank you for sharing that","time":1628800064000},{"user":"helper","text":"What does an average day of work look like for you? ","time":1628800091000},{"user":"thinker","text":"A lot of shadowing and training. I’m also learning about assessments.","time":1628800237000},{"user":"thinker","text":"I’m helping with paperwork and observe clinicians.","time":1628800314000},{"user":"helper","text":"Do you remember what it felt like on your first day of internship to walk in to start training? ","time":1628800416000},{"user":"thinker","text":"I felt excited to be there, lucky, and also intimidated.","time":1628800497000},{"user":"helper","text":"I see, yeah that makes sense.","time":1628800540000},{"user":"helper","text":"I'm going to put together a quick summary of what you've shared okay?","time":1628800565000},{"user":"thinker","text":"Okay sounds good ","time":1628800579000},{"user":"helper","text":"While I do that I invite you to take a moment to collect your breath, focus on breathing, even close your eyes and turn on a relaxing song, open the window. Whatever you need to do to just get present with yourself. ","time":1628800612000},{"user":"helper","text":"You don't have to of course, I just think it can be helpful to focus on :)","time":1628800631000},{"user":"thinker","text":"Thank you, I will try it.","time":1628800638000},{"user":"helper","text":"About a month ago, you got a new internship! (Congrats 🎉 ) And on your first day you felt excited and lucky, though honestly a little intimidated. You are taking a big step towards your future goals and its scary but wonderful at the same time. You are pursuing something that is in line with your values of helping and loving others, being there to support these kids is personal for you because you really care about them. But lately, you have had these thoughts that are filled with self-doubt like \"I can't do this, I'm not prepared, I don't know enough, I don't belong.\" Naturally these thoughts causing anxiety and stress and overall fear and doubt in your mind. It affects the way you work as you choke during presentations of don't see to have the confidence you want. ","time":1628800872000},{"user":"helper","text":"Please let me know if there is something else you want to add to this summary or if there is anything I missed.","time":1628800898000},{"user":"helper","text":"Take your time though with your breathing and get 3 more big breaths in if you decided to go down that route. ","time":1628800942000},{"user":"thinker","text":"Thank you for summarizing. That is everything!","time":1628801048000},{"user":"helper","text":"Good!","time":1628801109000},{"user":"helper","text":"How was your time finding your center?","time":1628801120000},{"user":"thinker","text":"It was relaxing and I feel light when I was feeling heavy","time":1628801215000},{"user":"helper","text":"wonderful! ","time":1628801263000},{"user":"helper","text":"Let's continue and dig in a little more okay?","time":1628801274000},{"user":"helper","text":"you are doing wonderful by the way :)","time":1628801283000},{"user":"helper","text":"What I'd like to do is take a look at one of your thoughts that I have listed in the column on the right","time":1628801320000},{"user":"helper","text":"Is there one of those that seems the most troubling to you? I see that they are all related to each other ","time":1628801341000},{"user":"helper","text":"If you are on your phone you might not be able to see it","time":1628801433000},{"user":"thinker","text":"Okay. Thank you :)","time":1628801442000},{"user":"thinker","text":"I can see them","time":1628801496000},{"user":"thinker","text":"I think I don’t belong and I’m not prepared ","time":1628801523000},{"user":"helper","text":"Yeah I can see how those would bring a lot of trouble","time":1628801538000},{"user":"helper","text":"And it's okay","time":1628801559000},{"user":"helper","text":"Our brains are always trying to look at for our well fare ","time":1628801577000},{"user":"helper","text":"They worry for us and stress and go into a fight or flight response at times in order to protect us from things that are new or uncomfortable ","time":1628801600000},{"user":"helper","text":"Like a new internship","time":1628801607000},{"user":"helper","text":"But, sometimes our brains have these thoughts that continue to drag on over and over again. Like an alarm in the morning going off even though you are already awake. It can be disruptive to have it go off all day every day while you are trying to focus on other things.","time":1628801672000},{"user":"helper","text":"These types of 'unhelpful' thoughts we call 'cheesy thoughts' and we find its best to recognize them (like we already did) and now we want to categorize them and then we can move on to the 'Making change step'!","time":1628801733000},{"user":"helper","text":"On the right, you will see a little cheeseburger icon, I want you to click on it","time":1628801756000},{"user":"helper","text":"Do you see it?","time":1628801765000},{"user":"thinker","text":"Yeah!","time":1628801775000},{"user":"helper","text":"great!","time":1628801781000},{"user":"helper","text":"when you click on it you will see a list of cheesy thought patterns","time":1628801805000},{"user":"helper","text":"I want you to pick one or even two that relate to your thoughts that we are focusing on","time":1628801829000},{"user":"helper","text":"let me know if you need assistance :)","time":1628801835000},{"user":"thinker","text":"Maybe black or white thinking and control fallacy.","time":1628801972000},{"user":"helper","text":"Tell me why you chose those ","time":1628802002000},{"user":"thinker","text":"Black or white thinking because it seems like my thinking is just about failure and I’m not considering an","time":1628802219000},{"user":"thinker","text":"The in between like all the things that will go and have gone right and well.","time":1628802265000},{"user":"helper","text":"That is some good insight!","time":1628802290000},{"user":"helper","text":"And what about control fallacy? Where do you see this happening?","time":1628802303000},{"user":"thinker","text":"Control fallacy, I can learn to manage things better and ask for help.","time":1628802339000},{"user":"helper","text":"I can see how those could be related","time":1628802443000},{"user":"helper","text":"If you are having black and white thinking which might also be some labeling as you are seeing yourself as a failure, then your thoughts become negative and they tell you \"you don't belong, you aren't good enough...etc.\" I imagine that having these thoughts causes this fear and sadness and insecurity. And it steals the joy you had when you got the internship. These thoughts come in and if they are not noticed they try to steal our joy and life. ","time":1628802577000},{"user":"helper","text":"Does that make sense? ","time":1628802591000},{"user":"thinker","text":"Yes that makes sense. I hadn’t seen it like that. It’s like I’m being my own bully.","time":1628802722000},{"user":"helper","text":"Yes! but not necessarily on purpose. ","time":1628802736000},{"user":"helper","text":"But after a while it's all you know. :/ and you kinda can't help it till you notice it and call it out for what it is","time":1628802763000},{"user":"helper","text":"But there is so much good news!","time":1628802783000},{"user":"helper","text":"Firstly, you are here which shows you value taking care of yourself and that you want change! How wonderful!","time":1628802805000},{"user":"helper","text":"It reminds me of how you value helping and supporting the lives of these children. Now you have the opportunity to use those same values of love and care towards yourself :)","time":1628802846000},{"user":"thinker","text":"Yes! I like that connection a lot.","time":1628802861000},{"user":"helper","text":"yes!","time":1628802866000},{"user":"helper","text":"I can sense a change in you already","time":1628802878000},{"user":"helper","text":"I feel excitement for you!","time":1628802889000},{"user":"helper","text":"so do it :)","time":1628802925000},{"user":"thinker","text":"Thank you so much! I appreciate our conversation","time":1628802927000},{"user":"helper","text":"You ready for the cheery on top of all this so we can seal the deal and move you forward with joy??","time":1628802944000},{"user":"helper","text":"cherry* 🍒 ","time":1628802952000},{"user":"thinker","text":"Yes :)","time":1628803001000},{"user":"helper","text":"alright!","time":1628803009000},{"user":"helper","text":"Let's come up with a New Thought for you. If negative or unhelpful thoughts can affect your feelings and behavior than imagine what a new loving thought can do!","time":1628803043000},{"user":"helper","text":"This new thought can be used as a tool. We actively think this new thought at troubling times or when we sense our brain wanting to over protect us to the point of bullying. We get to choose a new thought to think. That is where you have control :)","time":1628803096000},{"user":"helper","text":"I find it helpful to base my new thought on a value I have that is related to this circumstance and root that new thought it that value.","time":1628803127000},{"user":"helper","text":"What might a new thought be that you can use?","time":1628803140000},{"user":"helper","text":"Again let me know if I can assist you with this","time":1628803158000},{"user":"thinker","text":"I’m having a hard time. But I was thinking, I can do this I got this internship because I worked hard and I’m ","time":1628803344000},{"user":"thinker","text":"Have a solid foundation ","time":1628803380000},{"user":"thinker","text":"Can you please assist me?","time":1628803400000},{"user":"helper","text":"of course!","time":1628803404000},{"user":"helper","text":"I like where you were going with that new thought. It sounds like the start of confidence","time":1628803419000},{"user":"helper","text":"I wrote down a couple ideas","time":1628803428000},{"user":"helper","text":"One idea: \"It is exciting to be pursuing a life I really value!\" ","time":1628803459000},{"user":"helper","text":"\"Change can be tough, but it is the start of something wonderful\" ","time":1628803510000},{"user":"helper","text":"those are two I came up with ","time":1628803519000},{"user":"helper","text":"Another one could be \"I care about what I am doing and I am excited to continually grow and learn\" ","time":1628803582000},{"user":"helper","text":"Do any of these strike a chord with you?","time":1628803593000},{"user":"thinker","text":"Yes! The last one resonates with me!","time":1628803619000},{"user":"helper","text":"Yay!","time":1628803806000},{"user":"helper","text":"What about it resonates with you? How does it make you feel to think that new thought? Also, do you see yourself using it as a tool?","time":1628803833000},{"user":"thinker","text":"It really just mirrors me like my values, work, and I enjoy growing and challenging myself.","time":1628803977000},{"user":"thinker","text":"Yes I do!","time":1628803989000},{"user":"helper","text":"That's great! Well let's keep that as your New Thought then!","time":1628804001000},{"user":"helper","text":"You did it!","time":1628804006000},{"user":"helper","text":"How do you feel right now compared to when we started? ","time":1628804018000},{"user":"thinker","text":"My thinking feels clearer, I feel light, my chest doesn’t feel pressure, and I feel positive.","time":1628804130000},{"user":"helper","text":"That is so great to hear! I'm so happy for you :)","time":1628804148000},{"user":"helper","text":"Life is exciting, especially if we let ourselves get excited ","time":1628804164000},{"user":"helper","text":"In the future as you get ready for work or are faced with a new challenge, you can use this new thought to help you stay grounded in your values and to stay excited :)","time":1628804269000},{"user":"thinker","text":"Yes!","time":1628804292000},{"user":"helper","text":"Thank you so much for coming here today and using this service! ","time":1628804298000},{"user":"thinker","text":"Thank you so much I appreciate you!","time":1628804313000},{"user":"helper","text":":) it is my pleasure ","time":1628804319000},{"user":"helper","text":"Would it be okay for us use this session on our site possibly? It is all anonymous ","time":1628804355000},{"user":"thinker","text":"Yes I’m okay with that if it’s anonymous ","time":1628804381000},{"user":"helper","text":"thank you! Hopefully your session will be able to inspire others :)","time":1628804401000},{"user":"helper","text":"We are all done here! I wish you the very best in your internship and schooling. You are going to do wonderful!","time":1628804423000},{"user":"helper","text":"Come back any time! Tell a friend about us :)","time":1628804434000},{"user":"thinker","text":"Thank you! :)","time":1628804437000},{"user":"helper","text":"Hey there! This is Nathan. I just wanted to check-in with you. How have you been? Have you been able to use that New Thought we came up with? How is your internship going? I hope to hear from you soon! ","time":1630020530000},{"user":"thinker","text":"Hi Nathan! I’m doing well. I just started classes again last week , so I’m trying to balance life, internship, and classes now.","time":1631120871000},{"user":"thinker","text":"I have been using it and it’s helped a lot when I feel burned out. ","time":1631120942000},{"user":"helper","text":"Hey! It's great to hear that you are finding balance and using this New Thought as a tool. ","time":1631213179000},{"user":"helper","text":"If you ever want/need another session, we are here to help :) Have a great rest of your week! ","time":1631213213000}]}