{"notes":{"event":"there's a part of me I've been separate from, it. lonely and misunderstood.\n\nmy partner and I got into an argument in which I got very triggered","thought":"I can't control my response\n\nHe's avoiding me, or disconnecting from me","feelings":"misunderstood\nhurt\nupset\nanger\nemptiness/numb\nsadness\ntriggered\nunconfrontational","behaviors":"I go quiet\navoiding him\nstop talking to him\nalmost giving him my back","labels":{"black-or-white-thinking":true},"new_thought":"I'm learning to be with this part that has been alone and learning to connect and communicate in ways that help us both feel better\n\nNew Feelings:\nOpened up and sensing safety as closer\n\n\n\n\nits okay and that this is a safe space where i can talk about my feelings and whats bothering me, i’m going to feel heard\n\nNew"},"messages":[{"user":"thinker","text":"I really think I have BPD and its really affecting my life.","time":1674530936000},{"user":"helper","text":"Hi there, welcome to Cheese! Thanks for coming to us to try our service.","time":1674604745000},{"user":"thinker","text":"Hello! Of course","time":1674604758000},{"user":"helper","text":"have you used our service before?","time":1674604786000},{"user":"thinker","text":"no, this is my first time","time":1674604794000},{"user":"helper","text":"it should be about an hour","time":1674604805000},{"user":"helper","text":"and we ask that you pay if you found the session helpful","time":1674604821000},{"user":"thinker","text":"okay, i understand","time":1674604831000},{"user":"helper","text":"alright, so go ahead and what is troubling you, I see you wrote that you think you have BPD and that its affecting you intensely ","time":1674604866000},{"user":"thinker","text":"yeah so throughout my life, ive always have unstable relationships with people, until recently i was really struggling and was trying to do research on what it might be","time":1674604913000},{"user":"thinker","text":"i found out that people with bpd have this thing called “black and white thinking” and you are probably familiar with that term but it really applies to me","time":1674604950000},{"user":"helper","text":"yeah... okay.... ","time":1674604951000},{"user":"helper","text":"thanks for sharing that","time":1674604954000},{"user":"helper","text":"that's a good place to start","time":1674604961000},{"user":"helper","text":"I imagine you can see how B&W thinking can create a gauze and separation from being able to have belonging in your world ","time":1674605000000},{"user":"thinker","text":"yes, it really affects my mood, my relationships, and my communication within relationships because i dont want to hurt then yet whenever it happens its almost like i hate them but i dont want to","time":1674605040000},{"user":"helper","text":"I appreciate the clarity with which you are expressing this","time":1674605062000},{"user":"helper","text":"that switch from desiring to connect to the feeling of hate seems like a crucial point to me","time":1674605079000},{"user":"helper","text":"like where a lot of the power in this trouble is stuck","time":1674605091000},{"user":"helper","text":"does that make sense?","time":1674605096000},{"user":"helper","text":"or feel right?","time":1674605102000},{"user":"thinker","text":"what do you mean when you say that the power in this trouble is stuck?","time":1674605118000},{"user":"helper","text":"meaning that the solution in it that is stuck in there, but contained in like a pressure point or accupuncture point ","time":1674605146000},{"user":"helper","text":"lots of energy there in those switches","time":1674605155000},{"user":"thinker","text":"yes, that does make sense and it feels right. i feel like when it happens my emotions are so powerful and i dont know wha to do then","time":1674605193000},{"user":"helper","text":"I can imagine... I'm familiar with dealing with feelings that are so intense that its a state of disociation from the world and how people relate","time":1674605221000},{"user":"helper","text":"like the stereotype of a blind rage","time":1674605233000},{"user":"helper","text":"whats an example of a recent event you experienced this kind of powerful emotions state?","time":1674605268000},{"user":"thinker","text":"me and my partner got into an argument and i felt him almost like avoid me or disconnect from me and i think in a way it like triggered me. i ended up barley talking to him, avoiding him, and giving him almost like my back","time":1674605344000},{"user":"helper","text":"do you see the notes on the right?","time":1674605368000},{"user":"thinker","text":"yes i do","time":1674605387000},{"user":"helper","text":"its important that they feel true and useful","time":1674605395000},{"user":"helper","text":"how are they for you now?","time":1674605407000},{"user":"thinker","text":"they are true statements","time":1674605416000},{"user":"helper","text":"alright...","time":1674605420000},{"user":"helper","text":"when you think of that moment when your partner and you got into the argument, is there a most troubling part of the event that you want to highlight?","time":1674605460000},{"user":"helper","text":"or is that not that relevant meaning like what led you to the argument or how it happened","time":1674605477000},{"user":"thinker","text":"i mean i think the most troubling part for me was just facing my emotions because i couldnt. it was like almost a defense mechanism to just avoid him.","time":1674605517000},{"user":"helper","text":"right okay... yeah a defense taking over","time":1674605520000},{"user":"helper","text":"what is the thought in that part of facing the emotions because you couldn't","time":1674605566000},{"user":"helper","text":"Feelings are coming up that I can't cope with, or that are taking me away?","time":1674605587000},{"user":"thinker","text":"it just feels like i cant cope with it. like i literally cant, i go quiet, no thoughts are coming through its just like i have to avoid it at all costs which makes it so much harder to communicate ","time":1674605644000},{"user":"helper","text":"and what are some of the feelings that happen accompanying that thought of \"i can't cope\"","time":1674605696000},{"user":"thinker","text":"sometimes its anger, most of the time its just emptyness and just trying to avoid it, sadness, just being overall unconfrontational","time":1674605748000},{"user":"helper","text":"I'm sorry that this has been this way... I hear implicit in this your desire to be able to be closer and to be able to weather challenges in a different way that is not so separating... a lot of care for connection","time":1674605807000},{"user":"helper","text":"does that feel true?","time":1674605812000},{"user":"thinker","text":"yes, i do care a lot its just i feel like i really cant control it and its so frustrating","time":1674605830000},{"user":"helper","text":"I can imagine...","time":1674605849000},{"user":"helper","text":"this process at cheese is meant to slow things down that are troubling ","time":1674605861000},{"user":"helper","text":"such that with something like this, as you visit it with your mind and heart by telling it to me we can touch the parts that are constrained and help them loosen a bit","time":1674605900000},{"user":"helper","text":"go ahead","time":1674605914000},{"user":"thinker","text":"oh i was just going to say that that sounded really true the “constrained” part","time":1674605942000},{"user":"helper","text":"yeah,  an opportunity here from a more calm place or conscious part to bring some spaciousness and contact that is helpful ","time":1674605975000},{"user":"helper","text":"adjusted to meeting it where its at","time":1674605980000},{"user":"helper","text":"the constrained parts from my expeirence don't melt unless they really feel understood/met","time":1674606008000},{"user":"thinker","text":"oh i see","time":1674606027000},{"user":"helper","text":"I mention this because by allowing the words you write here","time":1674606069000},{"user":"helper","text":"and the words that I write to go in and touch whats relevant here that helps the process move along","time":1674606093000},{"user":"helper","text":"rather than words that just talk over the process if that makes sense","time":1674606105000},{"user":"helper","text":"this is particularly important to name around really intense parts","time":1674606115000},{"user":"thinker","text":"okay i understand","time":1674606132000},{"user":"helper","text":"great","time":1674606137000},{"user":"thinker","text":"yeah so the thing is with that, we decided to end our relationship because my communication skills are that bad. i’","time":1674606213000},{"user":"helper","text":"Ohhh.... I'm so sorry... Sorry not sure what happened there with copy paste.... okay so I hear that you have been living with this pattern a pattern that can be seen in a recent argument that you had with your ex in which you got triggered. You ","time":1674606296000},{"user":"thinker","text":"yeah, that pattern has been happening for a really long time now and i dont know what to do with it","time":1674606322000},{"user":"helper","text":"so the pattern goes, you're in a relationship where there is a conflict/argument then you notice a reaction in you exemplified by the thought. \"I can't control my response\" \"He's avoiding me, or disconnecting from me\" and then that leading to a flurry of feelings or an emptiness, the feelings such as anger, sadness and or the quietness of being unconfrontational.   You then go quiet, you avoided you stopped talking to him, almost giving him your back. ","time":1674606434000},{"user":"thinker","text":"yes, that is usually how it goes, even when he doesnt mean to avoid me, it could be feelings of jealousy or anything that makes me feel unwanted it usually just makes me want to back up and just keep it to myself","time":1674606486000},{"user":"helper","text":"can you feel that part of you as a part of you?","time":1674606496000},{"user":"helper","text":"or does it feel like all of you?","time":1674606503000},{"user":"thinker","text":"what do you mean?","time":1674606513000},{"user":"helper","text":"the part that becomes jealous that feels unwanted and wants to back up ","time":1674606530000},{"user":"thinker","text":"oh, yes it almost consumes me, its all i can feel and then i end up just completely avoiding the situation","time":1674606558000},{"user":"helper","text":"okay, so this part that goes quiet and retreats... my sense is that the way through this challenge, is to be able to relate to it","time":1674606607000},{"user":"helper","text":"meaning not just in those moments when there is relational tension or conflict","time":1674606627000},{"user":"helper","text":"but moments such as this","time":1674606631000},{"user":"thinker","text":"what do you mean to relate?","time":1674606643000},{"user":"helper","text":"to make space for thoughts and feelings that are stuck inside there","time":1674606665000},{"user":"helper","text":"if you imagine that that part is a scared child that is really reactive, or even an adult that is really triggered, it needs some calm and someone to trust to be able to little by little come out of that intense tension and reactivity to then be able to thaw and begin to be able to relate differently","time":1674606730000},{"user":"helper","text":"relate - sharing thoughts and feelings","time":1674606749000},{"user":"thinker","text":"yes, i feel like trust plays a huge role into this","time":1674606773000},{"user":"helper","text":"can you feel that part of you now? the part that closes up?","time":1674606793000},{"user":"thinker","text":"like you mean within this conversation?","time":1674606804000},{"user":"helper","text":"yes, in this moment","time":1674606809000},{"user":"thinker","text":"no, i dont feel like closing up or anything because i feel heard and trust and understandment","time":1674606833000},{"user":"helper","text":"I'm glad... from this place of trust and understanding can you direct the attention of your mind to where that part of you might be hiding?","time":1674606864000},{"user":"helper","text":"or wherever it may be","time":1674606871000},{"user":"thinker","text":"like the part of me where i close up?","time":1674606889000},{"user":"helper","text":"yeah","time":1674606890000},{"user":"thinker","text":"i dont know how to direct it","time":1674606899000},{"user":"helper","text":"to direct your mind to look at it","time":1674606914000},{"user":"helper","text":"imagining from this example that moment with your partner with the argument","time":1674606931000},{"user":"helper","text":"the you that so intensley closed up","time":1674606944000},{"user":"thinker","text":"okay","time":1674606949000},{"user":"helper","text":"what do you notice when you turn your attention to this part?","time":1674606969000},{"user":"thinker","text":"i notice that on the outside, i look angry, upset, numb even. but really like deeply inside im hurting and i feel like i need someone to trust","time":1674607014000},{"user":"helper","text":"you've brought tears to my eyes","time":1674607020000},{"user":"helper","text":"the realness of these words","time":1674607027000},{"user":"thinker","text":"yes because i feel so misunderstood and i dont know what to do about it","time":1674607052000},{"user":"thinker","text":"and its not like i dont trust my partner or whoever im having a conflict with, its just during a conflict, i dont feel understood at all which makes the trust bond almost a little unstable","time":1674607097000},{"user":"helper","text":"when you say you notice the outside the anger, upset and numb look and then the inside hurting with need to trust","time":1674607129000},{"user":"helper","text":"what does that make you feel?","time":1674607132000},{"user":"thinker","text":"well as a whole, it makes me feel sad and almost sorry for myself because i can feel the desperation of help but that part of me just stops it and it hurts","time":1674607175000},{"user":"helper","text":"can you try saying these words to that part toward it","time":1674607197000},{"user":"helper","text":"?","time":1674607198000},{"user":"helper","text":"I see you've been so misunderstood and that know what it takes then and that looking angry and numb makes sense and that you feel hurt and need trust","time":1674607240000},{"user":"helper","text":"if its helpful also know that this is what I perceive and think too","time":1674607260000},{"user":"thinker","text":"i did and i think that helped","time":1674607281000},{"user":"helper","text":"a little \"yay\"","time":1674607294000},{"user":"helper","text":"I strongly believe is giving tools to people that they find useful","time":1674607307000},{"user":"helper","text":"its also super helpful to have relationships with people that you can actually trust to keep that support","time":1674607326000},{"user":"helper","text":"what did that part that feels like it helped, how did you notice it?","time":1674607347000},{"user":"helper","text":"or where?","time":1674607353000},{"user":"thinker","text":"well first i felt it in my heart, like physically. and i noticed that i feel like my guard almost went down, that the anger was less there, the quietness felt like it had something to say ","time":1674607407000},{"user":"helper","text":"I'm touched that you're experiencing this","time":1674607425000},{"user":"helper","text":"I hope this feels user friendly if that makes sense","time":1674607437000},{"user":"helper","text":"this relationship that utltimately for you to be able to learn by whatever means that help to be able to let that anger guard down and to let the quiet, the tender... to speak","time":1674607472000},{"user":"helper","text":"that I imagine is part of the bridge that has been missing in relationships ","time":1674607485000},{"user":"helper","text":"what you talked about with challenges communicating across challenges","time":1674607502000},{"user":"helper","text":"does that feel connected?","time":1674607511000},{"user":"thinker","text":"what do you mean?","time":1674607519000},{"user":"helper","text":"the connection between if this part can soften, let the guard down and be able to speak... that this could be part of the solution so you can have better communication and relationship in those moments","time":1674607585000},{"user":"thinker","text":"oh, yes it does and i feel like that is what i struggle with","time":1674607602000},{"user":"thinker","text":"here it does feel connected","time":1674607612000},{"user":"helper","text":"bringing presence and relationship to that part that has been alone in a negative way","time":1674607630000},{"user":"thinker","text":"yes, i feel like that in a way would help. that part of me feels so isolated and alone, and i feel like thats what that part of me wants, disconnection but i think what it really needs is attention and presence and for it to be known","time":1674607714000},{"user":"helper","text":"yes!","time":1674607717000},{"user":"helper","text":"that's what I and I think all people need","time":1674607730000},{"user":"thinker","text":"yes, i do agree!","time":1674607759000},{"user":"helper","text":"okay as we move forward here...","time":1674607770000},{"user":"helper","text":"part of the challenge that you and I are meeting or the trouble we are addressing is the dissociation and disconnection and loneliness of that part","time":1674607811000},{"user":"helper","text":"make sense?","time":1674607819000},{"user":"thinker","text":"yes that does make sense","time":1674607827000},{"user":"helper","text":"You've been witnessing this part of you coming in conflicts like the one you shared about... and then you've had common thoughts like I need to close up or shut down or protect myself.... and then feelings of upset, anger, sadness, being triggered or quiet and unconfrontational.... then taking actions such as going quiet... stopping talking to the person.... distancing yourself from the relationships you care about","time":1674607949000},{"user":"helper","text":"and the intensity of those thoughts of \"i need to close up\" I hear they are under the surface that it often feels like a quiet no thought zone just shutting down or it taking over... so much intensity in that mental position toward shutting down.... for its own reasons. I don't know if you can make a connection there of a time in your past of an original hurt or dynamic of lack of trust in your past.... ","time":1674608042000},{"user":"thinker","text":"i mean, i honestly think it ties or coincides with my relationship with my parents. i was taught that its better to stay quiet and that i didnt feel heard. i didn’t communicate my feelings with my parents ever so honestly i think it taught me that i shouldnt share my feelings and now, even if i want to, i cant because thats how i learned","time":1674608146000},{"user":"helper","text":"okay so that is very likely the main set of events that created this dynamic this part of you that believes so strongly that it can't control, it should avoid, it should stay quiet... and then go down this snowball of feelings and behaviors resulting in breaks in relationships","time":1674608199000},{"user":"thinker","text":"yes that does sound right","time":1674608220000},{"user":"helper","text":"okay, so you and me here have an opportunity to create a different thought... a thought to meet you where you are at... where this challenge is currently at","time":1674608253000},{"user":"helper","text":"the general model here with cheese is one of coming to a new thought like I just described. An extra bit here that you and I were able to explore is your being able to relate to that part yourself... to create some movement in you in that area","time":1674608303000},{"user":"helper","text":"on the one hand lets create a new thought that you'd prefer to take with you into those vulnerable moments  like this one actually when you have the time to try to relate to this part","time":1674608350000},{"user":"helper","text":"what would you rather think to yourself when trying to address this part in you?","time":1674608375000},{"user":"thinker","text":"i would want to think that its okay and that this is a safe space where i can talk about my feelings and whats bothering me, i’m going to feel heard","time":1674608427000},{"user":"helper","text":"yay!","time":1674608432000},{"user":"helper","text":"this inner circle with people who you can trust like myself in this moment","time":1674608448000},{"user":"helper","text":"and then most powerfully as you can develop this kind of trust and confidence with yourself","time":1674608466000},{"user":"helper","text":"that develop ways of being that are different from your parents","time":1674608484000},{"user":"helper","text":"such as this thought that you just wrote","time":1674608491000},{"user":"thinker","text":"yes, i will definitely be working on that","time":1674608513000},{"user":"helper","text":"if you imagine yourself in with an opportunity to connect to this part of you maybe around a relational tension even... can you see the potential tension or conflict and you step in and say \"its okay and that this is a safe space where i can talk about my feelings and whats bothering me, i’m going to feel heard\" ","time":1674608565000},{"user":"helper","text":"what do you feel when you imagine that and think that new thought?","time":1674608578000},{"user":"thinker","text":"i think that at first, i would still feel a little skeptical because that is a very new thought being introduced to me. but i feel like with time, that would definitely help with my communication skills and how to cope with those feelings","time":1674608643000},{"user":"helper","text":"very good noticing of what it actually feels like to you","time":1674608654000},{"user":"helper","text":"so this thought can be one that can be like a beacon","time":1674608664000},{"user":"helper","text":"a good long term or mid term guide","time":1674608672000},{"user":"helper","text":"if you'd like we can come up with a thought that feels more digestible for now","time":1674608692000},{"user":"thinker","text":"yes, i do think that would be helpful because i feel like i am extremely new to this","time":1674608712000},{"user":"helper","text":"makes sense thanks for confirming that","time":1674608722000},{"user":"helper","text":"okay so lets try to zoom between this new thought and where you are now","time":1674608741000},{"user":"helper","text":"and what might feel nice to think about feel digestible","time":1674608751000},{"user":"helper","text":"I can try to help too: \"I'm learning to reduce the reactivity of this part of me that has been alone for a long time... I am introducing a new way of being here... \"I'm here and I'll learn to listen and be trustworthy for you\"","time":1674608845000},{"user":"helper","text":"\"I'm learning to be with this part that has been alone and learning to connect and communicate in ways that help us both feel better\"","time":1674608884000},{"user":"thinker","text":"i feel like that is a lot better and a lot more “beginner friendly” i feel like the statement i made before is just going to go through one ear and out the other","time":1674608937000},{"user":"helper","text":"This part you're mentioning is so important... something can look like its helpful but if it doesn't feel helpful it can do just that and not be integrated and actually help","time":1674608964000},{"user":"helper","text":"yay for us finding a more adequate thought to meet you here where you are","time":1674608982000},{"user":"helper","text":"When you imagine being with that history of challenges that kind of situation and think to yourself \"I'm learning to be with this part that has been alone and learning to connect and communicate in ways that help us both feel better\"","time":1674609030000},{"user":"helper","text":"how does that make you feel?","time":1674609034000},{"user":"thinker","text":"it makes me feel more opened up and that the closed part of me has just been alone and that thats all its ever known, that part of me should be communicating and that it would be safe for me","time":1674609104000},{"user":"helper","text":"and from those feelings what are some actions that you could try with yourself rather than going quiet or avoiding and closing?","time":1674609172000},{"user":"thinker","text":"thats the thing, i dont know what to do","time":1674609191000},{"user":"helper","text":"one place to start is that as you relate to yourself differently and you seek out relationships that are safe and trustworthy, that you can being take more and more bold actions towards that kind of life... Some actions are spending time learning how to listen to that part... spending time finding people who are trustworthy and that you can share about this... as well as beginning to imagine what it could be like to respond to differently in your relationships as you discover that you can be your own protector ","time":1674609324000},{"user":"helper","text":"does that feel relatable?","time":1674609333000},{"user":"thinker","text":"yes, i feel like i can definitely try doing those activities rather than just full sending myself and rushing myself into communication ","time":1674609367000},{"user":"helper","text":"yay","time":1674609371000},{"user":"helper","text":"okay we've come toward the end of this session/process of today","time":1674609402000},{"user":"helper","text":"thank you for trusting me with this part of your life","time":1674609429000},{"user":"helper","text":"and for being real with me this way","time":1674609433000},{"user":"thinker","text":"no, i should be thanking you, i feel like you really made me see a different perspective of myself. you made me realize that i actually dont have to feel or be alone so thank you :)","time":1674609480000},{"user":"helper","text":"<3","time":1674609481000},{"user":"helper","text":"yay","time":1674609484000},{"user":"helper","text":"that's what we're here for","time":1674609488000},{"user":"helper","text":"you'll have an opportunity to leave a review as well as to pay what you want :)","time":1674609520000},{"user":"thinker","text":"thank you again :)","time":1674609529000},{"user":"helper","text":"you're very welcome :)","time":1674609530000},{"user":"helper","text":"In case you wish to, you can consent to make this session \"public\" which means people can learn from what we did together. I believer there is no identifying information in the session so confidentiality should be safe but only do so if it's something you wish to do. ","time":1674611783000},{"user":"thinker","text":"how do i do that?","time":1674611831000},{"user":"helper","text":"By simply saying you wish to here. We do it in the background and it shows up in our public sessions list on the homepage and cycles through as new sessions come through.","time":1674611880000},{"user":"thinker","text":"okay, i wish to make this public :)","time":1674611912000},{"user":"helper","text":"thank you for this generosity ","time":1674611929000},{"user":"helper","text":"Hi there, we didn't receive a payment if you intended to send one. ","time":1674668454000}]}