{"notes":{"thought":"So this is it?\n\nExistence is a contrived joke and now I'm supposed to breed and force a smaller version of myself through the same thing\n\nevery activity that should bring me joy makes me feel guilt\n\nThe time (or lack of) That I've dedicated so far only serves to make me feel like an imposter\n\nI know I should be practicing or doing something \"productive\"\n\nI am a major slave to my own thinking","event":"Nothing happens\n\nI pigeonholed myself in a lab job because I chose a major that made me sound smart rather than one I enjoy\n","feelings_behaviors":"inadequacy \nresentment\nguilt\n\ndistract myself\ndon't dedicate time to things I love\nWatch netflix\ndrugs  ","labels":{"control-fallacy":true,"should-statement":true,"labeling":true},"new_thought":"Thinking is a good servant, but a bad master\n\nWhere is the 'should' coming from?\n\n\"Neither J.K. Rowling nor Stephen King have MFAs. James Franco has two, and still hasn't written anything interesting.\""},"messages":[{"user":"thinker","text":"So is this it? I just do my job thing and watch netflix until I die? ","time":1611346347000},{"user":"helper","text":"Hi, thanks for joining us here at Cheese. I hear you're asking the big difficult questions. Is this all there is? ","time":1611346437000},{"user":"helper","text":"Can you tell me a little more about the thoughts you're experiencing right now?","time":1611346456000},{"user":"thinker","text":"I mean, there isn't really much to add to it.","time":1611346572000},{"user":"thinker","text":"it feels like existence is a contrived joke, and now I'm supposed to breed and force a smaller version of myself through the same thing?","time":1611346671000},{"user":"helper","text":"I hear you, I often struggle with such thoughts myself. I found the tools to develop more meaning in my life though, and hopefully we can do so for you too! Tell me, is there an experience you had that you believe may have triggered this way of thinking? Or perhaps, what events happen immediately before you think \"Is this it?\"","time":1611346774000},{"user":"thinker","text":"Events that preceded that thought: I'd have to say years of therapy. There isn't a specific trigger or event, rather the lack thereof? I've been clinically/majorly/whatever depressed for a long while, and it seems like the only answer (after so many years of therapists/psychiatrists and so many years of studying neuroscience on my own) is that depression is something that just happens to everyone when they attempt metaphysical philosophy. \"what is my purpose?\" is a trap of a question, as none of us obviously have one, but that also implies that, \"how do I cure my depression\" is another similar trap. Because there isn't any such answer, and more pills aren't helping anyone. ","time":1611347012000},{"user":"helper","text":"It sounds like you've already done a lot of thinking on this. We are not licensed therapists, but I do understand what you mean when you say depression can affect anyone when faced with the great void of their existence. There are many routes to take when faced with no answer. Some find meaning in the complete lack of meaning, it is a freedom of sorts. Some pursue God to create more meaning, some find love or make children as you mentioned. You say a lack of events lead to this train of thinking, as well as being well educated in the mind. I think that can qualify as an event too. You work, and watch netflix, and this leads to thoughts that 'existence is a contrived joke'","time":1611347210000},{"user":"helper","text":"What do you know about Cognitive Behavioral Therapy?","time":1611347221000},{"user":"thinker","text":"I know that the premise is to observe the way I identify with thoughts and feelings in order to change and perhaps eliminate what I can only describe as runaway feedback loops (i.e. anxiety, thoughts of worthlessness, anger, etc.)","time":1611347327000},{"user":"helper","text":"Yes! exactly. Well said. It's been proven that our emotions are a direct product of our thoughts. Controlling how we *feel* depressed, anxious, etc, can be very difficult. Controlling our thoughts however is definitely within our means, and recognizing the thoughts that cause us harm and rewiring ourselves in a way can be incredibly helpful. ","time":1611347405000},{"user":"helper","text":"So, what thoughts do you experience when you are faced with the thought \"existence is a contrived joke\"?","time":1611347424000},{"user":"thinker","text":"Oh man, that sentiment is pretty much at the heart of like, every thought that crosses my mind. Biden got elected, everyone is happy about the exact political and social conditions that got Trump elected to begin with coming up like a bad penny, and that thought pops up again. I work for 10 hours and come back at 9am again to the same lab position I pigeonholed myself into by choosing a major that made me sound smart instead of a field I'd actually enjoy, and the thought pops up. I try the activities I enjoy -- writing, making music, playing video games -- and I find myself just staring at the paper/guitar/steam library with this profound sense of, \"but why would I spend my time doing this?\" It's as if every activity that should bring me joy makes me feel guilt about trying to enjoy it. I've been told that happens a lot when you're depressed.","time":1611347664000},{"user":"thinker","text":"Mostly it's just...everything. We can all read Nietzsche and try to eke some semblance of positivity out of it -- \"well, sure, life has no meaning, but the lack of one implies that life has whatever meaning YOU choose to impart upon it\". That sounds very nice and liberating, until you realize that it leaves you exactly where you started: with the crushing weight of the responsibility of your own happiness.","time":1611347893000},{"user":"helper","text":"I do love Nietzche, I see what you mean though.. the responsibility of your own happiness can be a blessing or a burden. I'm going to take a moment and read through what you've shared with me so far. Thank you for expressing this. ","time":1611348012000},{"user":"thinker","text":"Oh take your time, I expect no answers. People with way more PhDs than I have fingers have tried and failed.","time":1611348082000},{"user":"helper","text":"Haha, Thank you for saying that. Luckily, we don't really provide answers here. We only help to provide some organization and perception, then you provide some answers, or find comfort despite the absence of them. ","time":1611348138000},{"user":"helper","text":"I'd like to ask you a little more about what you mean when you say you feel guilty when you try to enjoy things that should bring you joy? ","time":1611348173000},{"user":"thinker","text":"Right, I should have clarified. The guilt is a deep feeling of inadequacy followed by resentment that I didn't spend more time developing/perfecting the skill that made me experience inadequacy. Like, listening to a virtuoso when you've only been playing your instrument for a short while -- \"Damn, I won't be that good. Should've just practiced harder, every day. Why are you bothering now?\"","time":1611348300000},{"user":"helper","text":"I see, so when you attempt to do the things that bring you joy, such as guitar, and writing, rather than feeling a sense of fulfillment you feel guilt, inadequacy, resentment, and a sense of \"It's too late to bother now.\" Am I understanding correctly?","time":1611348384000},{"user":"thinker","text":"Yes. It's a very unfortunate and self-defeating phenomenon. I can't get better at the things I love unless I dedicate my time to them, but the lack of time I have thus far dedicated to the things I love only serves to make me feel like an imposter or a pretender. ","time":1611348487000},{"user":"helper","text":"I feel what you mean. It's a difficult cycle to break when we can't find the weak link to pull out. It's a self fulfilling prophecy. You listen to a virtuoso, think \"I haven't practiced enough, so I'll never be that good\" Decide it isn't worth the time and therefor continue not to practice and partake in less fulfilling habits instead. This in turn makes you feel inadequate, and resentful of yourself... which inevitable leads further into the well that life has no meaning and there's no point in trying to find one. ","time":1611348658000},{"user":"thinker","text":"Yeah, that's a pretty astute observation. The cycle actually continues past that, because then when I try to distract myself from my inadequacy by, say, playing video games or watching TV or whatever, I end up feeling guilty even as I do these things because I *know* that I should be practicing or writing or reading or /something/ productive. Which is interesting, in and of itself. Like, why do I feel a perpetual compulsion to exclusively be doing \"productive\" things? Enjoying myself IS productive, no? Or, at least, time spent doing things you enjoy is (by definition) time well-spent. I'm simultaneously aware of all of the contradictions my brain is exercising, and very prone to allowing them control over me anyways.","time":1611348932000},{"user":"helper","text":"It's an interesting internal, and I would even say societal, expectation of what \"productive\" really means, and what forms it takes. I'm glad you see that enjoying yourself has the potential to be productive by definition, but I understand it can be difficult to actually accept it. Awareness of how our mind is working, and why, is the first step to control. You've certainly put in a lot of work towards that already. I also have a couple tools here I think will help. ","time":1611349116000},{"user":"helper","text":"I'm going to take a moment and organize what you have shared with me so far and write a summary for us to examine. ","time":1611349149000},{"user":"thinker","text":"This has been helpful, in case that was in question. It's useful to express these feelings, even if \"answers\" are elusive. So thanks.","time":1611349258000},{"user":"helper","text":"I appreciate your support! It helps me help you :)","time":1611349292000},{"user":"helper","text":"Okay, so you came to me in a place of doubt and meaninglessness. Your life has been a series of events, or lack thereof, that consistently lead to the big, humane yet unapproachable questions. \"Is this it?\" You work long hours at a lab, a job you got because you picked a major you felt made you look smarter rather than one you enjoy. You think hard and deep about commonplace happenings in the universe around you. Politics, family, every day activities.. all of it brings thoughts such as \"existence is a contrived joke, and now I'm supposed to breed and force a smaller version of myself through the same thing.\" When you attempt activities you enjoy, such as writing and making music and video games, you are immediately confronted with thoughts such as \"the time (or lack thereof) only makes me feel like an imposter\" Because surely you should be much better by now. This makes you feel inadequate, and resentful of yourself, which of course isn't going to foster creativity or joy out of anything. You know you \"should\" be productive, but when faced with this guilt it is easier to distract yourself with simple meaningless activities. This completes the cycle that life has no purpose, and isn't worth finding one for. Am I understanding correctly? Is anything missing? ","time":1611349799000},{"user":"thinker","text":"No, you've hit the nail on the head in almost every respect. My coping mechanisms (drugs) are missing, but that's kinda superfluous and symptomatic.","time":1611349934000},{"user":"helper","text":"It's easy to turn to substances that are sure to make us feel better, even if just for a little while. In a way I think drugs are similar to tv and distractions, but with more stigma. I think I understand the place you're in. I'm sorry to hear this wonder at the universe has manifested in a way which continues to harm you. It's clear that you're a deep thinking, and do have passions and care when the guilt isn't so crippling. I think we can find a way to access that joy in little things. Thinking intensely can be made beautiful when it is broad in emotions, rather than narrowed down the twisting turns of depression. ","time":1611350177000},{"user":"helper","text":"Before we move on, I'd like to confirm about what is most troubling here. I'm gathering that the feelings of guilt and inadequacy which are attached to the things which you enjoy most are making it difficult to enjoy life at all, leading to thoughts that life is a contrived joke. I believe if we rediscover the ability to enjoy little things, the ability to enjoy life will improve as well. Would you agree that this is most troubling to you today? Is there anything you would like to add before we continue?","time":1611350320000},{"user":"thinker","text":"I'd say your assessment is pretty accurate, and that I have become the highest-functioning depressed person that I know. I found that the ennui/pointlessness goes away with a bit of assistance from substances, and that my eternally-self-criticizing inner monologue is at least partially mollified. If I drink/smoke/etc, I can write without hating every sentence, or practice without getting frustrated every time I stumble. I think that I think too much, which Alan Watts would call, \"a disaster\". Thinking is a good servant, but a bad master, and I am to a major extent a slave to my thinking. Substances help the clamor to die down, but I'm also acutely aware of the dangers of developing schizophrenia or encountering a manic episode as a result of this. I'm self-destructive, but I'm apparently extremely careful and meticulous in my demolition.","time":1611350834000},{"user":"helper","text":"Pouring the gasoline slowly ;)","time":1611350861000},{"user":"thinker","text":"Exactly, and starving the fire when it burns too hot.","time":1611350877000},{"user":"helper","text":"It sounds like you have extensive control of the aftermath, but when you try to regain control at an earlier stage, say before destruction, you have the thought \"I'm a slave to my own thinking\" and continue to perpetually play catch up. I love that \"thinking is a good servant, but a bad master\" that fits our philosophy so well! ","time":1611351026000},{"user":"helper","text":"I think we're ready to pull out the \"cheese\" from your experience. Cheese is what we call the distortions in perception that make it difficult for our brain to see clarity and function at it's highest capacity. As someone who takes recognizes the power of the mind, I think you'll really like this. I see a couple that I think fit your thoughts here, but I welcome you to join me. I'll be going into the cheesesburger icon on the right hand side here in the thought box. ","time":1611351158000},{"user":"helper","text":"I think so too! That's a great choice. When you have the thought \"I am slave to my own thinking\" You mind and heart *believe* it, making it so much more difficult to actually regain the power over your mind. This pattern of thinking is also evident in all the research that you've done about the mind, in recognizing that you do have the choice to find meaning, but deciding not to. What did you see in \"control fallacy\" That spoke out to you?","time":1611351312000},{"user":"thinker","text":"Honestly, it's the part that I recognize the most about my self-pitying and whinging (British word, I think). I always put the blame on anything other than myself, if possible, though I'd like to think I'm growing out of that. I recognize that the thought, \"So this is it?\" is a question being posed to no one in particular, since no one else can give me the answer. It's one that I, infuriatingly and screaming all along the way, must find for myself. I also recognize that the guilt is coming from the part of me that wants to assert control -- \"Can we please stop playing video games and actually get better at the thing we wanted to get better at?\" is what I imagine it to ask. And the only person that's saying, \"no, we're gonna play vidya til like 3 am\" is me. I'm being facetious, which is another coping mechanism, but I am my own worst enemy. No one else is going to berate me for doing nothing all day; they see that I have a job and that's enough to convince everyone that I'm fine. Naturally, I took it upon myself to do the berating.","time":1611351712000},{"user":"thinker","text":"I'm in an abusive spousal relationship with my own head","time":1611351722000},{"user":"helper","text":"That actually brings me directly to the next cheese, and I think this one has the potential to help you a lot...","time":1611351752000},{"user":"helper","text":"\"should statements\" I see this sentiment scattered through a lot of the thoughts here which are giving you pain. For example, \"I know I should be practicing or doing something productive.\" It's also evident in how a lot of your thoughts are reactionary to what society expects of you, like children, and a \"smart\" major. This pattern of thinking, this embittered coercion, only leads to the feelings of inadequacy, resentment, and guilt, which make it so much harder to enjoy that activities which you've chosen especially for their pleasure such as writing and music. David Burns puts it really nicely, he says \"You feel like a delinquent child under the discipline of a a tyrannical probation officer. Every task becomes colored with such unpleasantness that you can't stand to face it. Then as you procrastinate, you condemn yourself as a lazy, no good bum. This further drains your energies.\" And, in your case, only ingrains deeper the belief that existence is a contrived joke and those activities aren't worthwhile meaningful pursuits after all. ","time":1611352046000},{"user":"helper","text":"That being said, I really like a lot of what you said about control fallacy, and I'm so glad it resonated with you. It can be very easy to come right out of control fallacy and fall deeper into the muck of should statements. Recognizing that you *want* to do things for yourself, not that you have to, can be the key the turns the lock to fulfillment. ","time":1611352110000},{"user":"thinker","text":"first of all, \"embittered coercion\" is a line I am stealing.","time":1611352129000},{"user":"helper","text":":) take it away","time":1611352140000},{"user":"thinker","text":"Second, that David Burns quote essentially summed up my entire childhood and adult life (thus far). I didn't recognize or realize that Should Statements are a detrimental or feedback-prone feature of the internal monologue -- I always just considered it the \"voice of reason\" that tells me what the correct course of action is. Which sounds a lot like Stockholm Syndrome, now that I reflect on it. I definitely feel like a majority of my life experience thus far has in fact been that feeling of embittered coercion -- maybe not through force, explicitly, but growing up, there were always consequences to not doing what my parents expected. I'm pretty certain that I only got a neuroscience degree in order to make them...proud, or at least satisfied. Which, naturally, didn't work at all seeing as my parents now expect me to attend some sort of graduate program. I... I hate academia. I can't stand it. I cannot put into words how little of a shit I can possibly give for both my field or anything associated with it. I have forgotten more Biology than most people will ever bother to Google, and the idea that I should do more makes me long for bathtime with electronics. I can't help but feel that voice in my head is a mutated form of my parents, which is deeply and profoundly annoying. I'm rambling, but I think you get what I'm trying to say -- I'm just processing the concept that I don't need to base all my actions and life on \"Should\". I mean, it's a good point. ","time":1611352763000},{"user":"thinker","text":"\"Should\" got me all the way to where I am now, and I'm not really loving that, am I?","time":1611352780000},{"user":"helper","text":"Wow I see it really resonates with you! I did see the pattern in many of your choices and life events. It can be the sneaky cheeses that affect us the longest, unnoticed in the shadows. Now we pull shoulds and look watch it burn in the harsh sunlight and you can find a new way of considering your path in life, and allowing it meaning. ","time":1611352865000},{"user":"helper","text":"I'm sorry to hear that you've already made significant choices that stemmed from this deep poisonous should reasoning, I imagine that can be hard. Academia is a hungry and unrelenting beast, always wanting more of your time and resources. Recognizing that you don't have to succumb to it, and how many other options are out there, ones that may actually fulfill you.. is an integral first step to finding purpose. ","time":1611353000000},{"user":"helper","text":"I should say actually, That the educational system works well for many. It's not for everyone, I feel the same way..","time":1611353075000},{"user":"thinker","text":"Yeah, I didn't really consider my inner monologue detrimental before. And with regards to the educational system -- I don't blame it, I just recognize my severe dispassion for it. My family told me I was cursed, in the sense that I was theoretically smart enough and whatever-enough to do basically whatever I set my mind to. Naturally, I proved them right by failing to choose well, or rather by failing to ask myself what I actually wanted. I literally decided my major by having my friends write the most pretentious ones they could think of and then I pulled \"neuroscience\" out of a hat. I almost did theoretical physics or physical chemistry, or philosophy. And I have no patience for... almost any of those. I want to go back in time and beat some sense into that idiot. He should've just, idk, done LITERALLY anything else. Hindsight is a cool feature of life.","time":1611353451000},{"user":"thinker","text":"I'm rambling again, but yeah.","time":1611353461000},{"user":"helper","text":"You pulled it out of a hat! That is crazy... ","time":1611353473000},{"user":"helper","text":"Well, I do believe that if you were 'cursed' then, to do whatever your mind is capable of, then you can be cursed now. But this time you are older, wiser, and more in touch with yourself and what you really want. The base of the curse/blessing hasn't changed. You are still incredibly smart, and you can still do anything you want. The only difference is a couple of years. You talk about hindsight, but regret will only bring more pain. I think this awakening can bring about a future that is different from the past, if you allow it. ","time":1611353581000},{"user":"thinker","text":"I may have lost the meaning of the phrase when I attempted to translate it -- when I say \"cursed,\" I'm referring to a specific sort of thing that people say back in my country: \"May you find success and wealth and still find a way to be miserable\". To clarify: I by no means consider myself to be an intelligent person. I've spent far too much time in the company of myself to believe that. I just think I had enough wits and gumption to push through whatever, and this is what I did with it. I did choose differently, and quite recently: instead of applying to graduate programs, I applied for MFA programs in creative fiction writing. I applied to several schools, but they're all \"reaches\" as far as my prose and technical skill is concerned. I've been anxious about those for a while, but now I can't tell why. I thought it was because I feared rejection (who doesn't?), but I think now I fear that I'm should-ing again. \"Well, if I want to be a writer, then I SHOULD apply to MFA programs, and I SHOULD get in if I'm good, right?\" Which I now think might be the actual source of the anxiety -- I'm not anxious about not getting in, I'm anxious because I conflated my worth as a writer with an acceptance letter from competitive writing programs. The difference this time is that I want to get accepted for me. This was me doing something for myself. Maybe the \"Should\" voice was the instigator of the idea, but the voice was still looking out for my best interests.","time":1611354157000},{"user":"helper","text":"I am so glad to hear you're pursuing creative writing. I  don't know you well, but I enjoy your words and I can sense a passion in that direction that you haven't expressed for your current work. I'm curious, that phrase, what country is that from? It sounds like something my Jewish Grandma would say. ","time":1611354221000},{"user":"thinker","text":"It is a former Yugoslavian (croatian, serbian, bosnian, montenegran) phrase. We also enjoy a good \"Yiddish curse\" as those phrases are sometimes called :)","time":1611354291000},{"user":"helper","text":"As for should voices having positive results, That makes a lot of sense. It is the reason that Should Statements can go unnoticed for so long, they are mistaken for motivation, drive, and as you said \"the voice of reason.\" I think wanting more from yourself can be a beautiful thing, when expressed appropriately. ","time":1611354307000},{"user":"helper","text":"Yes, yiddish curse. Classic. ","time":1611354320000},{"user":"helper","text":"As for your anxiety related to the reply for these programs, I can definitely see how should statements could be partly responsible. I also sense a little bit of \"labeling\" which I just opened up on the right hand side here. By allowing a letter from the school to label you as a good writer, or not, you are allowing a couple of flimsy words to decide your self worth. There is so much that goes into every deliberation, down to the mood of the person who reads your application! A \"good writer\" is an ever fluctuating title which doesn't really mean a thing. You know if you write well, if you accept someone else's label of your worth become a label on your heart this will only lead to further anxiety and feelings of inadequacy.","time":1611354520000},{"user":"helper","text":"That being said, I feel like this may be a topic for another session! I feel like we learned a lot here today. There is a final step which is crucial to rewiring the brain and writing new paths to follow when confronted with a lack of meaning in life, and wanting to pursue activities which give you joy. This is creating a new thought. A little positivity warrior that will come to your aid in times of need. I like for it to target the cheese directly, but it isn't necessary. All that matters is that it is compassionate and true to you.  ","time":1611354642000},{"user":"helper","text":"Want to give this a go?","time":1611354648000},{"user":"thinker","text":"Sure, how do I start?","time":1611354707000},{"user":"helper","text":"It's unique to every person really, if you like we can review some of the responses to the cheese we had above. It can along the lines of recognizing your control and eliminating the thought that you're a slave to your mind, as well as knowing that things you do for yourself are because you want to, not because you 'should'. You write so eloquently I'd like to allow you to take then reigns from here though! ","time":1611354811000},{"user":"thinker","text":"Right, ok. So a phrase or word that helps me to remember the challenges to the negative-thought-loops that I had today?","time":1611354948000},{"user":"helper","text":"Exactly. A couple sentences is okay too","time":1611354962000},{"user":"thinker","text":"\"Thinking is a good servant, but a bad master\" is one I like to come back to. That's Alan Watts, again. Good for the control fallacy.","time":1611355006000},{"user":"helper","text":"Yes, I love that. And how would you like to target the Should statements?","time":1611355031000},{"user":"thinker","text":"I think a good question to ask myself is, \"Where is the 'should' coming from?\"","time":1611355102000},{"user":"thinker","text":"Like, is it coming from me, out of a genuine desire to do something, or is it coming from an expectation that I have of myself?","time":1611355150000},{"user":"helper","text":"That's interesting. Usually I try to be rid of shoulds entirely, but I like that you maintain respect for it here, as long as it comes from a place of genuine self betterment. It's very difficult to toss them away permanently. I like that!","time":1611355205000},{"user":"thinker","text":"And, I guess for Labeling, I could always remember that, \"Neither J.K. Rowling nor Stephen King have MFAs. James Franco has two, and still hasn't written anything interesting.\"","time":1611355265000},{"user":"helper","text":"Haha, that's true. That definitely takes a lot of power out of the label! ","time":1611355277000},{"user":"helper","text":"I'm sorry, I didn't ask earlier how that resonated with you. Did the labeling feel relevant to your experience?","time":1611355294000},{"user":"thinker","text":"Oh definitely. Either I or society is always attempting to pin labels onto my person. I think the practice of stepping away from those is both necessary and unorthodox.","time":1611355344000},{"user":"helper","text":"Wonderful. That's true, I think labeling is really common because it thrives so well in our society. It's definitely one of the cheeses I find myself slipping into most frequently. ","time":1611355394000},{"user":"helper","text":"What feelings come up for you when you think these thoughts \"Thinking is a good servant, but a bad master\n\nWhere is the 'should' coming from?\n\n\"Neither J.K. Rowling nor Stephen King have MFAs. James Franco has two, and still hasn't written anything interesting.\"?","time":1611355422000},{"user":"thinker","text":"I don't think any feeling comes up for me, but my leg calms down a bit and I don't sweat as much. Sometimes the absence of pain/stress/anxiety can be a narcotic of its own.","time":1611355493000},{"user":"helper","text":"Hm true, so a calming.. that's really good. And that mostly answer my next question, which is, how do you feel now compared to when we started? Is there anything you would like to add?","time":1611355532000},{"user":"thinker","text":"I just felt like I was treading water for ages, and that drowning would've been a kind of peace. Living with depression is inherently exhausting, which is why I phrased my initial thought so half-assedly, \"is this it? just neflix til I die?\"","time":1611355655000},{"user":"thinker","text":"Now I feel less energy above my shoulders, if that makes sense. Anxiety and stress always bunch up in the head and neck for me, and it feels like I just set down a bit of some invisible weight I was carrying.","time":1611355731000},{"user":"helper","text":"That makes sense to. It's like a heavy tension. Well, I really enjoyed our conversation today. Thank you for being so open and encouraging. Remember these new thoughts work best through repetition, so whenever you have thoughts that lead back into the old circuits, you can combat it with these thoughts. \"Thinking is a good servant, but a bad master\n\nWhere is the 'should' coming from?\n\n\"Neither J.K. Rowling nor Stephen King have MFAs. James Franco has two, and still hasn't written anything interesting.\"","time":1611355837000},{"user":"thinker","text":"\"Repetition Legitimizes\" -- my old piano instructor, on the topic of making a mistake whilst playing.","time":1611355856000},{"user":"helper","text":"Exactly. Both the good and the bad, habits are only what we do/think and we get to choose!","time":1611355889000},{"user":"thinker","text":"Well thank you very much for helping me today. It really was useful.","time":1611355994000},{"user":"helper","text":"It was my pleasure. Truly. ","time":1611355998000},{"user":"helper","text":"Before you go, I was wondering if you may be able to rate us on the bottom right? We're still in beta and it helps to know where we do well :)","time":1611356025000},{"user":"helper","text":"Also on that note, I was wondering how you would feel if we were to use some or all of this session as an example for future trainees? We are still building up our system and I feel there are some good learning opportunities here. Of course, it is totally up to you and privacy is assumed unless you say otherwise. ","time":1611356103000},{"user":"thinker","text":"Yeah, go ahead! My name isn't mentioned, so I think it's totally fine.","time":1611356384000},{"user":"helper","text":"Thank you :) I really appreciate that. ","time":1611356400000},{"user":"thinker","text":"And yes, you were immensely helpful today. Thank you!","time":1611356407000},{"user":"helper","text":"I'm so glad! I feel I learned a lot too. Enjoy the rest of your day, and if you'd like to discuss this more, or anything else that may be troubling you, please feel free to return. ","time":1611356460000},{"user":"helper","text":"Goodbye :)","time":1611356469000},{"user":"thinker","text":"Have a great day, and goodbye :)","time":1611356471000}]}